window.func=function(lib,game,ui,get,ai,_status){
            game.import('character',function(){
                var nyhzrlj={
                    name:'nyhzrlj',
                    connect:true,
                    character:{
            "lnyhzr咯哩咯哩ol":["female","zhi",3,["nyhzr仙灵伙伴ol","nyhzr迷藏印记ol"],["ext:扩展ol/Newlnyhzr咯哩咯哩.jpg","des:大多数生灵都逃不过时光的流逝，然而咯哩咯哩却不属于此类。作为自然万物之精华，咯哩咯哩拥有着一颗干净纯洁的心、永远不会长大的外形，以及与花草百兽沟通的奇妙能力，而她的名字则来源于她的口头禅：咯哩。<li>在大自然中独自生活许多年后，出于对人类世界的向往和对新朋友的渴望，咯哩咯哩带着她的小伙伴——妖精皮皮，一起来到了人类的城邦。咯哩咯哩带领孩子们玩耍，并用魔法暂时将桌椅变成花朵和动物来增添乐趣。但人们似乎并不领情——出于对魔法和力量的恐惧，大人们很快便让孩子们疏远了咯哩咯哩。<li>伤心的咯哩咯哩离开了这所城邦，重新寻找一个善良美好的新世界。途经决战之谷时，咯哩咯哩和皮皮遇到凶兽饕餮，它正准备吞噬最近的人类城邦。尽管遭到人类的疏远，但为了可爱的孩子们不受伤害，咯哩咯哩毅然与饕餮展开了战斗。然而饕餮实力强大，咯哩咯哩和皮皮陷入了险境。危急关头，一位来自异世界的男人“拳”突然出现，在他的帮助，饕餮终于败退离去。<li>咯哩咯哩对这个胸前有着北斗七星状伤疤的男人产生了浓厚的兴趣。面对这个好奇又天真的小家伙一个又一个的疑问，拳将自己的经历和扫除一切邪恶不公的决心告诉了她。听完拳的叙述，咯哩咯哩从他的身上感受到了巨大的勇气和信念的力量，她意识到，与其寻找一个虚无缥缈的新世界，不如从现在开始，创造并且守护现有的一切。于是，她决定成为拳的伙伴，和他一起踏上未知的冒险之路！<li>我才不会害怕呢！咯哩！<li>——咯哩咯哩"]],
            "lnyhzr莉莉姆.提露埃拉ol":["female","li",3,["nyhzr恐惧镰刀ol","nyhzr恐惧结界ol"],["ext:扩展ol/Newlnyhzr莉莉姆.提露埃拉.jpg","des:恢弘的钟声和吟唱笼罩着整座城市，人们云集在教堂之中，进行着庄严而神圣的宗教仪式。而在教堂的穹顶，象征着神权的巨大十字架上，却坐着一个美丽而妖娆的身影，泛着宝石光芒的瞳仁和背后的翅膀昭示着她令人畏惧的身份——夜之魔女莉莉丝和魔王撒旦的女儿，地狱的公主——莉莉姆.提露埃拉。 <li>同她的姐妹们一样，莉莉姆. 提露埃拉身上永远散发着青春的活力，外表充满魅力却又让人心生畏惧，由血统赋予的强大魔力能让她在地狱和人间穿梭自如，并不断出现在人们的噩梦之中。但和她那些只顾享乐的姐妹们不同，莉莉姆.提露埃拉更加危险且具有野心：她想把所有的人类土地都变成充满滋生魔物的土壤。 <li>就在提露埃拉不断实施着她的邪恶计划之时，其他莉莉姆以及她们手下的魔物们纷纷遭到了猎杀，而所有的线索都指向了一个人：猎魔人露娜。<li>这场关于猎杀的游戏激起了提露埃拉心中的邪恶欲望，她追随着猎魔人的踪迹来到人类的城邦。看着脚下的城市和熙攘的人群，莉莉姆.提露埃拉站起身来，灵活地跳到十字架顶端，朝着面前的城市张开双手，像是要把整座城市收入怀中。<li>“这里，马上就要完全属于我了……到时候要做些什么呢?想想就……”<li>亢奋的情绪突然被她自己打断，注视着整座城市的瞳孔突然将视线锁定在一间普通到再也不能普通的屋顶上，像是发现了宝藏一样，莉莉姆. 提露埃拉眯起了眼睛，嘴角露出了摄人的微笑。<li>“找到你了，要开始享受游戏的乐趣了。”"]],
		    "lnyhzr龙骑士ol":["male","li",4,["nyhzr龙人血脉ol"],["ext:扩展ol/Newlnyhzr龙骑士.jpg","des:边境的小酒馆里，老板略带神秘的说起这样一个传说：<li>好心的领主老爷和他的养子生活在一座美丽的庄园里。<li>然而，魔龙化身的养子本性嗜血又残暴。他魔性大发之后，重伤领主，焚毁庄园。据说他身覆鳞片，口中喷火，甚至还会吃人！ <li>——那段经历对流浪骑士来说就像噩梦一般，如果真是场梦就好了……<li>那一天，从血脉中涌出的能量仿佛要将身体撕成两半，难以忍受的巨大痛楚令他失去了理智。<li>清醒之后，看着血泊中的领主和自己可怕的身躯，他只能惶恐地逃离。 <li>这些年来，骑士独自一人在荒原上流浪，而根植于血脉中的力量也与日俱增。幸运的是，在旅途中磨练出的坚韧和勇气让骑士逐渐学会了如何在狂暴中保持清明。在一次从魔兽群的包围中救下落难的冒险者后，他第一次感到这股力量会是种恩赐。 <li>兴奋的流浪骑士马不停蹄地想要回到家乡，但迎接他的却不是领主慈祥的微笑，而是冲天的火光、村民的哀嚎以及大队的强盗…… <li>那天以后，王国又多了一个传说，关于龙骑士的传说。"]],
            "nnyhzr妮娜ol":["female","min",3,["rnyhzr幽影之蜕ol","nyhzr女皇神威ol"],["ext:扩展ol/Newnnyhzr妮娜.jpg","des:针对女王妮娜的政变在一个夜晚爆发。那些曾被赦免的贵族们带着士兵冲进王宫，将所见的人统统杀死。<li>“抓住妮娜！”熊熊火焰在王宫中肆虐，照亮一地冰冷的尸体与丑恶背叛。<li>“杀死她，她已不配为王！” <li>目标明确的叛军一路攻入寝宫，妮娜只得带着铁卫逃往王城北面。那里背靠人人恐惧的禁忌森林，叛军决不会在那设防。然而双方实力过于悬殊，当他们来到禁忌森林前，铁卫已悉数战死，只剩走投无路的妮娜一人被包围。 <li>贵族们轻蔑地嘲笑她：“你是要投降，还是逃入死地？” <li>女王的脸因恐惧而苍白，但她仍尊严地抬头走入森林：“以我的灵魂发誓，我会回来的！把你们全部杀死！” <li>叛军骚动地望向漆黑的森林，想要确定女王是否已死。而妮娜身陷密林深处，被冰冷黏丝束缚双脚。纷麻触感由四肢蔓延，骚动的剧毒螯爪遍布全身，一点点收割生命。曾经高傲的冰雪陷入地狱，死亡已如影随形，妮娜绝望地流出眼泪。 <li>“我不能死……”复仇的怒火涌上心头，被背叛的憎恨和被啃食的痛楚让她从灵魂深处发出嘶哑呐喊：“我绝不能死！” <li>“你要向那些背叛你的人复仇么？”甜腻诱惑的声音突然充斥在她耳边。"]],
		    "dnyhzr德古拉ol":["male","zhi",3,["nyhzr血虐暴风ol","nyhzr歃血为神ol"],["ext:扩展ol/Newdnyhzr德古拉.jpg","des:那座古堡矗立在林中已经很久，崩塌的外墙、腐朽的枯木、夜枭的啼叫，传说中的恶魔……一切令人生惧的元素仿佛都集中在它的身上。 <li>过去的这里并不是如此死气沉沉，令人生畏。德古拉伯爵一家是这片土地的主人。伯爵夫人虽然出身卑微，却颇受伯爵宠爱。浪漫的爱情故事也让无数人羡慕。 <li>平静的日子被教会的传令所打破。他带上家族精锐出发了。战斗几乎没有遭到抵抗，这种单纯的杀戮令伯爵的不满更加浓烈。当伯爵归来之时，迎接他的不是欢呼与鲜花，而是满目疮痍，尸横遍野……他这才明白出征不过是教会的幌子，隐藏在背后的目的是铲除异己。抱着爱人的尸体，德古拉的愤怒如同滔天巨焰，他诅咒神明，诅咒教会，发誓要让他们血债血偿！<li>自那之后，伯爵失去了踪迹。尽管教会四处搜寻，却毫无线索。<li>数月后，曾参与围剿的人皆以怪异的方式死去，死者无一例外被吸干鲜血！教会分支也在熊熊大火中化为灰烬。人们纷纷传言德古拉伯爵回来了，他将灵魂献给魔鬼，以换取复仇的永生之力。<li>他视教廷为永世之敌，仇恨不灭，直至那伪善的光明被彻底摧毁！"]],
            "hnyhzr后羿ol":["male","min",4,["nyhzr逐阳之弓ol"],["ext:扩展ol/Newhnyhzr后羿.jpg","des:后羿环顾着四周，目力可及之处，只有龟裂的大地。匍匐在他脚下的老妪已经被灼热的太阳晒脱了水分，恍惚间就像一段焦枯树干。 <li>天空中的太阳们依旧嚣张地散发着全部的热量。<li>是的，太阳们。<li>它们是天帝的儿子，每日有一人化身为太阳穿过天空，撒下光热，哺育世间万物。然而，周而复始的日子令它们觉得厌烦。于是，再一个黎明到来时，它们一起出现在天空中， <li>太阳们散发出的热量烤焦了大地，树木庄稼化为灰烬，人间瞬时化为炼狱…… <li>不能再这样了，总得有个人站出来，帮助大家脱离苦海。<li>后羿回过神来，他按了按腰间的箭囊，那是最后的希望……不能再等待了！他从肩上取下那张红色的弓，抽出了箭矢。 <li>满弓！射出！ <li>奇迹出现了！骄横的太阳纷纷坠落，当第九个太阳落下之时，世界再度恢复了原貌。 <li>人们铭记着他的威能，自此，“神射手”之名名垂千古！"]],
            "snyhzr苏尔肯ol":["male","zhi",3,["nyhzr颠倒灵魂ol"],["ext:扩展ol/Newsnyhzr苏尔肯.jpg","des:自收留苏尔肯之后，普赛克再无来客。<li>有巫师大人为庆典燃放烟花，普赛克村落将迎来最美妙的夜晚！”村长握着白袍的手表示欢迎。人群外，苏尔肯若有所思。<li>普赛克村落不接纳外人，苏尔肯是第一个。那时他身负重伤，因脑中的魔法余震失去记忆，是阿芙洛的照料治愈了他。如今阿芙洛已成为他的妻子，安逸的农耕生活让他并不在意遗失的过去。只是乱世锤炼出的敏锐不断萦绕着他——白袍此行并不单纯。<li>绚烂的烟花让人心生矫情，狂欢后，妻子已沉沉睡去。苏尔肯轻抚爱人的发，门外急促的脚步声显得不合时宜。村长连夜召集了所有青年男子，白袍缓缓开口，“先生们，十年前龙骑士在荒原上剿灭魔族的时候，漏了一个，我追踪至附近成功解决遗患，近日却洞察到魔族部队正往此处进军，想必这里已经暴露，转移为时已晚。”巫师的话就是一颗炸弹，众人如惊弓之鸟，各种声音逼人发狂。苏尔肯低头抚摸婚戒，他只希望阿芙洛安全。脑中上演各种预想后，他决定赌一把，抬头迎上白袍意味深长的视线，“巫师，我能做些什么？”<li>苏尔肯紧紧追随白袍的魔能之球，在指引下找到了独行术士，乞求抵御魔军的力量。<li>“虽然我欠白胡子一个人情，可一切还要按我的心情来。”独行凑近苏尔肯，用两个没有眼球的黑洞“打量”苏尔肯，“你？哈哈哈，变味的臭虫确实能勾起我的兴致！白袍这手好棋，就让我来添添彩吧！”闻言同时，苏尔肯脑中呈现村长与一个村民被黑影绞死的画面。他仿佛知道独行要干什么，嘴上不停地哀求，心中不断地祈祷，直到阿芙洛的血染红被褥，他彻底崩溃。他感受到一股强大的力量开始流入他的身体，肉体被黑影腐蚀，碎骨畸生。苏尔肯听到来自独行的戏谑，“套了羊皮，真以为自己是羊了？”<li>苏尔肯被独行的魔法送回村落。魔军已至，白袍制造出巨大屏障包裹住村民，来不及等苏尔肯理清头绪，白袍吼道，“抓紧时间，要撑不住了。”苏尔肯需要答案，需要慰藉，至少他希望爱妻的死有价值。顷刻间，他的力量直逼而去，黑色迅速蔓延，瓦解了魔军的攻势。每倒下一个尸体，苏尔肯就摄入一丝灵力，他走过的每一寸土壤之中，都保留有亡魂的温度。魔军将领在弥留之际，质问道，“你也来自黑暗，为何要与我们为敌？”还未听到苏尔肯的回应，便化作灵力的祭品。<li>全灭魔军，苏尔肯回身走向屏障，熟悉的面孔唯少了三人。村民根本不在意淹没在黑影里的悲伤，此起彼伏的是对白袍的哀求，“巫师大人，昨日你说苏尔肯就是当年遗漏的魔族，他已不属普赛克，我们全村恳请你不要停止屏障。”<li>苏尔肯闻言颤抖着伸出手骨，啊，果然无法穿过屏障，他突然明白魔军将领和独行说的种种。他一直都是对的，妻子终究难逃厄运。村民怎么看他又有什么所谓？他沉默，走向自己的家。白袍转头打断空气里的恐惧与好奇，“走吧，我们撤离到安全的地方。”<li>从此普赛克村落仅剩下一抹孤独而漆黑的背影。他守着一副尸体，远离活着的人"]],
            "nnyhzr瓦尔基里ol":["female","min",4,["nyhzr困兽之斗ol"],["ext:扩展ol/Newnnyhzr瓦尔基里.jpg","des:她是地上国王的女儿，她是被诸神选中的战士。<li>她的长矛由奥丁亲自赐下，神光闪烁。当那点光芒闪烁进敌人的眼眸，那便是向他们宣告死亡的来到。<li>她的容貌犹如初升的太阳，她的身姿轻盈曼妙。在吟游诗人的歌中，那些栖息在世界树的神鸟献出它们的羽毛，装点她的战袍。<li> “奥丁的侍女”，人们带着敬畏称呼着她。她的到来，不仅仅意味着战局的提前结束，也意味着神域的挑选开始。她将在战场上赐与勇敢的战亡者美妙的一吻，并引领他们带往英灵殿。在诸神的黄昏来临之前，需要完成的事情，还有很多。<li>她的名字是瓦尔基里，人们更愿意用另一个名字来形容她——“女武神”！"]],
            "knyhzr凯撒ol":["male","li",4,["nyhzr永恒之斩ol"],["ext:扩展ol/Newknyhzr凯撒.jpg","des:以我一生之力，征服我所见的土地；我来，我见，我征服。” 大帝如是说，于是他执起永恒之剑，挥剑所向，万众臣服——这就是凯撒，我们的王！<li>从他降生之时，神明就挥舞霞光为他伴礼。智慧、优雅、勇气、天赋，这是大帝身上永不或缺的荣光！<li>他是神明宠爱的圣子，优雅的白狮圣兽塞乌斯从神山来到吾王的身边。它带来神明的圣谕：惟有大帝，才是这世间真正的王！再长的诗篇也无法叙述大帝的英勇，由他带领的军队，永远没有人能够阻挡。他所立下的决议，带领我们走向辉煌的顶端。<li>他是最强的勇士，他是神明之子。他为神圣的罗马帝国立下了永恒的基石，当一切结束时，他放弃了大帝的尊荣。<li>在神圣的霞光中，他与圣兽塞乌斯悄然离去，神山才是他即将前往的方向。他将是永远以神光笼罩罗马的神明——永恒之王，大帝凯撒，尤利乌斯！"]],
            "xnyhzr小乔ol":["female","zhi",3,["nyhzr仙荷甘露ol","nyhzr凤求凰ol"],["ext:扩展ol/Newxnyhzr小乔.jpg","des:当今大势，天下三分，英雄辈出。但凡英雄辈出之时，便少不了佳人斗艳，惹得祸水潮生。<li>其时，三国之间有江东二乔，美貌绝世。魏都霸主曹孟德曾慨叹：一愿扫平四海，以成帝业；一愿得江东二乔，置之铜雀台，以乐晚年，虽死无恨矣——仅以此言，便可知双姝绝色。<li>妙龄双姝各自嫁得了如意郎君。那小乔，嫁得是东吴美周郎。周郎者，东吴都督周瑜周公瑾是也，其人丰姿隽秀，胸有百万雄才。而小乔闭月羞花，心中亦自有锦绣。<li>二人琴瑟和鸣，夫妻和睦。但在这天下纷乱之时，周郎有天妒之才，岂能拘于小家，而是不顾大局？ 为随夫君左右，小乔褪下红妆换武装，紧随周郎左右，转战千里，坚强之处，不输男儿。<li>无奈相依相伴十一载，却终敌不过生老病死，一代英才周公瑾，年仅三十六而亡，自此独留红颜在人间。<li>只奈何小乔一代红颜，独留人间，终自黯然消色。正所谓红颜薄命，天妒英才也。"]],
            "dnyhzr狄娜ol":["female","zhi",3,["nyhzr火球术ol","nyhzr火之箭矢ol"],["ext:扩展ol/Newdnyhzr狄娜.jpg","des:对狄娜来说，幼年的记忆从来都是灰暗无光的。<li>蜷缩在房间的一角，紧紧捂着耳朵，但也不能遮蔽传入耳中的尖叫与咒骂。“嘭”的轻微声音后，狄娜在指尖燃起了一朵小小的火花，明亮而温暖。明明这么漂亮的东西，妈妈为什么不喜欢呢？ 狄娜苦笑了一下，还记得妈妈第一次见到的时候，似乎吓坏了，不然怎么连手上端的汤锅都跌落在地上？之后妈妈还歇斯底里的打翻了好多东西，尖叫着说狄娜是怪物，不应该存在于世，又突然哭着抱住狄娜要求她千万别告诉任何人。<li>如果不是遇到法利亚斯老师，如果不是老师解释了这种与生俱来能力的独特之处，甚至带狄娜前往首都的法师高塔学院学习的话，可能就不会有今天被称为“炽焰火女”的存在了吧？<li>集结的钟声打断了狄娜的思绪。又要出战了吗？看来没空思考人生的意义了呢。<li>指尖的火花熊熊燃烧了起来，那就让他们欣赏这辈子第一次也是最后一次的漫天火雨的盛况吧！"]],
            "snyhzr司马懿ol":["male","zhi",3,["nyhzr液态火ol","nyhzr元素转化ol"],["ext:扩展ol/Newsnyhzr司马懿.jpg","des:他生于乱世，被称为有“狼顾”之相。<li>他善于奇策，多次征伐有功，曾两次率大军成功对抗诸葛亮北伐。 他还曾率领大军征伐辽东公孙渊，采用声东击西之计，出其不意包围辽东主城襄平，一举击破并斩杀辽东公孙渊，平定辽东之乱。数十年来辽东问题终于彻底解决。<li>他能文能武，无论战阵谋略还是领兵打战，都胜人一筹。<li>去世后，依然深得好评，应了那句“少有奇节，聪明多大略，博学治闻，伏膺儒教”。"]],
            "jnyhzr金乌ol":["male","min",3,["nyhzr炎阳胄ol","nyhzr业火ol"],["ext:扩展ol/Newjnyhzr金乌.jpg","des:洪荒八年，天命自称弟臣，向他的哥哥，有穷氏的帝王后羿请命。<li>是年，十日并出，流民失所。一夜夜不停的击缶声，自后羿的宫里传出。缶声不停，天命就不眠。<li>七月，流火更炽。射日。<li>疆域。三千里繁华，三千里洪荒。后羿张弓，冰矢裂日，九只金乌堕为烈火。大地的伤口愈合，而天命却突然感到身后剧烈的灼痛。<li>金乌胁持了天命，逼迫后羿弃弓掷箭。天命依稀记得那时他喊，弟臣之命为轻，君请为社稷处。然而回应他的则是，帝王收弓……<li>烈火熏瞎后羿双目的时候，天命流泪了。他的绝痛之泪滴在烈焰上升起水雾，金乌哀嚎，凶日的火焰被天命牺牲自身精血所覆灭。<li>日灭了，天地各处黑暗。唯有天命的精魂还在发光。后羿不得已，只好用其精魂铸日，封其为世上最后的金乌。<li>千万年过去，天命金乌只是寂寞地在天空飞翔，日昼下，那如伤害般烙印在大地的阴影，有的只是那个叫后羿的帝王折箭，收弓的影像。"]],
            "anyhzr阿努比斯ol":["male","zhi",3,["nyhzr善恶天秤ol"],["ext:扩展ol/Newanyhzr阿努比斯.jpg","des:死去之人的灵魂沉默地排着队，他们正要前往亡者之殿。 <li>巨大的金质天平置于神殿正中，阿努比斯用它来决定灵魂们的去向。<li>审判之秤的一边放置着正义女神玛特的羽毛，另一头则放置着亡者的心脏。如果心脏与羽毛重量相当，那么这个高尚的灵魂便能进入天堂，与众神永生。如果象征正义的羽毛那端承受不了心脏的罪恶而高高翘起，地狱则是恶毒灵魂的最终归宿。卑劣的灵魂将遭到恶魔吞噬，永无转生。<li>阿努比斯见过数之不尽的灵魂，有洁白无垢的善者，也有漆黑如墨的恶人；有充满好奇的少年，也有饱经沧桑的老人；有地位显赫的贵族，也有一贫如洗的乞丐……只是无论哪种灵魂，在他这里都将接受裁决之刻的来临。<li>这里是绝对公平之所。<li>这片寂静的世界便是阿努比斯的国度。"]],
            "xnyhzr玄武ol":["male","li",4,["nyhzr冰裂龟甲ol"],["ext:扩展ol/Newxnyhzr玄武.jpg","des:仁慈的圣兽玄武是北方诸民的守护神。在人民遭受南方蛮族与圣兽白虎的攻击时，玄武曾多次挺身而出，力保北地家园不受侵凌。<li>玄武的大义并没有换来北方诸民的满足。他们开始对玄武产生不满，因为玄武从不杀死南蛮人为他们报仇。这种不满逐渐扩大，最终变成了仇恨。<li>为了报复玄武，这些愚民在进献给他的供品中放入了极寒冰珠——那是白虎赠予北地愚民的魔物。<li>玄武并没有产生疑心。它吃下了冰珠，立刻身中剧毒。为了不让冰珠渗出的寒气伤及自己守护的人民，它毫不犹豫地飞上天空，最终摔成无数碎冰。<li>玄武死后，北方诸民被白虎所统治，终年沉溺于杀戮之中。玄武遗骸中唯一完整的龟甲·冰霜河图，也在战乱中遗落。"]],
            "gnyhzr甘道夫ol":["male","zhi",3,["nyhzr时光缓行ol","nyhzr魔能法球ol"],["ext:扩展ol/Newgnyhzr甘道夫.jpg","des:第三纪元中期，那是个魔法与剑，正义与邪恶交战的年代。被镌刻在石碑上的是一个从黑暗中拯救了帝国的传奇。<li>在吟游诗人的歌谣里，那位传说中的巫师身着灰袍，他帮助矮人们与贪婪的巨龙进行战斗，并夺回了矮人们的家园故土。然而他并非古板的战斗狂人，他也热衷于利用魔法为异族朋友们举办的夏日盛典燃放起灿烂烟花。<li>最为人们津津乐道地便是他一手挑选并组织了那支勇者之队——他们经过漫长的跋涉后，除去了黑暗之王的力量来源。也是在那一次，他得到了众生万物之父的认可，披上了代表巫师之首的白袍。<li>如今，他游历诸国之间，行踪飘忽。但人们相信，只要危险来袭，他会再一次回到人们中间，将正义进行到底！"]],
            "snyhzr树精长老ol":["male","zhi",3,["nyhzr乌龙茶灵ol","nyhzr树灵爆发ol"],["ext:扩展ol/Newsnyhzr树精长老.jpg","des:平安时代，倭国国体动荡、人心不安，魔影纵横、怨灵交错，妖魔鬼怪不再藏身深山，而是屏气敛息，与人类同居于京城。<li>为了消除天、地、人、鬼间的矛盾，阴阳师们登上了历史的舞台。<li>道摩法师正是当时最富名望的阴阳师，他热衷茶道，更有恻隐之心，经常助百姓斩妖除魔。<li>某日，道摩法师救下一个东方茶商，获得茶商馈赠的乌龙朱砂壶。令人意想不到的是，乌龙朱砂壶竟然住着一个具有强大灵力的乌龙茶精。<li>得到乌龙茶精奉献的千年自然精华，道摩法师的道行一日千里。他能借助乌龙茶精的灵力从壶口喷出强大的术流击伤妖魔，还能化身为一棵神木治愈自己和朋友。<li>这个宝贝很快引起了“阴阳寮”的觊觎。他们谋划半年，终于集结五百名最精锐的阴阳师对道摩法师发起袭击。愤怒的道摩法师化身为乌龙神木，将“阴阳寮”成员屠戮殆尽。<li>杀戮过重的道摩法师在这一役后道心尽丧，看破世情，带着乌龙朱砂壶隐居海外，从此绝迹。"]],
            "tnyhzr泰坦ol":["male","li",4,["nyhzr大地护盾ol"],["ext:扩展ol/Newtnyhzr泰坦.jpg","des:记忆的深处覆盖着一层阴翳，挥之不去。出生之时，预言者吐露了不祥的未来——他与他的兄弟们，将成为弑父之人，恶名加身，以最悲惨的姿态成为众人之敌。<li>这条诅咒如影随形，在他的生命中贯穿始终。父亲毫不掩饰对他们的憎恶，甚至想将他们除之而后快，母亲则以大地之名藏匿了他们。东躲西藏，卑微存活，成为幼 年时的全部记忆。<li>——泰坦挥动手中重锤，似乎想将回忆驱逐出去。他的父亲，强大的天神乌拉诺斯高高在上，睥睨而立。不过，这并非什么值得庆贺的相逢。与其背负着诅咒苟且， 承担着无谓的罪名，不如用自己的手切断这种令人唾弃的关系！<li>血与烽烟成为此刻的全部色彩，力量的悬殊却未能磨灭他的斗志。他与身下的大地一般残破，然而只要还能再次战斗，他依旧不屈不饶！泰坦一次又一次站起，脊柱 始终挺得笔直。除非切下他的头颅，否则他便永远不会被打倒！"]],
            "snyhzr水元素ol":["male","zhi",4,["nyhzr多变之水ol"],["ext:扩展ol/Newsnyhzr水元素.jpg","des:它不知自己是何时诞生，风水火土四元素曾在一团混沌里相融又碰撞了无数年，直到天地初分，水元素随着狂风暴雨坠入深海，就这样在一片黑暗中沉眠。<li>当千万年后，火元素被人类祭司召唤而去，水元素也随之苏醒。水汽的视线无处不在，它望着暴烈的火焰就这样被解放桎梏，大地即将在火海中毁灭；它望着无计可施的祭司们只能再次开启召唤阵，呼唤自己的到来。<li>“帮助我们阻拦火元素吧！否则，人类即将灭亡！” 冰冷的水起初无动于衷。“地上的火焰与我无关。”它继续望着人类，望着他们伏地哀哭，从前只能在海中独自想象的权力的甜美这回真切地愉悦了它。<li>也许，这是一个契机，我可以得到这片大陆。水元素模糊地想，但我当然要做得比那堆毫无脑子的火更聪明……“我可以帮忙。”水元素高傲地发出了声音，“只要让我看到你们的诚意。<li>” 人类争先恐后地向水元素表示忠诚：“帮助我们吧！我愿奉你为主！” 于是海水翻涌，瞬间卷上陆地，将肆虐的烈焰熄灭。<li>水元素的野心终于得以释放，它要瞒骗人类，取代火元素，成为陆地的主宰！<li>狂啸的巨浪就此冲天而起，要在人类的欢呼之下，将那些地上之火全数吞没……"]],
            "snyhzr死神ol":["male","min",3,["nyhzr生命凋零ol","nyhzr无尽恐惧ol"],["ext:扩展ol/Newsnyhzr死神.jpg","des:他矗立在大地上，举目所及皆为焦土。<li>这儿原本是数座繁华的邦城，人声鼎沸。<li>邦城内建造着华美恢宏的神庙。人们奉上丰盛的祭品，摆出虔诚的样子，手按圣卷，诵读誓言，希望得到神明的眷顾，好满足他们贪婪和渴求。<li>虚伪——这是暗黑死神对这事的评价——人类遮遮掩掩的故作姿态，小心翼翼的掩饰他们的欲望，仿佛这样就能把他们所追求的一切正当化。<li>人类真是太有趣了！他看着人类的厮杀想到。只需要小小的挑拨，便可让他们自相残杀，背弃之前许下的承诺。没有什么比让神明头痛更令人愉快了，暗黑死神舔舐着沾染在镰刀上的灵魂，心满意足地笑了起来……"]],
            "xnyhzr项羽ol":["male","min",4,["nyhzr鬼雄ol"],["ext:扩展ol/Newxnyhzr项羽.jpg","des:楚霸王项羽天生神力，使上古神兵“霸王天罡剑”，有万夫莫敌之勇。项羽舞剑杀敌之时，其妻虞姬便在阵后抚琴助威，琴音剑势交融，其势神鬼难敌。项羽巨剑所指，秦阵三军胆寒，不战自溃。<li>灭秦之后，楚汉相争。项羽兵败，被汉军围困垓下，兵少粮尽，四面楚歌，大势已去。虞姬毅然自刎，以断项羽后顾私情。项羽一声悲吼，戾火攻心，筋脉尽绝。然三魂七魄不肯散去，乃化作鬼雄，抱着虞姬尸身，单臂握剑，往汉军大营杀去。<li>不多时，已冲杀至汉王帐下，霸王天罡剑直指刘邦。汉王谋士张良惊骇欲绝，急中生智，拉刘邦跪下曰：“虞姬已死，霸王亦化鬼雄，在此无益，何不去往阴曹地府？”<li>汉王领三军齐拜曰：“恭送霸王！”鬼雄项羽魂躯一震，与虞姬尸身一道化作白烟，随风而散。"]],
            "bnyhzr八歧大蛇ol":["male","li",4,["nyhzr天从云ol"],["ext:扩展ol/Newbnyhzr八歧大蛇.jpg","des:八岐大蛇由世界的“绝对意志”幻化而成。它秉承万物意志，肩负让世界回归“无”的使命，也就是让世界回复到万年前一切新生、没有人类、没有污染和破坏的最自然的状态。<li>大蛇的意愿和人类的生存欲念毫无悬念地碰撞在一起。<li>出云神国“三神器”的持有者草、尺、乐率领三千阴阳师，于万川河上同大蛇展开激战。大蛇手执“天丛云剑”，以神技“八歧幻身斩”将阴阳师尽数杀死，三神器的持有者也身中剧毒，奄奄一息。<li>眼见大蛇胜利在望，草、尺、乐忽然联手，自爆三神器，撕裂空间造出黑洞，以牺牲整个世界为筹码，逼大蛇就范。<li>看着黑洞一点点吞噬世界，以净化和守护世界为目标的大蛇目眦欲裂。他毫不犹豫地跳入黑洞之中，燃烧自己的一切，将黑洞推离这个世界。<li>灾难过去，天日重现。天丛云剑从空中悠悠落下，掉进万川河的万顷波涛之中。"]],
            "knyhzr狂徒ol":["male","li",4,["nyhzr腐肉吸噬ol"],["ext:扩展ol/Newknyhzr狂徒.jpg","des:在杀手这个行当，有个说法，如果你杀人过千，你的罪业就会在现世降临，报应不爽。大多数杀手都在第999单生意后金盆洗手。不过，并不是所有人都信这个邪。 <li>第一楼的杀手狂徒，就是这个不信邪的，他只相信他的屠刀“罪”和钩索“业”。<li>那一年的除夕夜，狂徒很兴奋。他的“业”钩从黑暗中窜出，如毒蛇般缠住兵马大元帅岳鹏，将他拉扯过来，沾满鲜血的“罪”刀干脆利落斩下头颅。“千人斩了！”狂屠浑身颤抖，“我是最强的……” <li>狂徒喝了很多酒。回到第一楼时，他突然感觉到浓郁如浆的杀气。不知何时，他已被无数黑衣人包围。喝下的酒在腐蚀内脏，狂屠的皮肉开始掉落。<li>他抽出“罪”刀和“业”钩，疯狂地厮杀着…… “第一楼杀手一夜间死绝，皆被刀斩钩戮，惨状骇人。千人斩狂徒化作肉泥，罪刀业钩不知去向。<li>”百晓生如是记载。"]],
            "ynyhzr杨戬ol":["male","min",3,["nyhzr三尖两刃戟ol","nyhzr通天法眼ol"],["ext:扩展ol/Newynyhzr杨戬.jpg","des:不知道神仙为什么喜欢用山压人。那么多山，像座座墓碑，下面压着一个个曾经自由的灵魂。也许诸神以为山是永不崩塌的，但杨戬知道没有永远。沧海桑田，不过一瞬。<li>作为二郎神君、执法天君，杨戬一直戴着冷面具。他手执两刃三尖戟，身负九转玄功和七十三变，化身万千，所向无敌，为天庭和凡人扫荡邪魔妖道。<li>只是，额上的天眼，已经快五百年没睁开过了，或许是不愿看到妹妹杨婵、死党猴子被压在山下的样子，就像当年母亲被压一样。<li>杨戬反抗过，可惜败了。他被毁去肉身，只剩元神，还得继续听从天庭差遣。哮天犬是杨戬仅剩的伙伴了，这家伙总是仰头对着老天咆哮，也就是对着杨戬的舅舅咆哮。<li>灌江口小庙中，杨戬在等，等着猴子出来，一起把天捅个窟窿。"]],
            "mnyhzr米迦勒ol":["male","li",4,["nyhzr神圣审判ol","nyhzr圣光护盾ol"],["ext:扩展ol/Newmnyhzr米迦勒.jpg","des:在凡人无法触及的高天之上，是属于神的领域，圣洁的天使在此巡弋，维护着尘世的公平与秩序。<li>同为诞生最早的天使，米迦勒和路西法拥有着其他天使无法比拟的勇气和力量，一个是光之君主，一个是拂晓之星，亲如兄弟的他们一同成为了神的左右手。<li>然而此刻，天界却被邪恶的阴影所笼罩，路西法背弃了天父，投入了魔鬼的怀抱，三分之一的天使随之堕落。只要两位最强大的天使联手，神也不是高不可攀……<li>但是，米迦勒拒绝了和路西法一同堕落。性情高傲的他无法原谅背弃了神和自己的路西法。<li>他吹响了天国的号角，战火燃遍广漠无垠的天宇。罪恶必须被无情地否定和毁灭，即使天使犯了罪，也应一视同仁。<li>如同所有歌谣中一样，正义最终战胜了邪恶，堕落者永远无法得到原谅，天上再也没有他们的位置。在神的授意下，米迦勒亲手将路西法投入无底的深渊。<li>光明与黑暗就此决裂，米迦勒成为了最耀眼最强大的天使长。与路西法及其手下的邪灵争战成为米迦勒背负的十字架——只要邪恶还在肆虐，米迦勒的战斗就不会停歇。"]],
            "dnyhzr电光侠ol":["male","min",3,["nyhzr移形换影ol","nyhzr电光火石ol"],["ext:扩展ol/Newdnyhzr电光侠.jpg","des:23世纪，新纪元带给人们的并非光明。浓稠的黑暗成为世界的主色调。罪恶大行其道，正义瑟瑟发抖。人们祈求有一位英雄挺身而出，与邪恶力量殊死搏斗。<li>救世主就在这种时候出现。他不理会民众的示好，从不驻足停留。也许是神秘感始然，关于新英雄的消息潮水般涌来——街头小报借此狠狠发了笔横财。<li>邪恶力量对从天而降的劲敌束手无策，他们想尽方法试图找到他的弱点，不放过任何一丝细节。<li>渐渐的，英雄开始处于下风。一则流言甚嚣尘上——新英雄是使用药物产生变异的普通人。一旦能力失控，他很有可能成为比邪恶力量更可怕的人类公敌！<li>对英雄的欢呼转瞬变成冷言冷语的利刃。竟连“他是邪恶力量的幕后指使者”的意见也得到了不少认可。<li>邪恶力量再度席卷而来时，英雄并未出现。惶恐不安的人们又拾起敬畏之心，重新呼唤被他们称为“电光侠”的恩人。这次，他们的期望落空了……<li>不过，英雄的出现唤醒了一些人沉睡的正义！对抗邪恶的前线上出现了一群无畏的年轻人。他们视那位英雄为指引前行的明灯，以“电光侠”为名，誓将黑暗斩除，迎接黎明的未来！"]],
            "lnyhzr兰ol":["female","li",3,["nyhzr高速格林炮ol","nyhzr穿刺射击ol"],["ext:扩展ol/Newlnyhzr兰.jpg","des:血腥味与硝烟味弥漫在空气中，幸存的士兵静默地收拾残局，天空飘落的细雪渐渐掩盖了焦土，好像刚才的激战从未存在。<li>兰依旧手握火神重炮，警惕地环视四周，直至收队的命令响起。不能放松，她对自己说，放松就意味着……生命的消逝。<li>作为队里的特殊战力，兰被称为“火神战姬”。她得到的瞩目与关注是许多战士所梦寐以求。<li>然而，这些不过是毫无用处的东西。如果可以的话，她愿意用现在的一切去交换曾经被她所轻视的生活。<li>自从局部战争开始以来，每天平淡的校园生活变成奢侈。叽叽喳喳的女生凑在一起笑闹的场景，也成为记忆中褪色的画面。每每从噩梦中惊醒，她都想到挚友们最后的样子。那过早凋零的生命时刻提醒着，她为自己的自大付出了怎样的代价。<li>现在，她用枪弹宣泄着心中的怒火和对敌人的恨意。只要生命不止，她将继续战斗下去，为了让其他人安享生活，不再承受这样的痛苦！"]],
            "dnyhzr大乔ol":["female","zhi",3,["nyhzr乱世听凤ol","nyhzr凤羽踏歌ol"],["ext:扩展ol/Newdnyhzr大乔.jpg","des:东汉建安四年，皖城告破，易主孙吴。春卷庐江郡皖，落英缤纷难掩满城战乱后的萧索。<li>两位将领模样的男子带着一队兵卒至东郊一处寓所，随行抬着八九个满载金银的大箱。箱落地，人入座，领头男子向家主拱手遥作一揖，语含笑意，“闻乔公二女皆为国色，今孙策前来提亲，乔公意下如何？”<li>后院深闺，大乔一边轻抚凤凰琴弦，一边听下人禀报前堂事态。生性娇俏的小乔早已按耐不住，抱着大乔的手臂轻晃，“阿姐，阿姐，难道你我要同侍一夫吗……”<li>“孙策颜姿俊美，却被称江东小霸王，怕是不识雅韵……”<li>“阿姐，这周将军的笛配我们的琴会不会很有意思……”大乔轻拍小乔的手，淡淡道，“你等下随我入堂，不要言语，一切交给阿姐便是。” <li>堂上，孙策直抒来意，乔公知无退路，却又踌躇难断。数十载，乔家为避战祸四处奔波，就是不愿二女卷入其中，奈何姊妹渐露倾城之色，名号传扬开去，终是逃不出离乱命数。看乔公迟迟不应，孙策有些不耐烦，周瑜见状开口，“乔公二女流离，若得吴侯做婿，不足为欢？”“欢不欢都被一语道破，周将军倒是比吴侯更懂我姐妹二人——”有人淡淡地道，声音若玉石，坠入冰潭中，连激起的水花，也是冷的。<li>孙策，周瑜纷纷回头看向厅门，围满前堂的士卒不知不觉散开，两女子一前一后，缓缓向这边走来。语者行于前，微扬着头，云髻高挽，点一枚凤羽盘于发间。她的身材高挑，眼角成匀称的丹凤，走动之际，金色凤羽眉心坠就有韵律地摇晃起来，衣裙飘逸，袖口迤逦自地面，裙尾长长地拖在身后。淡如水却又高贵成凤，像一只浴水凤凰，从天宫一步一步走进人间来，君临天下般俯视着周瑜，“那周将军，你怎么不提亲呢？莫不是因为阶下囚的身份而看不起大乔小乔？”周瑜觉察方才所言有失礼数，准备说些什么，大乔却并不理会，随即转向孙策，轻作揖，“吴侯莫怪，家父为难也是有所顾虑，”大乔把小乔拉到身边，“大小乔素来姐妹情深，但同侍一夫难免心生嫌隙，这是家父也是我二人都不愿看到的。”大乔看孙策若有所思，继续说道，“闻吴侯善待有才之士，与周将军更是情同手足，倒不如你二人双双提亲，两位才俊配两位佳人，兼顾姐妹之情与手足之义，岂不大全？”<li>“哈哈哈，好一个大全。公瑾啊，你今天撞上好运了。那——”孙策饶有兴致地看向大乔，“是你嫁予我呢，还是你妹妹嫁予我？”大乔不禁莞尔，笑入孙策躁动的内心，“吴侯逗乐了，我何时说过自己是阿姐了。小乔以为，这长幼有序，是自古的礼数，吴侯长于周将军，自当吴侯配阿姐，而我与周郎成双了。”<li>说罢，大乔将小乔往孙策身边拢了拢。孙策这下着急了，竟直呼不妥。小乔偷笑着投来目光，大乔只一眼对望，却让小乔感到心安，姐姐会一直保护她。<li>待亲事落定，孙策应了大乔善待乔家全府的请求，这大乔才重新介绍姐妹二人。孙策倒也不气不恼，笑看大乔，觉得这夫人着实看不透。很久以后孙策问大乔，当时若应下了长幼有序的配法，她将如何处之。“这说明夫君是个恪守礼数的人，则大事上言出必行。若辨明真身，我为大，夫君也依然要娶我。只是那时的你，选择了从心而行。”<li>说罢大乔回眸一笑，金色凤羽眉心坠熠熠生辉，宛若坠入人间的凤凰，晃得人眼迷离，晃得孙策好想问她，你的真心又是什么，是不是只为了帮小乔。却迟迟不敢开口。"]],
            "ynyhzr雅典娜ol":["female","zhi",3,["nyhzr战争惧刃ol","nyhzr圣光法球ol"],["ext:扩展ol/Newynyhzr雅典娜.jpg","des:愤怒的时代结束了，在黎明尽头，诸神以犹疑的目光注视着天地中心的那扇混沌之门，那是异世界的入口，是战争的源头，是混合了信仰、破灭、黑暗、光明、绝望以及希望的所在。女神在那里放下希望信标，天空之风轻轻将历史翻过新的一页。<li>千年之后，上古时代的种种已化为发黄书页中记载的传说。人类在世界各地建立新的国家，繁衍生息。然而，随着时间的推移，原来平和温顺的人类似乎被拖入欲望的迷沼，贪婪、胆怯、卑劣、背诺……信仰缺失的人类犹如置身重重迷雾之中……<li>种种游离的、隐秘不定的迹象，将混沌之门这个早已埋没在历史尘埃中的地点重新提及。一些试图重新找寻本源的人站了出来。据说，他们得到了一位神祗的相助——那名神秘的女神有着传说一般的身世与容貌。人们被阻隔在这层传说之雾外，唯一可知的就是她有一个温柔的名字：雅典娜。"]],
            "xnyhzr西莫ol":["male","zhi",4,["nyhzr欲望灾火ol"],["ext:扩展ol/Newxnyhzr西莫.jpg","des:也许是饥荒年代的一次捕食，食人魔这个名字便顽固地流传开来。那异乎寻常的外貌被添油加醋成为了食人的证明。为了清除可能的隐患因素，人类对食人魔族展开了大规模围剿，哪怕他们早已不将人类作为食物。<li>压倒性的战局令大批大批的食人魔沦为帝国的奴隶。要么毫无尊严的成为奴隶，要么成为人类狩猎的活靶。“比起战死而言，成为人类的奴隶只要听话至少衣食无忧”，这个想法一度成为食人魔族的共识。<li>生来便拥有两个脑袋的西莫很明显是个异类，无论是哪个方面。也许是两个脑袋的缘故，他对于自由的渴望比其他食人魔更加炽烈，当然，智慧与勇气也有双份。他巧妙地制造一起起收容所暴动，策划了一场又一场的游击战。人类花费了极大的精力来应付他精妙的战术却均以失败告终。食人魔族开始相信西莫将是带领他们走向光明的天选之子，是他们毕生追随的首领，与信仰。<li>然而西莫知道，为了确保族人能重新和平的生活在这片大地上，不再沦为奴隶，不再饱受战火，他将一直战斗下去，直到生命的最后一刻。"]],
            "cnyhzr丛林之子ol":["male","min",3,["nyhzr毁灭蛊箭ol","nyhzr生存本能ol"],["ext:扩展ol/Newcnyhzr丛林之子.jpg","des:智慧之光并非只恩赐了文明，文明之外，人类仍可发现其它不同类别的知识。丛林之子便是其中之一，他们被称为“绿野中的守护”，对于自然的暴戾与温柔都有相当了解，他们并不完全依赖自然，而是与自然相融为一。<li>无法确定是否是炼金术师们首先发现了丛林之子，但在人类的历史遗迹中，我们随处可见他们留下的痕迹：海岛上不知名的巨石阵、金字塔下兽型的人面像，甚至还有决战之谷里难解的图腾柱。丛林之子使用来自自然但又超越自然的能量，他们从地母信仰中祈得祝福，为自由谱写誓言之歌。<li>丛林之子为森林带来了祝福。被其净化的不洁，化为可以滋润万物的雨水。也是从那时起，世界上出现了雨林。据说，常在雨林中行走的人可以听到时而传来的丛林之子的笑声……"]],
			"gnyhzr宫本武藏ol":["female","min",3,["nyhzr幻之分身ol","nyhzr千叶斩ol"],["ext:扩展ol/Newgnyhzr宫本武藏.jpg","des:黑夜深沉，参天宫殿伫立于阴影之中。传说中拥有巨大力量的天照宝珠就被魔王藏在这里。<li>女剑客静静潜伏在悬崖边上，隐藏在狐面下的冰冷双瞳远远向宫殿凝望。<li>几支巡逻队打着火把如往常一般在宫殿外巡视，她低下身子，轻巧地绕过他们潜入宫殿之中。阴森幽暗的建筑中遍布重重机关，稍一不慎就将死无葬身之地。上下摇摆的抡锤、瞬时淹没的流沙、地底渗出的剧毒、诡异的谜题之门……这些都难不倒这个美艳冷酷的女子。双刀在手，一路过关斩将。<li>暗夜中的潜伏者最终来到了她的终点——某个宫殿深处的密室，悄无声息地划开的机关门后，一片黑暗中的石台上，天照宝珠正在绽放光华。<li>目标就在眼前，她不由加快脚步，但突然觉察到什么又立即停下，双手交错反握刀柄，伏身露出戒备的神情。“真可惜，再往前一步，你就死了。”魔王鼓着掌，从黑暗中露出身形，嘴角扯出一道狰狞的笑。“重重关卡都被你闯过，真是精彩。宫本武藏，你果然不愧传说中的盛名……但你注定拿不到它，因为我会在你拿到之前毁掉它。”<li>“可惜我的目标不是它。”武藏冷冷一笑：“是你！”<li>刀光闪过，天照宝珠仍静静地光华四射，魔王还留存着讶异表情的人头已落地。<li>双刀入鞘，身形一晃，天照宝珠落入腰囊，而武藏，已重新隐入黑暗之中……"]],
			"lnyhzr鲁瓦ol":["male","li",4,["nyhzr地狱之躯ol"],["ext:扩展ol/Newlnyhzr鲁瓦.jpg","des:在源生汤的沸池中，年轻的地狱火鲁瓦被遗忘者弗萨肯唤醒。弗萨肯将被遗忘者的邪力植入鲁瓦体内，使鲁瓦获得了强大的力量。但在最终改造完成前，他们被卷入了部落与联盟的战争。<li>杀戮是战争终结前人们唯一谈论的话题，在日复一日的厮杀中，地狱火鲁瓦小心地保护着他的主人。但鲁瓦的忠诚换来的常是弗萨肯的冷嘲热讽，因为年轻的鲁瓦不受教条的束缚，这对于习惯了经典的被遗忘者来说简直是无法忍受的。<li>战争的胶着持续了许久，久到他们已经习惯开始遗忘和平是什么样子的时候，一支林中响箭改变一切。利箭刺穿了弗萨肯的喉管，鲜血使狂放不羁的鲁瓦第一次尝到了失败与绝望的苦感。<li>他暴走了！地狱之火融化了思加嘉的身体，然而被遗忘者的邪力去穿透烈火包裹住鲁瓦，仿佛多年来一面讥讽一面守护。巨大的邪力使得鲁瓦的火焰变成了绿色。"]],
			"anyhzr阿瑞斯ol":["male","li",4,["nyhzr神圣对决ol"],["ext:扩展ol/Newanyhzr阿瑞斯.jpg","des:最骁勇悍战的战神阿瑞斯曾伴随鲜花从神后赫拉腹中诞生，他生来便象征着力量与权力，战斗就是他最大的爱好。<li>冥王哈迪斯经常邀请他一同前往人类的战场狩猎，热爱战斗的阿瑞斯欣然应允，于是冥王和战神一同驰骋于战场之上，神灵降临之处只有死亡与恐惧。雅典娜拦住阿瑞斯，向他吐露冥王的阴谋。哈迪斯需要扩充冥国的疆土，而阿瑞斯的战神之力就是他最好的助手，他将冥王看做好友，却不知道哈迪斯的内心只把他作为实现野心的工具与桥梁。阿瑞斯不相信雅典娜，于是女神大声斥责，命他看看人间的惨状。<li>仿佛梦幻泡影一朝破灭，雷电声声，冥王哈迪斯披着黑袍降临战场。而他猝不及防地面临的，正是狂怒的战神阿瑞斯全力一击！"]],
			"xnyhzr席璐达ol":["female","min",3,["nyhzr爆头ol","nyhzr黑桃暗杀ol"],["ext:扩展ol/Newxnyhzr席璐达.jpg","des:黑桃皇后席璐达是疯狂博士最杰出的作品，柔滑似水的肌肤，精密机械构成的五脏六腑，令人胆怯的火炮力量，微型能量心脏——如此完美！不可思议的是，她还能产生自己的人格！<li>经过严酷训练，席璐达加入了“扑克特工组织”。执行任务时，她总是喜欢放一个霹雳焰火，让对手瞬间失明，看着他们像无头苍蝇般乱窜，再用火炮“福音风暴”轰碎他们。<li>然而，席璐达逐渐成型的性格却让她走向了组织的对立面。她无视组织的命令，肆意玩弄着对手，以至于损害到王国的利益。国王命令博士启动自毁程序，销毁这个失败品。<li>自毁程序启动了，席璐达的心脏开始碎裂。她用最后一丝力气引爆了埋在塔尔王宫和特工组织地下的炸弹。在轰鸣的倒塌声中，飞起无数绘着小丑脸的气球。"]],
			"znyhzr钟馗ol":["male","li",4,["nyhzr代天罚恶ol"],["ext:扩展ol/Newznyhzr钟馗.jpg","des:玄宗年间，鬼门关崩毁，致使鬼物横行阳间，荼毒百姓。<li>书生钟馗因机缘习得仙人法术，能画符捉鬼。钟馗嫉恶如仇，奈何人单力薄，救不了天下人，乃立志考取功名，借朝廷兵马驱除鬼物。<li>众鬼知钟馗赴京赶考，便设伏暗算。在四大鬼王围攻下，钟馗虽然逃出，却也被抓破颜面，变得狰狞丑陋。<li>金銮殿上，玄宗皇帝见钟馗貌丑，甚为不喜，一言斩断他的仕途。可怜钟馗仰天狂笑，以头碰柱，死于殿前。<li>钟馗魂归地府，凭高深道法得阎罗重用，赐地府至宝“朱砂判官笔”，扫荡群邪，判生死，断阴阳，历经三年，人鬼两界终得安宁。然而，钟馗却因功高震主，遭阎罗猜忌暗算，二魂七魄被打入九幽，不得超生。唯第三魂藏于朱砂判官笔中，逃出生天，流落在阴阳两界的夹缝之中。"]],
			"anyhzr阿波罗ol":["male","li",4,["nyhzr太阳之子ol"],["ext:扩展ol/Newanyhzr阿波罗.jpg","des:他是太阳的象征，他是光明的化身。他的战车是黄金打造而成，由四匹全身发出金光的骏马牵引。他的马车从天上飞驰而过时，带给人间以哺育新生的温暖。<li>他的宫殿在遥远的东方，大理石的廊柱装饰着黄金、宝石和象牙制成的浮雕。火神为宫殿的大门和四壁制作了精美绝伦的图画和雕像。时光之神和春夏秋冬四位季节之神环绕在他的周围，共同为人间带去丰收与希望。<li>这位宙斯之子永远精力充沛、不知疲倦、勇猛无双。歌者们弹着齐特拉琴颂扬他的丰功伟绩。传世的诸多英雄故事之中，斩杀巨蟒皮同无疑是流传最广，影响最为深远的。<li>为了寻找最适合的地点建立神示所，阿波罗几经挑选后抵达德尔斐。皮同——盘踞于此的妖蛇——自然不肯乖乖地让出栖息之处。无畏的阿波罗以超凡的实力宣告了自己对这块圣地的所有权。而阿波罗也在这里建立了举世闻名的德尔斐神示所。神庙门柱上镌刻的“认识你自己”历经数百朝代，直至今日也依然指引着人们前进的方向。"]],
			"hnyhzr花木兰ol":["female","li",3,["nyhzr所向披靡ol","nyhzr怒战八方ol"],["ext:扩展ol/Newhnyhzr花木兰.jpg","des:北方的游牧民族侵入边境，前线节节败退，军情紧急。朝廷号令男子尽数充军，花木兰不忍看着年迈的父亲再上战场，便女扮男装，投身军旅。<li>天下男儿无肝胆，何妨？看我红装变武装！<li>在军中，花木兰凭借自己的坚韧和勇气，通过了重重困难考验，成为了一员独当一面的战将。经过十年血战，花木兰和将士们终于将异族侵略者赶出了国土。战争结束后，木兰拒绝了皇帝的封赏，脱下铠甲，收起长枪，回到了暌违多年的故乡，过起了织绣缝裳的生活。<li>日子这样一天天过去，但木兰的心却始终无法彻底平静。因为她知道，战场上那般的烽火与豪情，一旦经历过，就无法忍受这平淡生活余烬一般的黯淡。看着逐渐蒙尘的长枪和铠甲，木兰紧紧握住了拳头……<li>当心中的火焰越烧越烈之时，她做了一个梦，梦到了一座巨大的祭坛在向她发出召唤，而在她眼前，仿佛再度出现了铁马金戈、战阵交锋的画面。<li>是时候了！她毅然拿起自己的长枪和盾牌，怀着满腔的慷慨与勇锐，向着未知的世界进发。<li>“万里赴戎机，关山度若飞。朔气传金柝，寒光照铁衣！”飒爽巾帼，豪气干云。木兰的传说仍在继续……"]],
			"xnyhzr西门飞雪ol":["male","min",4,["nyhzr追魂剑ol"],["ext:扩展ol/Newxnyhzr西门飞雪.jpg","des:二月初二，雪。<li>他早早的起床，取净水洁面，叠放整齐的白衣柔软合身。<li>剑已擦拭雪亮，他轻柔地抚摸剑身，犹如抚摸最心爱的女子。<li>桌上的簿子记着：“青州宋义威，擅八卦刀法，所使金环大背刀，刀背镶九金环，重二十三斤。于十一月劫杀定州宁氏，宁府上下四十八口无一幸免。<li>” 二月初四，雪。<li>他已经在雪中站立许久，久到眼睫毛已经沾满雪花。<li>宋义威喘着粗气，问道：“你我素不相识，只因我劫杀宁氏，你要为其报仇。但你并不认识宁氏？” “是的。”他面色宁静的答道，就像取人性命如同简单寒暄一般轻松。<li>“你千里而来杀我，究竟为何？”<li>“应该为之而已。”<li>话音落，风吹雪，宋义威面上还带着惊恐之情，他似乎还有什么话想说，但再也说不来。因为死人，是不会说话的。<li>西门飞雪吹落了剑上的血花。每当了结一件大事时，他就想喝酒。滚烫的，能让人从骨头里烧起来的，驱除寂寞的酒。<li>“世上还有什么事能使心再热起来？血再热起来？”看着手中的剑，西门陷入沉思……"]],
			"snyhzr孙悟空ol":["male","min",4,["nyhzr七十二变ol","nyhzr火眼金睛ol"],["ext:扩展ol/Newsnyhzr孙悟空.jpg","des:梦的尽头是一片水帘，波光粼粼地覆盖着黑暗中的一切。他伸出手想去触碰，但视线所聚合的光影以一种可怕的速度倾塌着，光明被急速地抽离，然后便是毁灭一切的风。他隐约听到一个声音：齐天大圣。<li>没错，那正是他的名字。男人笑了，他的笑有一种嘲弄的神色在里面，彷佛是想起了什么，他随手翻开旁边的书册，第五章：乱蟠桃大圣偷丹，反天宫诸神捉怪。这是一位文人所编撰的故事，在他看来却极其可笑。世人不了解那一战，他们称那是混乱的欢乐，但只有孙悟空明白那一战是雷霆的宣威，是对世人愚昧的挑战。乌云遮蔽了中土几千万年，霹雳一声乌云散了，而人们却称雷霆的制造者为疯子！<li>人是神的子民，但子民不应害怕他们的神，孙悟空微笑着，神应该害怕他们的子民。愚昧所建立的暴政绝非长治久安，子民有选择有尊严地生存下去的权利，而这，正是一切变革的开始！声音不断地自黑暗深处传来，齐天大圣……"]],
			"snyhzr斯巴达ol":["male","li",4,["nyhzr束缚搏击ol","nyhzr战火盾甲ol"],["ext:扩展ol/Newsnyhzr斯巴达.jpg","des:战斗已经陷入胶着，空气中弥漫着死亡的气息。列奥尼达斯咒骂了一句，手中重剑劈倒一名企图从隘口侧面进攻的波斯士兵。他环顾四周，那些忠诚的勇士已经所剩无几。鲜血模糊了视线，他的身体也已经到达极限……<li>这场悬殊的战斗开始于三天前。最初，易守难攻的温泉关让波斯大军吃尽了苦头。然而一个无耻的奸细让希腊联军的努力化为乌有！背后突然出现的敌人令联军丢掉了所有优势。关键时刻，斯巴达人挺身而出！列奥尼达斯带领着三百名最勇敢的战士冲向波斯大军。<li>联军得以安然撤离，而斯巴达人的战斗才刚拉开序幕！<li>——公元前480年，温泉关战役，斯巴达人带着两万条波斯人的性命，在地狱中开怀畅饮。自此，“斯巴达勇士”之名成为后世每一位战士所追求的最高荣耀！"]],
			"dnyhzr黛西亚ol":["female","min",3,["nyhzr弹药填装ol","nyhzr高距炮弹ol"],["ext:扩展ol/Newdnyhzr黛西亚.jpg","des:“黎明的曙光照在贞德焚身之地，美丽的少女已经不在……我们为追逐光明的光明而消弭黑暗的黑暗，求你使所有罪止于天下人间，求你使我们终将领受属天的平安。以上所求是靠你的子，我们的主天主、耶稣基督，他和你及圣神永生永王。阿们。”<li>这又是一次军事修会的行前祷告。<li>在圣女贞德被焚后，魔鬼们因忌惮军事修会势力庞大，继续操纵法兰西王室打压军事修会。不屈的教众们坚信感化不足以救世，几个主要成员行至各地散播武装抵御的种子，隐忍数十、数百年，以大大小小修道院为据点，酬征圣使。他们称听到了主的声音，将圣使奉为驱逐魔物的神职，他们的使命因为善良的意愿得以超越教条，为主所宽恕。<li>即使达蒂瓜尔修道院地处偏僻，也不得不顺从时势，被编入军事修会的行列中。祷告结束后，黛西亚就要着手准备自己第七次圣使任务。<li>回房，掩窗，轻拉纱帘，侧身打开床头摆放的暗纹皮箱，双手捧出金属组件，垫上棉布于桌面一字摆开，逐个擦拭。修道院收养的孤儿在庭院中嬉戏打闹，稚声透过纱帘传来，黛西亚仔细辨认每个声音，脑中同步着窗外的情节，不时莞尔。<li>这一道帘，隔开了两个世界。<li>黛西亚放下组件，拂拭手心的印记，那是她发愿出任圣使的第一个晚上，身体出现了圣痕，军事修会的主教命人,将黛西亚带往修道院地下的军火库。神奇的是，靠近一柄赤黑镶金的榴弹枪的时候，圣痕自愈，主教便把这圣燯配予西亚，口述着来自主的神职。如今圣燯一洗尘封，赤色光泽晃地人眼恍惚，圣痕在黛西亚的身体上却仍保持着铁的颜色，几经不散。<li>“黛西亚姐姐，黛西亚姐姐！”<li>视线重新聚焦，用绸布轻盖住圣燯的组件，黛西亚剥开纱帘，推窗。把头探出的瞬间，只觉得阳光很暖，“怎么啦？”<li>“黛西亚姐姐，昨天真的吃到了棉花糖!”不及窗口高的小男孩杰尔原地雀跃，“还有还有，星期三吃到了草莓蛋糕，星期一是布丁。梅洛、罗格夫他们都说黛西亚姐姐才是天主！”黛西亚伸手揉乱杰尔的发，微笑着说，“是天主让我实现你们的愿望的。”扎着麻花辫的小女孩梅洛闻言跑过来，“那是因为和黛西亚姐姐说想吃的，都能吃得到嘛！”院子里的孩童越聚越多，七嘴八舌地嘟囔甜食名称。黛西亚却一点都不觉得吵，整个人宛若泡在他们闪亮的眸光里接受洗礼，才真正觉得赎了罪。<li>“这次的酬劳么？”<li>“恩。”<li>当晚，黛西亚又一次将写满甜蜜愿望的手书递予主教,便出发了。她收起了往日的平和，眼神凌冽。光明正躲在她身后不谙世事，所以她必须与黑暗久久对峙，来犯者胆敢走近一尺，黛西亚便杀它一丈，容不得放肆。圣燯枪口隐隐喷喘的炎星，与一袭红黑修道服，撕裂了夜的静谧。承主之心，与魔为敌。<li>这是圣使黛西亚所信仰的圣意。"]],
			"dnyhzr妲己ol":["female","zhi",3,["nyhzr九命妖尾ol","nyhzr勾魂大法ol"],["ext:扩展ol/Newdnyhzr妲己.jpg","des:瘟疫。眼眸所注视的除了死亡，还有，饥饿。女娲将一幅充满着诱惑与光辉的画卷朝前展开，小狐女的眼前掠过王国三千里繁华鼎盛的疆土，在鲜花路面的尽头，王在等她。接受命运的安排，她就可以成为世间最强帝王的王妃。<li>十年一晃，十年倾城。当初的狐女业已成为商纣最挚爱的王妃。人们叫她妲己，对她的美貌顶礼膜拜，在王国纵驰的驿道上，随处可见俗人对她的颂扬。<li>但她自己呢？她在帘幕后书空咄咄的那些年，心里一直念叨的难道不是那个叫伯邑考的聪明男子么？但她毕竟还是错过了什么。武王姬发破城的时候，她有一种摇摇欲坠的破败感，像是自己的无极塌了。长生如梦，一切终究抵不过命运的嘲弄。兵火燃尽的时候，妲己醒来。<li>女娲在等弟子的求情，但这一次她看到了不一样的光——妲己向女娲俯身下拜，然后朝着西岐的方向飞去。她不确定如何才叫爱，她只是忽然明白了，连无极都无法洗去的思念，修行又怎么能够呢……"]],
			"knyhzr卡柯ol":["male","min",4,["nyhzr宿敌之剑ol"],["ext:扩展ol/Newknyhzr卡柯.jpg","des:他曾是波斯帝国高贵的王子殿下，被称为太阳之子—他那金色的短发就如他的性格一般阳光璀璨。<li>可当权谋的阴影将他笼罩，面对至亲王叔的背叛与毒杀，再璀璨的金色也会染上复仇的暗光。仅仅是一夜之间，他失去了所有的亲人、他的家园、他爱慕的女子……以及一切，而他唯一收获的，就只有仇恨。但失去权势的王子殿下，又能用怎样的手段杀死那个已经坐上至高王座的仇人呢？<li>于是，当冥府之神阿努比斯现身时，他没有丝毫犹豫地签下了代表死亡的契约。冥神的力量在他的体内充斥，他终于彻底沦为复仇的傀儡。当他手持复仇双刃割下王叔的头颅，泪水终于无可抑制的从他的眼角滑落——财富、权势和贪婪，以及最后的仇恨，让他真正的一无所有。<li>对于生命，他还有什么可以贪恋的呢？当他手握王叔的头颅，迎来冥神阿努比斯时，唯一怀念的，就是太阳光辉笼罩下亲人温柔的回望。"]],
			"anyhzr艾薇ol":["female","min",3,["nyhzr追袭ol","nyhzr射月ol"],["ext:扩展ol/Newanyhzr艾薇.jpg","des:艾薇是暗月森林最美丽的精灵。可是，正是这份美丽，引来了大主祭的垂涎。为了摆脱纠缠，艾薇决定成为法定不得婚嫁的皇室神射手。<li>经过激烈的角逐，她得到精灵女王的认可，成功入选，甚至获得了专属于女性精灵射手的荣耀之名——神箭哲琴。<li>大主祭的美梦成了泡影。恼羞成怒的他决心毁掉这件自己得不到的珍宝。他勾结恶魔军团，在艾薇前往接受封赐的路上设伏偷袭。 艾薇的伙伴们在第一轮箭雨下死伤殆尽。<li>满怀悲愤的艾薇退入密林，用她冰冷的箭矢收割着恶魔的性命。企图逃走的大主祭被远远射来的一只大箭钉在树上，随后被密集的箭岚射成了蜂窝。<li>当援军赶到时，艾薇已经力竭身亡，藤弓流月静静地躺在她的脚边，她的四周是数千恶魔的尸首。"]],
			"fnyhzr福娃ol":["female","zhi",3,["nyhzr连年有余ol","nyhzr定时爆竹ol"],["ext:扩展ol/Newfnyhzr福娃.jpg","des:暂无"]],
			"gnyhzr关羽ol":["male","li",4,["nyhzr结义ol","nyhzr春秋刀法ol"],["ext:扩展ol/Newgnyhzr关羽.jpg","des:暂无"]],
			"lnyhzr李白ol":["male","min",3,["nyhzr青莲刃ol","nyhzr还鞘决ol"],["ext:扩展ol/Newlnyhzr李白.jpg","des:暂无"]],
			"cnyhzr嫦娥ol":["female","zhi",3,["nyhzr月之轮回ol","nyhzr月潮引力ol"],["ext:扩展ol/Newcnyhzr嫦娥.jpg","des:暂无"]],
			"fnyhzr服部半藏ol":["male","min",4,["nyhzr残废影刃ol"],["ext:扩展ol/Newfnyhzr服部半藏.jpg","des:暂无"]],
			"snyhzr神雕侠ol":["male","li",4,["nyhzr神雕ol"],["ext:扩展ol/Newsnyhzr神雕侠.jpg","des:暂无"]],
			"lnyhzr莱戈拉斯ol":["male","min",3,["nyhzr幻影分身ol","nyhzr神圣之箭ol"],["ext:扩展ol/Newlnyhzr莱戈拉斯.jpg","des:暂无"]],
			"ynyhzr月兔ol":["female","min",3,["nyhzr月之轮回ol","nyhzr月之惩罚ol"],["ext:扩展ol/Newynyhzr月兔.jpg","des:暂无"]],

			},
            skill:{
            "nyhzr仙灵伙伴ol":{
                nobracket:true,
                trigger:{
                    player:"phaseBegin",
                },
                forced:true,
                content:function (){
                    if(player.storage.nyhzr仙灵伙伴ol==undefined) player.storage.nyhzr仙灵伙伴ol=0;
                    player.markSkill('nyhzr仙灵伙伴ol');
                    game.log(player,'召唤一只妖精皮皮');
					game.broadcastAll(function(player){
						player.marks.nyhzr仙灵伙伴ol.setBackgroundImage('extension/扩展ol/nyhzr皮皮.jpg');
						player.storage.nyhzr仙灵伙伴ol+=1;
						player.syncStorage('nyhzr仙灵伙伴ol');
					},player);
                },
                intro:{
                    content:function (storage){
                        return '妖精皮皮为你作战！'+'<br>当前有'+storage+'只妖精皮皮'
                    },
                },
            },
            "nyhzr迷藏印记ol":{
                nobracket:true,
                audio:"ext:扩展ol:1",
                trigger:{
                    player:"damageBegin",
                },
                filter:function (event,player){
                    return player.num('h')>=1&&player.storage.nyhzr仙灵伙伴ol>=2;
                },
                content:function (){
                    player.storage.nyhzr仙灵伙伴ol-=2;
                    player.syncStorage('nyhzr仙灵伙伴ol');
                    game.log(player,'躲避了对方的攻击');
                    if (game.players.length<4){
                        player.chooseToDiscard(1,'h',true);
                    };
                    trigger.num--;
                },
            },
            "nyhzr恐惧镰刀ol":{
                nobracket:true,
                group:["nyhzr恐惧镰刀ol_gainMark","nyhzr恐惧镰刀ol_Triggera"],
                subSkill:{
                    gainMark:{
                        trigger:{
                            source:"damageBegin",
                        },
                        forced:true,
                        content:function (){
                            if(player.storage.nyhzr恐惧镰刀ol_gainMark==undefined) player.storage.nyhzr恐惧镰刀ol_gainMark=0;
                            player.markSkill('nyhzr恐惧镰刀ol_gainMark');
                            player.storage.nyhzr恐惧镰刀ol_gainMark+=1;
                            player.syncStorage('nyhzr恐惧镰刀ol_gainMark');
                            game.log(player,'造成的伤害为恐惧镰刀充能');
                        },
                        intro:{
                            content:function (storage){
                                return '当前有'+storage+'层夜魔之力'
                            },
                        },
                    },
                    Triggera:{
                        trigger:{
                            source:"damageEnd",
                        },
                        filter:function (event,player){
                            return player.storage.nyhzr恐惧镰刀ol_gainMark>=3;
                        },
                        forced:true,
                        content:function (){
                            player.storage.nyhzr恐惧镰刀ol_gainMark=0;
                            player.syncStorage('nyhzr恐惧镰刀ol_gainMark');
                            trigger.player.turnOver();
                        },
                    },
                },
            },
            "nyhzr恐惧结界ol":{
                nobracket:true,
                unique:true,
                global:"nyhzr恐惧ol",
            },
            "nyhzr恐惧ol":{
                trigger:{
                    source:"damageEnd",
                },
                filter:function (event,player){
                    if(player.group!='li') return false;
                    if(event.card&&event.card.name!='sha') return false;
                    return game.hasPlayer(function(target){
                        return player!=target&&target.hasSkill('nyhzr恐惧结界',player);
                    });
                },
                direct:true,
                content:function (){
                    'step 0'
                    var list=[];
                    for(var i=0;i<game.players.length;i++){
                    if(game.players[i]!=player&&game.players[i].hasSkill('nyhzr恐惧结界',player)){
                            list.push(game.players[i]);
                        };
                    };
                    event.list=list;
                    'step 1'
                    if(event.list.length){
                        var current=event.list.shift();
                        event.current=current;
                        player.chooseBool('是否对'+get.translation(current)+'发动【恐惧结界】？').set('choice',ai.get.attitude(player,current)>0);
                    }else{
                        event.finish();
                    }
                    'step 2'
                    if(result.bool){
                        player.logSkill('nyhzr恐惧结界',event.current);
                        event.current.recover();
                        event.current.draw();
                    }
                    event.goto(1);
                },
                ai:{
                    expose:0.2,
                },
            },
            "nyhzr龙人血脉ol":{
nobracket:true,
audio:"ext:扩展ol:1",
intro:{
content:function (storage){
return '已激活血脉数量：'+storage;
},
},
init:function (player){
player.storage.nyhzr龙人血脉ol=0;
},
trigger:{
global:"gameStart"
},
forced:true,
silent:true,
mark:true,
popup:false,
content:function (){
'step 0'
if(player.storage.nyhzr龙人血脉ol==undefined) player.storage.nyhzr龙人血脉ol=0;
setTimeout(function(){
player.useSkill('nyhzr龙人血脉ol');
player.storage.nyhzr龙人血脉ol+=30;
player.syncStorage('nyhzr龙人血脉ol');
},60000);
'step 2'
if(player.storage.nyhzr龙人血脉ol==30){
player.logSkill('nyhzr龙人血脉ol');
player.gainMaxHp();
player.recover();
game.log(player,'血脉觉醒');
}
if(player.storage.nyhzr龙人血脉ol==90){
player.logSkill('nyhzr龙人血脉ol');
player.draw(2);
game.log(player,'血脉觉醒');
}if(player.storage.nyhzr龙人血脉ol==150){
player.logSkill('nyhzr龙人血脉ol');
player.addSkill('nyhzr龙人血脉ol_1');
game.log(player,'血脉觉醒');
}
if(player.storage.nyhzr龙人血脉ol==240){
player.logSkill('nyhzr龙人血脉ol');
player.addSkill('nyhzr龙人血脉ol_2');
game.log(player,'血脉觉醒');
}
if(player.storage.nyhzr龙人血脉ol==300){
player.logSkill('nyhzr龙人血脉ol');
player.addSkill('nyhzr龙人血脉ol_3');
game.log(player,'血脉觉醒');
}
},
                subSkill:{
                    "1":{
trigger:{
player:"phaseBefore",
},
forced:true,
content:function (){
player.draw();
},
                    },
                    "2":{
mod:{
cardUsable:function (card){
if(get.info(card)&&get.info(card).forceUsable) return;
return 2;
},
targetInRange:function (){
return true;
},
},
                    },
                    "3":{
trigger:{
source:"damageEnd",
},
filter:function (event,player){
return player.num('h')>2;
},
content:function (){
player.discard(player.get("h"));
player.draw();
trigger.player.removeSkill(trigger.player.skills.randomGet());
},
check:function (event,player){
if(player.num('h')>4) return false;
if(player.hp<=1) return false;
if(player.identity==event.player.identity) return false;
if(event.player.identity=='zhu'&&player.identity=='zhong') return false;
if(player.identity=='zhu'&&event.player.identity=='zhong') return false;
return true;
},
            },
                },
            },
            "nyhzr女皇神威ol":{
                nobracket:true,
                audio:"ext:扩展ol:1",
                enable:"phaseUse",
                content:function (){
					game.log(player,'释放神威');
                    player.addTempSkill('nyhzr神威ol',{player:'phaseEnd'});
                    player.removeSkill('nyhzr女皇神威ol');
                },
                ai:{
                    order:100,
                    result:{
                        player:function (player){
                            return  player.num('h','sha');
                        },
                    },
                },
            },
            "nyhzr神威ol":{
                marktext:"神",
                intro:{},
                mark:true,
                trigger:{
                    source:"damageAfter",
                },
                forced:true,
                content:function (){
                    game.log(player,'的神威震慑对手');
                    trigger.player.chooseToDiscard(trigger.player.num('h'),'h',true);
                },
            },
            "rnyhzr幽影之蜕ol":{
                nobracket:true,
                marktext:"人",
                intro:{},
                mark:true,
                trigger:{
                    player:"damageAfter",
                },
                content:function (){
					game.log(player,'转化蜘蛛形态');
                    player.addSkill('znyhzr幽影之蜕ol');
                    player.addSkill('nyhzr蛛壳硬化ol');
                    player.removeSkill('rnyhzr幽影之蜕ol');
                    player.removeSkill('nyhzr女皇神威ol');
                },
            },
            "znyhzr幽影之蜕ol":{
                nobracket:true,
                marktext:"蛛",
                intro:{},
                mark:true,
                trigger:{
                    player:"damageAfter",
                },
                content:function (){
					game.log(player,'转化人类形态');
                    player.addSkill('rnyhzr幽影之蜕ol');
                    player.addSkill('nyhzr女皇神威ol');
                    player.removeSkill('znyhzr幽影之蜕ol');
                    player.removeSkill('nyhzr蛛壳硬化ol');
                },
            },
            "nyhzr蛛壳硬化ol":{
                nobracket:true,
                enable:"phaseUse",
                content:function (){
                    game.log(player,'硬化了自己的壳');
                    player.addSkill('nyhzr硬化ol');
                    player.removeSkill('nyhzr蛛壳硬化ol');
                },
                ai:{
                    order:100,
                    result:{
                        player:function (player){
                            return 1;
                        },
                    },
                },
				},
            "nyhzr硬化ol":{
                audio:"ext:扩展ol:1",
                marktext:"硬",
                intro:{},
                mark:true,
                trigger:{
                    player:"damageBegin",
                },
                forced:true,
                content:function (){
                    player.removeSkill('nyhzr硬化ol');
					game.log('硬化的蛛壳使',player,'免疫了攻击');
                    trigger.untrigger();
                    trigger.finish();
                },
            },
            "nyhzr血虐暴风ol":{
                nobracket:true,
                audio:"ext:扩展ol:1",
                trigger:{
                    source:"damageEnd",
                },
                forced:true,
                filter:function (event,player){
                    return player.hp==0||event.player.hp==0;
                },
                content:function (){
                    if (trigger.player.hp==0){
                        player.gainMaxHp();
                    };
                    if (player.hp==0){
                        trigger.player.loseHp();
                    };
                },
            },
            "nyhzr歃血为神ol":{
                nobracket:true,
                audio:"ext:扩展ol:2",
                trigger:{
                    source:"damageEnd",
                },
                filter:function (event,player){
                    return player.num('h')>0;
                },
                content:function (){
					"step 0"
					player.chooseControl(["弃牌恢复体力","将现有体力转化为护盾值"]).ai=function(){
						if(player.num('h')>1) return '弃牌恢复体力';
					};
					"step 1"
					if (result.control=='弃牌恢复体力'){
						player.chooseToDiscard(1,'h',true);
						player.recover();
						if (player.hp==player.maxHp&&player.hasSkill('nyhzr血虐暴风ol')){
							player.changeHujia();
							player.update();
							game.log(player,'获得1点护甲');
						};
					};
					if (result.control=='将现有体力转化为护盾值'){
						player.changeHujia(player.hp);
						game.log(player,'获得',player.hp,'点护甲');
						player.hp=0;
						player.update();
					};
                },
                check:function (event,player){
                    if(player.hp==player.maxHp) return false;
                    return true;
                },
            },
            "nyhzr燎火之箭ol":{
                nobracket:true,
                trigger:{
                    source:"damageBegin",
                },
				forced:true,
                content:function (){
					if(player.hasSkill('nyhzr银箭ol')){
						trigger.nature='thunder';
					}else{
                        trigger.nature='fire';
					}
                    trigger.player.discard(trigger.player.get('e'));
                },
            },
            "nyhzr穿云箭ol":{
                nobracket:true,
                ai:{
                    unequip:true,
                    skillTagFilter:function (player,tag,arg){
                        if(arg&&arg.name=='sha') return true;
                        return false;
                    },
                },
			},
            "nyhzr逐阳之弓ol":{
                nobracket:true,
                audio:"ext:扩展ol:2",
                mod:{
                    globalFrom:function (from,to,distance){
                        return distance-1;
                    },
                },
				trigger:{
                    player:"useCardBefore",
				},
				filter:function (event,player){
                    return event.card.name=='sha'&&_status.currentPhase==player;
				},
				check:function (event,player){
					return ai.get.attitude(player,event.target)<0;
				},
				content:function (){
					"step 0"
					player.chooseControl(["穿云箭","燎火之箭"]).ai=function(){
						if(player.hasSkill('nyhzr银箭ol')) return '燎火之箭';
						return '穿云箭';
					};
					"step 1"
					if (result.control=='穿云箭'){
						player.addTempSkill('nyhzr穿云箭ol',{player:'useCardAfter'});
						game.log(player,'将穿云箭上弦');
					};
					if (result.control=='燎火之箭'){
						player.addTempSkill('nyhzr燎火之箭ol',{player:'useCardAfter'});
						game.log(player,'将燎火之箭上弦');
					};
                },
			},
			"nyhzr颠倒灵魂ol":{
				nobracket:true,
				group:["nyhzr颠倒灵魂ol_draw","nyhzr颠倒灵魂ol_discard"],
				subSkill:{
					draw:{
						trigger:{
							player:"drawBegin",
						},
                        filter:function (event,player){
							return ui.discardPile.childNodes.length>=event.num;
						},
						forced:true,
						content:function (){
							"step 0"
							trigger.untrigger();
							trigger.finish();
							var cards=[];
							for(var i=0;i<ui.discardPile.childNodes.length;i++){
								cards.push(ui.discardPile.childNodes[i]);
							}
							player.chooseCardButton(cards,'选择卡牌获得之',trigger.num,true).ai=function(button){return 1};
							"step 1"
							if(result.bool){
								for(var i=0;i<result.links.length;i++){
									player.gain(result.links[i]);
									player.$gain2(result.links[i]);
									game.log(player,'获得了',result.links[i]);
									if(result.links[i].name=='wuzhong'||result.links[i].name=='zengbin'){
										player.chooseToDiscard(1,'h',true);
									};
								};
							}else{
								player.draw(trigger.num);
							};
						},
					},
					discard:{
						trigger:{
							player:"discardBegin",
						},
						forced:true,
						content:function (){
							trigger.untrigger();
							trigger.finish();
							for(var i=0;i<trigger.cards.length;i++){
								ui.cardPile.insertBefore(game.createCard(trigger.cards[i]),ui.cardPile.firstChild);
								game.log(player,'将',trigger.cards[i],'置于牌堆顶');
							};
							player.lose(trigger.cards,ui.special);
							player.$throw(trigger.cards);
						},
					},
				},
			},
            "nyhzr困兽之斗ol":{
				nobracket:true,
                audio:"ext:扩展ol:1",
                trigger:{
                    player:"phaseEnd",
                },
				frequent:true,
                content:function (){
					'step 0'
                    player.storage.nyhzrhorse=0;
                    for(var i=0;i<game.players.length;i++){
                        if(game.players[i]!=player){
                            if(game.players[i].get('e','3')){
								player.storage.nyhzrhorse++;
								game.players[i].discard(game.players[i].get('e','3'));
							};
                            if(game.players[i].get('e','4')){
								player.storage.nyhzrhorse++;
								game.players[i].discard(game.players[i].get('e','4'));
							};
                        };
                    };
					if(player.storage.nyhzrhorse>0) player.chooseTarget('选择使用【南蛮入侵】的目标',function(card,player,target){return target!=player;}).ai=function(target){return -ai.get.attitude(player,target)};
					'step 1'
                    if(result.bool){
                        for(var j=0;j<player.storage.nyhzrhorse;j++){
	                        player.useCard({name:'nanman'},result.targets[0]);
                        };
                    }else{
						event.finish();
                    };
                },
                ai:{
                    expose:0.1,
                },
            },
            "nyhzr永恒之斩ol":{
				nobracket:true,
                audio:"ext:扩展ol:1",
                init:function (player){
                    for(var i=0;i<game.players.length;i++){
                        game.players[i].storage.nyhzr永恒之斩ol=0;
                    }
                },
				global:"nyhzr永恒之斩ol_1",
                subSkill:{
                    1:{
                        mod:{
                            maxHandcard:function (player,num){
								if(player.storage.nyhzr永恒之斩ol>0) return num-player.storage.nyhzr永恒之斩ol;
                                return num;
                            },
                        },
						trigger:{
							player:'recoverAfter'
						},
						forced:true,
						filter:function (event,player){
							return player.storage.nyhzr永恒之斩ol>0;
						},
						content:function (){
							player.storage.nyhzr永恒之斩ol--;
							game.log(player,'的手牌上限+1');
						},
					},
                },
                trigger:{
                    source:"damageBegin",
                },
                forced:true,
                content:function (){
                    if(trigger.player.hp==trigger.player.maxHp){
						trigger.untrigger();
						trigger.finish();
						trigger.player.loseMaxHp();
                    }else{
						trigger.player.storage.nyhzr永恒之斩ol++;
						game.log(trigger.player,'的手牌上限-1');
					};
                },
            },
            "nyhzr仙荷甘露ol":{
				nobracket:true,
                audio:"ext:扩展ol:1",
				enable:'phaseUse',
				usable:1,
				filterCard:function(card){
					var type=get.type(card);
					for(var i=0;i<ui.selected.cards.length;i++){
						if(get.type(ui.selected.cards[i])==type) return false;
					};
					return true;
				},
				complexCard:true,
				selectCard:[1,Infinity],
				selectTarget:-1,
				filterTarget:true,
				line:'thunder',
				check:function(card){
					return 6-ai.get.value(card);
				},
				content:function(){
					target.draw(cards.length);
					if(cards.length>=2&&player.storage.nyhzr凤求凰ol!=0){
						player.storage.nyhzr凤求凰ol=0;
						player.recover();
					};
				},
				ai:{
					order:2,
					result:{
						player:function(player){
							if(player.hp!=player.maxHp&&player.storage.nyhzr凤求凰ol!=0) return 1;
							return 0;
						}
					},
					threaten:0.5
				},
			},
            "nyhzr凤求凰ol":{
				nobracket:true,
                audio:"ext:扩展ol:1",
				marktext:"凤",
                intro:{
                    content:function (storage){
                        if(storage==0){
							return '已解除封印'
						}else{
							return '未解除封印'
						};
                    },
                },
				mark:true,
				trigger:{
					player:'chooseToRespondBegin'
				},
				direct:true,
				unique:true,
				filter:function(event,player){
					if(event.responded) return false;
					for(var i=0;i<game.players.length;i++){
						if(game.players[i]!=player&&game.players[i].num('h')){
							return player.storage.nyhzr凤求凰ol==0;
						};
					};
					return false;
				},
				content:function(){
					"step 0"
					player.chooseTarget(function(card,player,target){return player!=target&&target.num('h')},'请选择【凤求凰】的目标').ai=function(target){
						var att=ai.get.attitude(player,target)+1;
						if(target.num('h','shan')||target.num('h','sha')){
							att*10;
						};
						return -att;
					};
					"step 1"
					if(result.bool){
						event.target=result.targets[0];
						event.goto(2);
					}else{
						event.finish();
					};
					"step 2"
					var target=event.target;
					var cards=target.get('h');
					player.chooseCardButton('选择'+get.translation(target)+'的一张手牌打出',cards).filterButton=function(button){return trigger.filterCard(button.link)};
					"step 3"
					if(result.bool){
						player.storage.nyhzr凤求凰ol=1;
						event.target.lose(result.links);
						trigger.untrigger();
						trigger.responded=true;
						result.buttons[0].link.remove();
						trigger.result={bool:true,card:result.buttons[0].link}
					};
				},
				ai:{
					effect:{
						target:function(card){
							if(get.tag(card,'respondShan')) return 0.7;
							if(get.tag(card,'respondSha')) return 0.7;
						}
					}
				},
			},
            "nyhzr火球术ol":{
				nobracket:true,
                trigger:{
                    player:"phaseAfter",
                },
                filter:function (event,player){
                    return player.num('h')>=2;
                },
                content:function (){
					'step 0'
                    player.chooseToDiscard(2,'h',true);
					'step 1'
                    event.target=game.players.randomGet(player);
                    event.target.showHandcards();
					'step 2'
                    var cards=event.target.get('h','sha');
                    if(cards.length>0){
                        player.gain(cards);
						event.target.$give(cards,player);
                    }else{
						event.target.damage('fire');
						event.target.storage.nyhzr火之箭矢ol++;
						game.log(event.target,'的火种+1');
                    };
                },
            },
            "nyhzr火之箭矢ol":{
				nobracket:true,
                group:["nyhzr火之箭矢ol_1111","nyhzr火之箭矢ol_2222"],
                subSkill:{
                    1111:{
                        init:function (player){
                            for(var i=0;i<game.players.length;i++){
								game.players[i].storage.nyhzr火之箭矢ol=0;
                            };
                        },
                        trigger:{
                            player:"phaseBefore",
                        },
                        filter:function (event,player){
                            return player.get('h','sha').length>0;
                        },
						frequent:true,
						content:function (){
							"step 0"
                            player.chooseTarget('选择【火之箭矢】的目标',function(card,player,target){return target!=player}).ai=function(target){return -ai.get.attitude(player,target)};
							"step 1"
							if(result.bool){
								player.chooseToDiscard(1,'h',{name:'sha'},true,'将一张【杀】转化为【火杀】并对目标使用');
								player.useCard({name:'sha',nature:'fire'},result.targets[0]);
								result.targets[0].storage.nyhzr火之箭矢ol++;
								game.log(result.targets[0],'的火种+1');
							}else{
								event.finish();
							};
						},
                    },
                    2222:{
                        trigger:{
                            player:"useCardToBefore",
                        },
						forced:true,
                        filter:function (event,player){
                            return event.target&&event.target!=player&&event.target.storage.nyhzr火之箭矢ol>0&&event.target.num('h')>0;
                        },
						content:function (){
							trigger.target.chooseToDiscard(1,'h',true);
							trigger.target.storage.nyhzr火之箭矢ol--;
							game.log(trigger.target,'的火种被引燃');
						},
                    },
                },
            },
            "nyhzr液态火ol":{
				nobracket:true,
				trigger:{
					source:'damageAfter'
				},
				filter:function (event,player){
					return player.get('e','1');
				},
				forced:true,
				content:function (){
					trigger.player.damage('nosource','fire');
				},
			},
            "nyhzr元素转化ol":{
				nobracket:true,
                trigger:{
                    global:"damageBefore",
                },
                filter:function (event,player){
                    return event.player&&event.num>0;
                },
                content:function (){
                    'step 0'
//					game.awakenShow('Newsnyhzr司马懿','20','red','元素转化');
                    player.chooseControl('火','雷','无属性',ui.create.dialog('请选择转化后的属性','hidden')).ai=function(event,player){if(trigger.player.get('e','2')&&trigger.player.get('e','2').name=='tengjia') return '火'};
                    "step 1"
                    if(result.control=='火'){
                        trigger.nature='fire';
                    };
                    if(result.control=='雷'){
                        trigger.nature='thunder';
                    };
                    if(result.control=='无属性'){
                        trigger.nature='';
                    };
                },
            },
            "nyhzr炎阳胄ol":{
				nobracket:true,
				trigger:{
					player:"damageAfter",
				},
				forced:true,
				content:function (){
					player.turnOver();
				},
            },
            "_nyhzr炎阳胄ol":{
				nobracket:true,
				trigger:{
					global:["gameStart","useCardAfter","useCardBefore","phaseBefore","loseEnd","phaseBegin","phaseDradBegin","phaseUseBegin","phaseUseEnd","phaseEnd","phaseDiscardAfter","phaseDiscardBegin","useSkillBefore","judgeBefore","judgeAfter"],
				},
				forced:true,
				filter:function (event,player){
					return player.hasSkill('nyhzr炎阳胄ol')&&player.storage._nyhzr炎阳胄ol!=0;
				},
				content:function (){
					player.storage._nyhzr炎阳胄ol=0;
					player.turnOver=function(all){
						if(player.name=='jnyhzr金乌ol'){
							if(player.storage.nyhzr炎阳胄ol==undefined||player.storage.nyhzr炎阳胄ol==1){
								game.broadcastAll(function(player){
									player.node.avatar.setBackgroundImage('extension/扩展ol/jnyhzr金乌1.jpg');
									player.storage.nyhzr炎阳胄ol=0;
								},player);
								player.addSkill('nyhzr不灭之炎ol');
							}else{
								game.broadcastAll(function(player){
									player.node.avatar.setBackgroundImage('extension/扩展ol/Newjnyhzr金乌.jpg');
									player.storage.nyhzr炎阳胄ol=1;
								},player);
								player.removeSkill('nyhzr不灭之炎ol');
							};
						};
						if(player.name2=='jnyhzr金乌ol'){
							if(player.storage.nyhzr炎阳胄ol==undefined||player.storage.nyhzr炎阳胄ol==1){
								game.broadcastAll(function(player){
									player.node.avatar2.setBackgroundImage('extension/扩展ol/jnyhzr金乌1.jpg');
									player.storage.nyhzr炎阳胄ol=0;
								},player);
								player.addSkill('nyhzr不灭之炎ol');
							}else{
								game.broadcastAll(function(player){
									player.node.avatar2.setBackgroundImage('extension/扩展ol/Newjnyhzr金乌.jpg');
									player.storage.nyhzr炎阳胄ol=1;
								},player);
								player.removeSkill('nyhzr不灭之炎ol');
							};
						};
					};
				},
            },
            "nyhzr业火ol":{
				nobracket:true,
				trigger:{
					player:'shaBegin'
				},
				priority:-1,
				check:function (event,player){
					return ai.get.attitude(player,event.target)<0;
				},
				content:function(){
					'step 0'
					trigger.target.chooseToRespond({name:'sha'},'请打出一张杀响应杀');
					"step 1"
					if(result.bool==false){
						trigger.directHit=true;
					}
				},
			},
            "nyhzr不灭之炎ol":{
				nobracket:true,
				trigger:{
					player:"phaseBefore",
				},
				forced:true,
				content:function (){
					"step 0"
					player.judge(function(card){return (get.color(card)=='red')?1:-1});
					"step 1"
					if(result.judge>0){
						player.recover();
					}else{
						player.draw();
					};
				},
			},
            "nyhzr善恶天秤ol":{
				nobracket:true,
				enable:'phaseUse',
				usable:1,
				filterCard:true,
				complexCard:true,
				selectCard:[2,Infinity],
				filterTarget:true,
				selectTarget:1,
				content:function (){
					var redCard=0;
					for(var i=0;i<cards.length;i++){
						if(get.color(cards[i])=='red'){
							redCard++;
						}
					};
					for(var i=0;i<cards.length;i++){
						if(Math.random()<=redCard/cards.length-0.01){
							target.getBuff();
							game.log(target,'的判定结果为善');
						}else{
							target.getDebuff();
							game.log(target,'的判定结果为恶');
						};
					};
				},
				check:function (card){
					if(get.color(card)=='black') return 1;
					if(get.color(card)=='red') return 0;
				},
				ai:{
					order:6,
					result:{
						target:function (player,target){
							return get.damageEffect(target,player);
						},
					},
				},
			},
            "nyhzr冰裂龟甲ol":{
				nobracket:true,
				trigger:{
					global:'useCardToBegin'
				},
				filter:function(event,player){
					return event.target&&event.target==player&&event.player!=player&&event.targets.length==1;
				},
				forced:true,
				content:function(){
					'step 0'
					player.judge(function(card){
						if(get.suit(card)=='club') return 1;
						if(get.suit(card)=='diamond') return 0;
						if(get.suit(card)=='heart') return 0;
						if(get.suit(card)=='spade') return -1;
					});
					'step 1'
					if(get.suit(result.card)=='club'){
						trigger.untrigger();
						trigger.finish();
						game.log(trigger.player,'的卡牌无效了');
					};
					if(get.suit(result.card)=='diamond'){
						for(var i=0;i<game.players.length;i++){
							trigger.targets.push(game.players[i]);
							game.log(game.players[i],'成为',trigger.card,'的额外目标');
						};
					};
					if(get.suit(result.card)=='heart'){
						trigger.targets.push(player.next);
						game.log(player.next,'成为',trigger.card,'的额外目标');
					};
					if(get.suit(result.card)=='spade'){
						player.chooseToDiscard(1,'h',true);
					};
				},
			},
            "nyhzr时光缓行ol":{
				nobracket:true,
    			trigger:{
					player:'damageAfter'
    			},
    			forced:true,
    			content:function(){
					'step 0'
					player.judge(function(card){
						if(get.color(card)=='red') return 1;
						if(get.color(card)=='black') return 0.5;
					});
					'step 1'
					if(get.color(result.card)=='red'){
						player.insertPhase();
					};
					if(get.color(result.card)=='black'&&trigger.source){
						trigger.source.disableSkill('',trigger.source.get('s'));
						trigger.source.addSkill('nyhzr时光缓行ol_1111')
					};
    			},
                subSkill:{
                    1111:{
                        trigger:{
                            player:"phaseBefore",
                        },
                        forced:true,
                        content:function (){
							player.enableSkill('',player.get('s'));
							player.removeSkill('nyhzr时光缓行ol_1111');
                        },
                    },
                },
    			ai:{
    				threaten:0,
    			},
    		},
            "nyhzr魔能法球ol":{
				nobracket:true,
                enable:"phaseUse",
                usable:1,
                content:function (){
					player.showHandcards();
					var pl=game.players.randomGet();
					pl.showHandcards();
					if(pl.get('h','shan').length>0) player.useCard({name:'sha'},pl,false);
				},
                ai:{
                    result:{
                        player:1,
                    },
                },
			},
            "nyhzr乌龙茶灵ol":{
				nobracket:true,
                trigger:{
                    player:"chooseToRespondBegin",
                },
				forced:true,
                filter:function (event,player){
                    if(event.responded) return false;
                    return event.filterCard({name:'sha'})||event.filterCard({name:'shan'});
                },
                content:function (){
                    "step 0"
                    player.judge(function(card){
						if(get.type(card)!='basic') return 1;
						return 0;
                    });
                    "step 1"
                    if(get.type(result.card)!='basic'){
						trigger.untrigger();
						trigger.responded=true;
						if(trigger.filterCard({name:'sha'})) trigger.result={bool:true,card:{name:'sha'}};
						if(trigger.filterCard({name:'shan'})) trigger.result={bool:true,card:{name:'shan'}};
                    };
                },
            },
            "nyhzr树灵爆发ol":{
				nobracket:true,
                enable:"phaseUse",
                usable:1,
                content:function (){
					if(!player.get('e','2')) player.draw();
					player.useCard({name:'sha'},player,false);
				},
                ai:{
                    result:{
                        player:function(player){
							if(player.get('e','2')) return 0;
							return player.hp-1;
						},
                    },
                },
			},
            "nyhzr大地护盾ol":{
				nobracket:true,
				trigger:{
					global:"damageBegin",
				},
				filter:function (event,player){
					return event.player.hp<=3&&player!=event.player&&event.source;
				},
				content:function (){
					'step 0'
					trigger.untrigger();
					trigger.finish();
					game.log('伤害效果消失了');
					player.loseHp();
					player.chooseTarget('选择【大地护盾】的目标',function(card,player,target){return target!=trigger.source}).ai=function(target){return ai.get.attitude(player,target)};
					'step 1'
					if(result.bool){
						result.targets[0].changeHujia();
						result.targets[0].update();
					}else{
						player.useCard({name:'nanman'},trigger.source);
					};
				},
                check:function (event,player){
					if(event.player.identity=='zhu'&&player.identity=='zhong'&&event.player.hp==1) return true;
					if(player.hp==1) return false;
					if(player.identity==event.player.identity) return true;
					if(player.identity=='zhu'&&event.player.identity=='zhong') return true;
					if(event.player.identity=='zhu'&&player.identity=='zhong') return true;
					return false;
                },
			},
            "nyhzr多变之水ol":{
				nobracket:true,
                group:["nyhzr多变之水ol_add凝水之盾","nyhzr多变之水ol_add泯灭水球"],
                subSkill:{
                    add凝水之盾:{
						trigger:{
							player:'damageAfter'
						},
						forced:true,
						content:function (){
							player.addSkill('nyhzr凝水之盾ol');
							player.removeSkill('nyhzr泯灭水球ol');
						},
                    },
                    add泯灭水球:{
						trigger:{
							source:'damageAfter'
						},
						forced:true,
						content:function (){
							player.addSkill('nyhzr泯灭水球ol');
							player.removeSkill('nyhzr凝水之盾ol');
						},
                    },
                },
			},
            "nyhzr凝水之盾ol":{
                nobracket:true,
                marktext:"凝",
                intro:{},
                mark:true,
				trigger:{
					player:'damageBegin'
				},
				filter:function (event,player){
					return event.source&&event.source.num('h')>0&&player.num('h')>0;
				},
				content:function (){
					'step 0'
					player.chooseCardButton('选择需要展示的手牌',player.get('h'));
					'step 1'
					if(result.bool){
						player.showCards(result.links);
						var sourceShowCard=trigger.source.get('h').randomGet();
						trigger.source.showCards(sourceShowCard);
						if(get.color(result.links)==get.color(sourceShowCard)){
							trigger.untrigger();
							trigger.finish();
							game.log('伤害效果消失了');
						}else{
							player.draw();
						};
					};
				},
            },
            "nyhzr泯灭水球ol":{
                nobracket:true,
                marktext:"泯",
                intro:{},
                mark:true,
				trigger:{
					source:'damageBegin'
				},
				content:function (){
					"step 0"
					trigger.player.chooseControl('heart','diamond','spade','club');
					"step 1"
					game.log(trigger.player,'选择了'+get.translation(result.control));
					trigger.player.popup(result.control);
					var cardPileFirstCard=get.cards(1);
					player.showCards(cardPileFirstCard);
					if(get.suit(cardPileFirstCard)==result.control){
						trigger.num+=1;
					}else{
					player.recover();
					};
				},
            },
            "nyhzr生命凋零ol":{
                nobracket:true,
				trigger:{
					global:["phaseJudgeBefore","phaseDrawBefore","phaseUseBefore","phaseDiscardBefore","damageBefore","recoverBefore","loseHpBefore","discardBefore","loseBefore","drawBefore","gainBefore"],
				},
				forced:true,
				popup:false,
				priority:Infinity,
				content:function (){
					trigger._triggered=null;
				},
			},
            "nyhzr无尽恐惧ol":{
                nobracket:true,
                trigger:{
					global:"dieAfter",
                },
                content:function (){
					"step 0"
					player.recover();
					player.chooseTarget(function(card,player,target){return target!=player}).ai=function(target){return -ai.get.attitude(player,target)};
					"step 1"
					if(result.bool){
						result.targets[0].turnOver();
					}else{
						player.draw();
					};
                },
            },
            "nyhzr鬼雄ol":{
                nobracket:true,
                marktext:"鬼",
                intro:{
                    content:function (storage){
						return '距离进入鬼雄状态还有'+(4-storage)+'个回合'
                    },
                },
                init:function (player){
                    player.storage.nyhzr鬼雄ol=0;
                },
                mark:true,
                group:["nyhzr鬼雄ol_1111","nyhzr鬼雄ol_2222","nyhzr鬼雄ol_3333"],
                subSkill:{
                    "1111":{
                        trigger:{
                            player:"phaseBegin",
                        },
                        forced:true,
                        popup:false,
                        content:function (){
							player.storage.nyhzr鬼雄ol++;
							if(player.storage.nyhzr鬼雄ol1==1){
								player.storage.nyhzr鬼雄ol1=0;
							};
							if(player.storage.nyhzr鬼雄ol>=4){
								player.storage.nyhzr鬼雄ol=0;
								player.storage.nyhzr鬼雄ol1=1;
							};
						},
                    },
                    "2222":{
                        trigger:{
                            player:"damageBegin",
                        },
                        forced:true,
                        filter:function (event,player){
							return player.storage.nyhzr鬼雄ol1==1;
                        },
                        content:function (){
							trigger.untrigger();
							trigger.finish();
							game.log('伤害效果消失了');
						},
                    },
                    "3333":{
                        trigger:{
                            player:"damageBegin",
                        },
                        forced:true,
                        filter:function (event,player){
							return player.storage.nyhzr鬼雄ol1!=1&&event.source&&event.source.num('h')>0;
                        },
                        content:function (){
							'step 0'
							var showTwoCard=get.cards(2);
							player.showCards(showTwoCard,'牌顶的两张牌');
							if (get.number(showTwoCard[0])+get.number(showTwoCard[1])>=10){
								player.chooseCardButton('选择'+get.translation(trigger.source)+'的一张手牌弃置',trigger.source.get('h'));
							}else{
								event.finish();
							};
							'step 1'
							if(result.bool){
								trigger.source.discard(result.links);
							};
						},
                    },
                },
			},
            "nyhzr天从云ol":{
                nobracket:true,
                marktext:"手",
                intro:{
                    content:function (storage){
						return '手牌上限+'+storage
                    },
                },
                init:function (player){
                    player.storage.nyhzr天从云ol=0;
                },
                mark:true,
                trigger:{
					source:'damageBegin',
				},
                forced:true,
                content:function (){
					var Random=[]
					for(var i=10;i<=100;i++){
						Random.push(i);
					};
					if(Math.random()<=1-Random.randomGet()*game.players.length/1000){
						trigger.num++
						player.storage.nyhzr天从云ol=0;
					}else{
						player.storage.nyhzr天从云ol++;
						player.syncStorage('nyhzr天从云ol');
					};
				},
				mod:{
    				maxHandcard:function (player,num){
            			if(player.storage.nyhzr天从云ol>0) return num+player.storage.nyhzr天从云ol;
            			return num;
    				},
				},
			},
            "nyhzr腐肉吸噬ol":{
				nobracket:true,
				trigger:{
					player:"phaseAfter",
				},
				filter:function (event,player){
					return player.num('h')<player.hp;
				},
				forced:true,
				content:function (){
					'step 0'
					event.cards=get.cards(player.hp-player.num('h'));
					player.showCards(event.cards);
					'step 1'
					nyhzr腐肉吸噬olNum=0;
					for(var i=0;i<event.cards.length;i++){
						if(get.color(event.cards[i])=='black') nyhzr腐肉吸噬olNum++;
					};
					if(nyhzr腐肉吸噬olNum>0){
						player.chooseControl('摸牌','恢复体力').set('ai',function(){
							if(player.hp==player.maxHp) return '摸牌'
							return '恢复体力'
						});
					}else{
						event.finish();
					};
					'step 2'
					if (result.control=='摸牌'){
						player.draw(nyhzr腐肉吸噬olNum);
						player.addTempSkill('nyhzr腐肉吸噬ol1',{player:'phaseEnd'})
					};
					if (result.control=='恢复体力'){
						player.recover();
					};
                },
			},
            "nyhzr腐肉吸噬ol1":{
				nobracket:true,
                trigger:{
                    player:"useCardAfter",
                },
                filter:function (event,player){
					return _status.currentPhase==player;
                },
                forced:true,
                content:function (){
					if(player.storage.nyhzr腐肉吸噬ol==undefined){
						player.storage.nyhzr腐肉吸噬ol=get.suit(trigger.card);
					}else{
						player.storage.nyhzr腐肉吸噬ol1=get.suit(trigger.card);
					};
					if(player.storage.nyhzr腐肉吸噬ol1!=undefined&&player.storage.nyhzr腐肉吸噬ol!=undefined&&player.storage.nyhzr腐肉吸噬ol!=player.storage.nyhzr腐肉吸噬ol1){
						player.draw();
						player.storage.nyhzr腐肉吸噬ol=player.storage.nyhzr腐肉吸噬ol1;
					};
                },
			},
            "nyhzr三尖两刃戟ol":{
                nobracket:true,
                mod:{
                    globalFrom:function (from,to,distance){
                        if(from.storage.nyhzr三尖两刃戟ol>0) return distance-from.storage.nyhzr三尖两刃戟ol-1;
						return distance-1;
                    },
                    selectTarget:function (card,player,range){
                        if(card.name=='sha') range[1]=player.storage.nyhzr三尖两刃戟ol+2;
                    },
                },
                init:function (player){
                    player.storage.nyhzr三尖两刃戟ol=0;
                },
                marktext:"戟",
                intro:{
                    content:function (storage){
						return '当前进攻距离：'+(storage+2)+'<br>当前杀可以指定'+(storage+2)+'个目标'
                    },
                },
                mark:true,
                trigger:{
                    player:"phaseEnd",
                },
                forced:true,
                content:function (){
					player.storage.nyhzr三尖两刃戟ol=0;
					player.syncStorage('nyhzr三尖两刃戟ol');
                },
			},
            "nyhzr通天法眼ol":{
                nobracket:true,
                trigger:{
                    player:"phaseBegin",
                },
                content:function (){
					'step 0'
					player.storage.nyhzr通天法眼olDiamond=0;
					player.storage.nyhzr通天法眼olHeart=0;
					player.storage.nyhzr通天法眼olClub=0;
					player.storage.nyhzr通天法眼olSpade=0;
					player.chooseTarget(function(card,player,target){return player!=target&&target.num('h')},'请选择一名角色').ai=function(target){return -ai.get.attitude(player,target)};
					'step 1'
					if(result.bool){
						event.target=result.targets[0];
						player.line(event.target,'thunder');
					}else{
						event.finish();
					};
					'step 2'
					player.chooseCardButton(get.translation(event.target)+'的手牌',event.target.get('h'));
					'step 3'
					targetCards=event.target.get('h');
					for(var i=0;i<targetCards.length;i++){
						if(get.suit(targetCards[i])=='diamond'&&player.storage.nyhzr通天法眼olDiamond!=1){
							player.storage.nyhzr三尖两刃戟ol++;
							player.syncStorage('nyhzr三尖两刃戟ol');
							player.storage.nyhzr通天法眼olDiamond=1;
						};
						if(get.suit(targetCards[i])=='heart'&&player.storage.nyhzr通天法眼olHeart!=1){
							player.storage.nyhzr三尖两刃戟ol++;
							player.syncStorage('nyhzr三尖两刃戟ol');
							player.storage.nyhzr通天法眼olHeart=1;
						};
						if(get.suit(targetCards[i])=='club'&&player.storage.nyhzr通天法眼olClub!=1){
							player.storage.nyhzr三尖两刃戟ol++;
							player.syncStorage('nyhzr三尖两刃戟ol');
							player.storage.nyhzr通天法眼olClub=1;
						};
						if(get.suit(targetCards[i])=='spade'&&player.storage.nyhzr通天法眼olSpade!=1){
							player.storage.nyhzr三尖两刃戟ol++;
							player.syncStorage('nyhzr三尖两刃戟ol');
							player.storage.nyhzr通天法眼olSpade=1;
						};
					};
					'step 4'
					var targetDiamondCards=0;
					var targetHeartCards=0;
					var targetClubCards=0;
					var targetSpadeCards=0;
					for(var i=0;i<targetCards.length;i++){
						if(get.suit(targetCards[i])=='diamond') targetDiamondCards++;
						if(get.suit(targetCards[i])=='heart') targetHeartCards++;
						if(get.suit(targetCards[i])=='club') targetClubCards++;
						if(get.suit(targetCards[i])=='spade') targetSpadeCards++;
					};
					if(targetDiamondCards>=2||targetHeartCards>=2||targetClubCards>=2||targetSpadeCards>=2){
						if(targetDiamondCards>=2) player.addTempSkill('qianxing',{player:'phaseBefore'});
						if(targetHeartCards>=2) player.recover();
						if(targetClubCards>=2) event.target.chooseToDiscard(1,'h',true);
						if(targetSpadeCards>=2) event.target.damage();
					}else{
						player.draw();
					};
				},
				ai:{
                    expose:0.5,
				},
			},
            "nyhzr神圣审判ol":{
                nobracket:true,
				mode:['identity'],
                trigger:{
					source:'damageAfter',
				},
                filter:function (event,player){
                    return event.card&&event.card.name=='sha';
                },
                forced:true,
                content:function (){
					'step 0'
					trigger.player.chooseControl('说出身份','流失体力').set('ai',function(){return '说出身份'});
					'step 1'
					if (result.control=='说出身份'){
						game.broadcastAll(function(player){
							player.chat('我是'+get.translation(trigger.player.identity));
							player.setIdentity(player.identity);
							player.node.identity.dataset.color=player.identity;
						},trigger.player);
					};
					if (result.control=='流失体力') trigger.player.loseHp();
				},
			},
            "nyhzr圣光护盾ol":{
                nobracket:true,
                group:["nyhzr圣光护盾ol_1111","nyhzr圣光护盾ol_2222"],
                subSkill:{
                    1111:{
                        enable:"phaseUse",
                        filterCard:true,
                        selectCard:1,
                        check:function(card){
	                        return 6-ai.get.value(card);
                        },
                        filterTarget:function (card,player,target){
                            return player!=target;
                        },
                        filter:function (event,player){
                            return !player.hujia;
                        },
                        content:function (){
                            target.storage.nyhzr圣光护盾ol=0;
							target.addSkill('nyhzr圣光护盾ol1');
							player.changeHujia();
							player.update();
                        },
                        ai:{
							order:5,
							result:{
								target:function (player,target){
    								return ai.get.recoverEffect(target);
								},
							},
                        },
                    },
                    2222:{
                        trigger:{
							global:"shaBegin",
						},
                        filter:function (event,player){
                            return event.target.storage.nyhzr圣光护盾ol==0&&player.hujia&&player.hujia>0&&event.player!=player;
                        },
						forced:true,
                        content:function (){
							game.log(player,'的圣光护盾保护了',trigger.target);
							trigger.untrigger();
							trigger.finish();
							trigger.player.useCard({name:'sha'},player);
						},
                    },
                },
			},
            "nyhzr圣光护盾ol1":{
                nobracket:true,
                marktext:"护",
                intro:{
                    content:function (storage){
						return '已获得米迦勒的庇护'
                    },
                },
                mark:true,
                trigger:{
                    player:"damageAfter",
                },
                forced:true,
                content:function (){
					game.log(player,'失去了米迦勒的庇护');
                    player.storage.nyhzr圣光护盾ol=1;
					player.removeSkill('nyhzr圣光护盾ol1');
                },
			},
            "nyhzr移形换影ol":{
                nobracket:true,
                trigger:{
                    target:"shaBefore",
                },
                forced:true,
				priority:Infinity,
                content:function (){
					"step 0"
					player.judge(function(card){
						if(get.color(card)=='black') return 1;
						return -1;
					});
					"step 1"
					if(get.color(result.card)=='black'){
						trigger.untrigger;
						trigger.finish();
						var target=[];
						for(var i=0;i<game.players.length;i++){
							if(game.players[i]!=player&&get.distance(player,game.players[i])<=2) target.push(game.players[i]);
						};
						trigger.player.useCard(trigger.card,target.randomGet());
					};
				},
			},
            "nyhzr电光火石ol":{
				nobracket:true,
				enable:"phaseUse",
				filterCard:function (card){
					return card.name=='sha';
				},
				selectCard:2,
				filterTarget:function (card,player,target){
					return player!=target;
				},
                content:function (){
					player.useCard({name:'sha',nature:'thunder'},target,false);
					player.addTempSkill('nyhzr电光火石ol1','shaAfter');
				},
				ai:{
				order:12,
                expose:0.8,
					result:{
						target:function (player,target){
							return get.damageEffect(target,player);
						},
					},
				},
			},
            "nyhzr电光火石ol1":{
				nobracket:true,
				trigger:{
					player:"shaBegin",
				},
				forced:true,
				popup:false,
				content:function (){
				trigger.directHit=true;
				},
			},
            "nyhzr高速格林炮ol":{
				nobracket:true,
				group:["nyhzr高速格林炮ol_first","nyhzr高速格林炮ol_clear"],
				subSkill:{
					first:{
						mod:{
							cardUsable:function (card,player,num){
								if(card.name=='sha') return Infinity;
							},
						},
						trigger:{
							player:"shaAfter",
						},
						priority:-1,
						forced:true,
                        filter:function (event,player){
                            return player.storage.nyhzr高速格林炮ol!=0&&_status.currentPhase==player;
                        },
						content:function (){
							'step 0'
							player.storage.nyhzr高速格林炮ol=0;
							player.storage.nyhzr高速格林炮ol1=0;
							for(var i=0;i<trigger.targets.length;i++){
								player.useCard({name:'sha'},trigger.targets[i]);
								player.useCard({name:'sha'},trigger.targets[i]);
							};
							'step 1'
							player.storage.nyhzr高速格林炮ol1=1;
						},
					},
					clear:{
						trigger:{
							player:"phaseEnd",
						},
						forced:true,
						popup:false,
						content:function (){
							player.storage.nyhzr高速格林炮ol=1;
						},
					},
				},
			},
            "_nyhzr高速格林炮ol1":{
				nobracket:true,
				trigger:{
					player:"shaBefore",
				},
				popup:false,
				forced:true,
                filter:function (event,player){
                     return player.storage.nyhzr高速格林炮ol1==0;
                },
				content:function (){
					"step 0"
					player.judge(function(card){return (get.color(card)=='black')?1.5:-0.5});
					"step 1"
					if(result.judge>0){
						player.useCard({name:'sha'});
						trigger.untrigger();
						trigger.finish();
					};
				},
			},
            "nyhzr穿刺射击ol":{
				nobracket:true,
				ai:{
					unequip:true,
					skillTagFilter:function (player,tag,arg){
						if(arg&&arg.name=='sha'&&player.storage.nyhzr高速格林炮ol==0) return true;
						return false;
					},
				},
			},
			"nyhzr乱世听凤ol":{
                nobracket:true,
                enable:"phaseUse",
                createDialog:function (player,target,onlylist){
					var list=target.storage.nyhzr乱世听凤ol;
					if(onlylist) return list;
					var dialog=ui.create.dialog('乱世听凤');
					dialog.add('选择需要恢复的限定技');
					_status.event.list=list;
					var clickItem=function(){
						_status.event._result=this.link;
						game.resume();
					};
					for(i=0;i<list.length;i++){
						if(lib.translate[list[i]+'_info']){
							var translation=get.translation(list[i]);
							if(translation[0]=='新'&&translation.length==3){
								translation=translation.slice(1,3);
							}else{
								translation=translation.slice(0,2);
							}
							var item=dialog.add('<div class="popup pointerdiv" style="width:50%;display:inline-block"><div class="skill">【'+translation+'】</div><div>'+lib.translate[list[i]+'_info']+'</div></div>');
							item.firstChild.addEventListener('click',clickItem);
							item.firstChild.link=list[i];
						};
					};
					dialog.add(ui.create.div('placeholder'));
					return dialog;
                },
                content:function (){
					"step 0"
					event.dialog=lib.skill.nyhzr乱世听凤ol.createDialog(target,player);
					nyhzr乱世听凤olQX=ui.create.control('取消',function(){
						event.dialog.close();
						nyhzr乱世听凤olQX.delete();
						event.finish();
						game.resume();
					})
					event.switchToAuto=function(){
						event._result=event.skillai(event.list);
						game.resume();
					};
					_status.imchoosing=true;
					game.pause();
					"step 1"
					_status.imchoosing=false;
					if(event.dialog){
						event.dialog.close();
					}
					nyhzr乱世听凤olQX.delete();
					for(i=0;i<game.players.length;i++){
						if(game.players[i].storage[result]==true) var Target=game.players[i];
					};
					if(Target){
						player.loseHp();
						Target.storage[result]=false;
						Target.markSkill(result);
						Target.enableSkill(result+'_awake');
						Target.syncStorage(result);
						Target.awakenedSkills.remove(result);
						game.log(lib.translate[result]+'恢复了');
					}else{
						game.log(lib.translate[result]+'未发动，无法恢复');
					};
                },
			},
			"_nyhzr乱世听凤ol":{
				trigger:{
					global:'gameStart'
				},
				filter:function (event,player){
					return player.hasSkill('nyhzr乱世听凤ol');
				},
				forced:true,
				content:function (){
					var skill=[];
					for(var i=0;i<game.players.length;i++){
						for(var j=0;j<game.players[i].getSkills().length;j++){
							skill.push(game.players[i].getSkills()[j]);
						};
					};
					player.storage.nyhzr乱世听凤ol=[];
					for(var i=0;i<skill.length;i++){
						if(get.info(skill[i]).intro&&get.info(skill[i]).intro.content=='limited') player.storage.nyhzr乱世听凤ol.push(skill[i]);
					};
				},
			},
			"nyhzr凤羽踏歌ol":{
				nobracket:true,
				unique:true,
				enable:"phaseUse",
				mark:true,
				skillAnimation:true,
				animationStr:"凤羽踏歌",
				animationColor:"fire",
				filterCard:function(card){
					var type=get.type(card);
					for(var i=0;i<ui.selected.cards.length;i++){
						if(get.type(ui.selected.cards[i])==type) return false;
					};
					return true;
				},
				complexCard:true,
				selectCard:3,
				init:function (player){
					player.storage.nyhzr凤羽踏歌ol=false;
				},
				filter:function (event,player){
					if(player.storage.nyhzr凤羽踏歌ol) return false;
					return game.dead.length>0;
				},
				content:function (){
					player.awakenSkill('nyhzr凤羽踏歌ol');
					player.storage.nyhzr凤羽踏歌ol=true;
					for(var i=0;i<game.dead.length;i++){
						game.dead[i].revive(game.dead[i].maxHp);
					};
					player.recover();
				},
				intro:{
					content:"limited",
				},
			},
			"nyhzr战争惧刃ol":{
				nobracket:true,
                init:function (player){
                    player.storage.nyhzr战争惧刃ol=[];
                },
                marktext:"战",
                intro:{
                    content:function(storage,player,skill){
    					var list=player.storage.nyhzr战争惧刃ol;
    					if(list.length){
    						var str='已记录技能：';
    						for(var i=0;i<list.length;i++){
    							if(lib.translate[list[i]+'_info']){
    								str+=get.translation(list[i])+'、';
    							};
    						};
    						return str.slice(0,str.length-1);
    					};
    				},
                },
                mark:true,
				trigger:{
					player:'phaseBegin',
				},
				forced:true,
				content:function(){
					for(var i=0;i<player.node.marks.childNodes.length;i++){
						if(player.node.marks.childNodes[i].name=='nyhzr战争惧刃ol'){
							game.broadcastAll(function(player){
								player.node.marks.childNodes[i].setBackgroundImage('extension/扩展ol/Newynyhzr雅典娜.jpg');
							},player);
						};
					};
					for(var i=0;i<game.players.length;i++){
						if(game.players[i]!=player){
							var skills=game.players[i].get('s',false,false);
							for(var j=0;j<skills.length;j++){
								if(lib.skill[skills[j]]&&lib.translate[skills[j]+'_info']){
									var str=lib.translate[skills[j]+'_info'];
									if(str.indexOf('杀')!=-1){
										game.players[i].removeSkill(skills[j]);
										player.storage.nyhzr战争惧刃ol.push(skills[j]);
										game.log(game.players[i],'的',skills[j],'被记录并删除了');
									};
								};
							};
						};
					};
					if(player.storage.nyhzr战争惧刃ol.length){
						player.addTempSkill(player.storage.nyhzr战争惧刃ol.randomGet(),{player:'phaseBefore'});
					}else{
						player.draw();
					}
				},
			},
            "nyhzr圣光法球ol":{
				nobracket:true,
				trigger:{
					global:"phaseEnd",
				},
				filter:function (event,player){
					return player.num('h')>=1&&player!=event.player;
				},
				direct:true,
				content:function (){
					'step 0'
					player.chooseBool('是否弃置一张手牌并令'+get.translation(trigger.player)+'进行一个额外的摸牌阶段？').ai=function (event,player){return (ai.get.attitude(player,trigger.player)>0&&trigger.player.num('h')<3)};
					'step 1'
					if(result.bool){
						player.chooseToDiscard(1,'h',true)
						trigger.player.phaseDraw();
					}else{
						event.finish();
					};
				},
            },
            "nyhzr欲望灾火ol":{
				nobracket:true,
				enable:'phaseUse',
				usable:1,
				unique:true,
				filterTarget:true,
				multitarget:true,
				selectTarget:2,
				targetprompt:['发起拼点','被拼点'],
				prompt:'选择两名拼点目标',
				content:function(){
					"step 0"
					if(targets[0].num('h')==0) targets[0].draw();
					if(targets[1].num('h')==0) targets[1].draw();
					if(targets[0].group!=targets[1].group) player.draw();
					targets[0].line(targets[1]);
					targets[0].chooseToCompare(targets[1]);
					"step 1"
					if(result.bool){
						targets[0].useCard({name:'sha',nature:'fire'},targets[1],false);
					}else{
						targets[1].useCard({name:'sha',nature:'fire'},targets[0],false);
					};
				},
				ai:{
					order:9,
                    expose:0.3,
					result:{
      				  	target:function(player,target){
							if(ai.get.attitude(player,target)<0) return -target.num('he');
   	  		 			},
   				 	},
				},
			},
            "nyhzr生存本能ol":{
				nobracket:true,
    			mod:{
    				targetEnabled:function(card,player,target){
    					if(player!=target&&target.hp<target.maxHp&&target.num('h')==0) return false;
    				}
    			},
				trigger:{
					player:"damageAfter",
				},
				direct:true,
				filter:function (event,player,card){
					return event.source&&player.hasSha();
				},
				content:function (){
					player.addSkill('nyhzr生存本能ol1');
					player.chooseToUse(get.prompt('是否对伤害来源使用一张【杀】？'),{name:'sha'},trigger.source);
				},
				ai:{
                    expose:0.1,
				},
            },
			"nyhzr生存本能ol1":{
				nobracket:true,
    			trigger:{
					player:'shaBegin'
				},
				popup:false,
				forced:true,
    			content:function(){
    				trigger.directHit=true;
					player.removeSkill('nyhzr生存本能ol1');
    			}
			},
            "nyhzr毁灭蛊箭ol":{
				nobracket:true,
				trigger:{
					player:'shaBegin'
				},
				filter:function(event,player){
					return _status.currentPhase==player;
				},
				forced:true,
				content:function(){
					'step 0'
					player.judge(function(card){
						if(get.color(card)=='black') return 1;
						if(get.color(card)=='red') return 0.5;
					});
					"step 1"
					if(get.color(result.card)=='black'){
						trigger.directHit=true;
					};
					if(get.color(result.card)=='red'){
						if(player.getStat().card.sha>=1){
							player.getStat().card.sha--;
						};
					};
				},
			},
            "nyhzr幻之分身ol":{
				nobracket:true,
				group:["nyhzr幻之分身ol_1111","nyhzr幻之分身ol_2222"],
				subSkill:{
					1111:{
						trigger:{
							player:"damageBegin",
						},
						check:function(event,player){
							if(player.hujia) return false;
							if(event.source==player) return false;
							return true;
						},
						content:function (){
							player.loseHp();
							trigger.untrigger();
							trigger.finish();
						},
					},
					2222:{
						enable:"phaseUse",
						usable:1,
						content:function (){
							player.loseHp();
							player.addTempSkill('nyhzr幻之分身2ol',{player:'phaseAfter'});
						},
					},
				},
			},
            "nyhzr幻之分身2ol":{
				nobracket:true,
				marktext:"分",
				intro:{},
				mark:true,
            },
            "nyhzr千叶斩ol":{
				nobracket:true,
				enable:"phaseUse",
				filterTarget:function (card,player,target){
					return player!=target;
				},
				filter:function (event,player){
					return player.num('h')>player.hp+1;
				},
				content:function (){
					"step 0"
					var qyzsha=get.cardPile(function(card){return card.name=='sha'});
					if(qyzsha&&player.num('h')>player.hp+1&&target.hp>0){
						player.gain(qyzsha,'gain2');
						player.useCard(qyzsha,target,false);
						player.chooseToDiscard(1,'h',true);
					}else{
						event.finish();
						if(player.hasSkill('nyhzr幻之分身2ol')){
							player.useCard(qyzsha,target);
							player.getBuff();
						};
					};
					"step 1"
					event.goto(0);
				},
				check:function (card){
					return 4-get.value(card);
				},
				ai:{
					order:8.5,
                    expose:0.2,
					result:{
						target:function (player,target){
							return get.damageEffect(target,player);
						},
					},
				},
            },
            "nyhzr地狱之躯ol":{
				nobracket:true,
				mod:{
					targetEnabled:function(card,player,target){
						if((card.name=='sha'&&player.get('e','1')&&target.storage.nyhzr地狱之躯ol!=undefined&&!target.storage.nyhzr地狱之躯ol.contains(player))) return false;
					},
				},
				init:function(player){
					player.storage.nyhzr地狱之躯ol=[];
				},
				intro:{
					content:function(storage,player,skill){
    					var list=player.storage.nyhzr地狱之躯ol;
    					if(list.length){
    						var str='已对';
    						for(var i=0;i<list.length;i++){
    							str+=get.translation(list[i])+'、';
    						};
    						return str.slice(0,str.length-1)+'发动';
    					};
					},
				},
				mark:true,
				trigger:{
					global:'equipAfter',
				},
				filter:function(event, player){
					return event.player!=player&&event.card&&get.subtype(event.card)=='equip1'&&player.storage.nyhzr地狱之躯ol&&!player.storage.nyhzr地狱之躯ol.contains(event.player);
				},
				check:function(event,player){
					return false;
				},
				content:function(){
					player.recover();
					player.draw();
					if (!player.storage.nyhzr地狱之躯ol.contains(trigger.player)) player.storage.nyhzr地狱之躯ol.push(trigger.player);
					player.markSkill('nyhzr地狱之躯ol');
					player.syncStorage('nyhzr地狱之躯ol');
				},
				ai:{
                    expose:0.1,
				},
			},
            "nyhzr神圣对决ol":{
				nobracket:true,
				enable:'phaseUse',
				filterTarget:function (card,player,target){
					return player!=target;
				},
				filter:function (event,player){
					return player.storage.nyhzr神圣对决ola!=0;
				},
				content:function(){
					'step 0'
					player.storage.nyhzr神圣对决ola=0;
					player.draw();
					target.draw();
					for(var i=0;i<game.players.length;i++){
						if(game.players[i]!=player&&game.players[i]!=target){
							game.broadcastAll(function(player){
								player.classList.add('out');
							},game.players[i]);
						};
					};
					'step 1'
					player.chooseControl('直至某一方受伤','直至某一方死亡','直至你的回合开始');
					'step 2'
                    if(result.control=='直至某一方受伤'){
                        player.addSkill('nyhzr神圣对决ol1');
                        target.addSkill('nyhzr神圣对决ol1');
						game.log(player,'与',target,'进入对决，直至某一方受伤，其他人不得打扰');
                    };
                    if(result.control=='直至某一方死亡'){
                        player.addSkill('nyhzr神圣对决ol2');
                        target.addSkill('nyhzr神圣对决ol2');
						game.log(player,'与',target,'进入对决，直至某一方死亡，其他人不得打扰');
                    };
                    if(result.control=='直至你的回合开始'){
                        player.addSkill('nyhzr神圣对决ol3');
						game.log(player,'与',target,'进入对决，直至',player,'的回合开始，其他人不得打扰');
                    };
				},
			},
            "nyhzr神圣对决ol1":{
				nobracket:true,
				trigger:{
					player:["damageAfter","dieBefore"],
				},
				forced:true,
				popup:false,
				content:function (){
					for(var i=0;i<game.players.length;i++){
						if(game.players[i].storage.nyhzr神圣对决ola==0) game.players[i].storage.nyhzr神圣对决ola=1;
						if(game.players[i].classList.contains('out')){
							if(game.players[i].hasSkill('nyhzr神圣对决ol1')) game.players[i].removeSkill('nyhzr神圣对决ol1');
							game.broadcastAll(function(player){
								game.players[i].classList.remove('out');
							},game.players[i]);
						}else{
							game.log(game.players[i],'退出决斗');
						};
					};
					if(trigger.source){
						trigger.source.addSkill('nyhzr神圣对决ol0');
						trigger.source.storage.nyhzr神圣对决ol0++;
						trigger.source.syncStorage('nyhzr神圣对决ol0');
					};
				},
			},
            "nyhzr神圣对决ol2":{
				nobracket:true,
				trigger:{
					player:"dieBefore",
				},
				forced:true,
				popup:false,
				content:function (){
					for(var i=0;i<game.players.length;i++){
						if(game.players[i].storage.nyhzr神圣对决ola==0) game.players[i].storage.nyhzr神圣对决ola=1;
						if(game.players[i].classList.contains('out')){
							if(game.players[i].hasSkill('nyhzr神圣对决ol2')) game.players[i].removeSkill('nyhzr神圣对决ol2');
							game.broadcastAll(function(player){
								game.players[i].classList.remove('out');
							},game.players[i]);
						}else{
							game.log(game.players[i],'退出决斗');
						};
					};
					if(trigger.source){
						trigger.source.addSkill('nyhzr神圣对决ol0');
						trigger.source.storage.nyhzr神圣对决ol0++;
						trigger.source.syncStorage('nyhzr神圣对决ol0');
						trigger.source.changeHujia(2);
						trigger.source.update();
					};
				},
			},
            "nyhzr神圣对决ol3":{
				nobracket:true,
				trigger:{
					player:"phaseBefore",
				},
				forced:true,
				popup:false,
				content:function (){
					for(var i=0;i<game.players.length;i++){
						if(game.players[i].storage.nyhzr神圣对决ola==0) game.players[i].storage.nyhzr神圣对决ola=1;
						if(game.players[i].classList.contains('out')){
							if(game.players[i].hasSkill('nyhzr神圣对决ol3')) game.players[i].removeSkill('nyhzr神圣对决ol3');
							game.broadcastAll(function(player){
								game.players[i].classList.remove('out');
							},game.players[i]);
						}else{
							game.players[i].draw();
							game.log(game.players[i],'退出决斗');
						};
					};
				},
			},
            "nyhzr神圣对决ol0":{
				nobracket:true,
				init:function(player){
					player.storage.nyhzr神圣对决ol0=0;
				},
				intro:{
					content:function(storage){
    					return '造成的伤害+'+storage;
					},
				},
				marktext:"神",
				mark:true,
				trigger:{
					source:"damageBefore",
				},
				forced:true,
				popup:false,
				filter:function (event,player){
					return player.storage.nyhzr神圣对决ol0;
				},
				content:function (){
					trigger.num+=player.storage.nyhzr神圣对决ol0;
				},
			},
            "nyhzr爆头ol":{
				nobracket:true,
				trigger:{
					source:"damageAfter",
				},
				forced:true,
				content:function (){
					"step 0"
					event.card=get.cards()[0];
					if(player.storage.nyhzr爆头ol==undefined) player.storage.nyhzr爆头ol=[];
					player.storage.nyhzr爆头ol.push(event.card);
					player.syncStorage('nyhzr爆头ol');
					player.showCards(event.card,'爆头');
					player.markSkill('nyhzr爆头ol');
					"step 1"
					for(var i=0;i<player.storage.nyhzr爆头ol.length-1;i++){
						if(get.number(event.card)&&get.number(event.card)==get.number(player.storage.nyhzr爆头ol[i])&&get.color(event.card)&&get.color(event.card)==get.color(player.storage.nyhzr爆头ol[i])) trigger.player.die();
					};
				},
				intro:{
					content:"cards",
					onunmark:function (storage,player){
						if(storage&&storage.length){
							player.$throw(storage);
							for(var i=0;i<storage.length;i++){
								ui.discardPile.appendChild(storage[i]);
							};
							delete player.storage.nyhzr爆头ol;
						};
					},
				},
            },
            "nyhzr黑桃暗杀ol":{
				nobracket:true,
				unique:true,
				enable:"phaseUse",
				mark:true,
				skillAnimation:true,
//				animationStr:"<img src="+lib.assetURL+'extension/扩展ol/黑桃皇后animationStr.png'+" width='760' height='244'>",
				init:function (player){
					player.storage.nyhzr黑桃暗杀ol=false;
				},
				filter:function (event,player){
					return !player.storage.nyhzr黑桃暗杀ol;
				},
				content:function (){
					player.awakenSkill('nyhzr黑桃暗杀ol');
					player.storage.nyhzr黑桃暗杀ol=true;
					game.broadcastAll(function(player){
						player.classList.add('out');
					},player);
					for(var i=0;i<player.get('h').length;i++){
						if(player.storage.nyhzr爆头ol==undefined) player.storage.nyhzr爆头ol=[];
						player.storage.nyhzr爆头ol.push(player.get('h')[i]);
						player.syncStorage('nyhzr爆头ol');
						player.markSkill('nyhzr爆头ol');
					};
					setTimeout(function(){
						game.broadcastAll(function(player){
							player.classList.remove('out');
						},player);
						player.useSkill('nyhzr黑桃暗杀ol1');
					},30000);
				},
				intro:{
					content:"limited",
				},
                ai:{
                    order:11,
                    result:{
                        player:function (player){
                            return  1;
                        },
                    },
                },
			},
            "nyhzr黑桃暗杀ol1":{
				content:function (){
					"step 0"
					player.chooseTarget('选择【黑桃暗杀】的目标',function(card,player,target){return target!=player}).ai=function(target){return -ai.get.attitude(player,target)};
					"step 1"
					if(result.bool){
						if(result.targets){
							player.line(result.targets[0]);
							result.targets[0].damage();
						};
					}else{
						event.finish();
					};
				},
				ai:{
                    expose:0.6,
				},
			},
            "nyhzr代天罚恶ol":{
				nobracket:true,
				trigger:{
					player:"phaseEnd",
				},
				direct:true,
				content:function (){
					'step 0'
					player.chooseTarget('选择【代天罚恶】的目标',function(card,player,target){return player!=target}).ai=function(target){return ai.get.attitude(player,target)};
					'step 1'
					if(result.bool){
						event.target=result.targets[0];
						player.line(event.target);
					}else{
						event.finish();
					};
					'step 2'
					player.judge(function(card){
						if(get.color(card)=='black') return 0.2;
						if(get.color(card)=='red') return 1;
					});
					'step 3'
                    if(get.color(result.card)=='black'){
						event.target.gain(result.card,'gain2');
						if(result.card.name=='sha'||result.card.name=='nanman'||result.card.name=='wanjian') event.target.useCard(result.card,player);
					}else{
						player.gain(result.card,'gain2');
						if(result.card.name=='sha'||result.card.name=='nanman'||result.card.name=='wanjian') player.useCard(result.card,event.target);
					};
				},
			},
            "nyhzr太阳之子ol":{
				nobracket:true,
				mod:{
					targetEnabled:function (card,player,target,now){
						if(card.name=='guohe') return false;
					},
				},
				trigger:{
					player:"phaseBefore",
				},
				forced:true,
				popup:false,
				content:function (){
					'step 0'
					player.skip('phaseJudge');
					player.skip('phaseDraw');
					player.skip('phaseUse');
					player.skip('phaseDiscard');
					player.chooseControl('判定阶段','摸牌阶段','出牌阶段','弃牌阶段').set('ai',function(){
						if(player.num('h')<=player.hp){
							return '弃牌阶段';
						}else{
							return '摸牌阶段';
						};
					});
					'step 1'
					if(result.control=='判定阶段'){
						player.phaseJudge();
						player.storage.nyhzr太阳之子olphaseJudge=0;
						player.addTempSkill('nyhzr太阳之子ol1',{player:'phaseJudgeAfter'});
					};
					if(result.control=='摸牌阶段'){
						player.phaseDraw();
						player.storage.nyhzr太阳之子olphaseDraw=0;
						player.addTempSkill('nyhzr太阳之子ol2',{player:'phaseDrawAfter'});
					};
					if(result.control=='出牌阶段'){
						player.phaseUse();
						player.storage.nyhzr太阳之子olphaseUse=0;
						player.addTempSkill('nyhzr太阳之子ol3',{player:'phaseUseAfter'});
					};
					if(result.control=='弃牌阶段'){
						player.phaseDiscard();
						player.storage.nyhzr太阳之子olphaseDiscard=0;
						player.addTempSkill('nyhzr太阳之子ol4',{player:'phaseDiscardAfter'});
					};
				},
			},
            "nyhzr太阳之子ol1":{
				nobracket:true,
				trigger:{
					player:'phaseJudgeEnd',
				},
				forced:true,
				popup:false,
				content:function (){
					'step 0'
					var list=['判定阶段','摸牌阶段','出牌阶段','弃牌阶段'];
					if(player.storage.nyhzr太阳之子olphaseJudge==0) list.remove('判定阶段');
					if(player.storage.nyhzr太阳之子olphaseDraw==0) list.remove('摸牌阶段');
					if(player.storage.nyhzr太阳之子olphaseUse==0) list.remove('出牌阶段');
					if(player.storage.nyhzr太阳之子olphaseDiscard==0) list.remove('弃牌阶段');
					if(list.length){
						player.chooseControl(list).set('ai',function(){
							return '弃牌阶段'
						});
					}else{
						player.storage.nyhzr太阳之子olphaseJudge=1;
						player.storage.nyhzr太阳之子olphaseDraw=1;
						player.storage.nyhzr太阳之子olphaseUse=1;
						player.storage.nyhzr太阳之子olphaseDiscard=1;
						event.finish();
					}
					'step 1'
					if(result.control=='判定阶段'){
						player.phaseJudge();
						player.storage.nyhzr太阳之子olphaseJudge=0;
						player.addTempSkill('nyhzr太阳之子ol1',{player:'phaseJudgeAfter'});
					};
					if(result.control=='摸牌阶段'){
						player.phaseDraw();
						player.storage.nyhzr太阳之子olphaseDraw=0;
						player.addTempSkill('nyhzr太阳之子ol2',{player:'phaseDrawAfter'});
					};
					if(result.control=='出牌阶段'){
						player.phaseUse();
						player.storage.nyhzr太阳之子olphaseUse=0;
						player.addTempSkill('nyhzr太阳之子ol3',{player:'phaseUseAfter'});
					};
					if(result.control=='弃牌阶段'){
						player.phaseDiscard();
						player.storage.nyhzr太阳之子olphaseDiscard=0;
						player.addTempSkill('nyhzr太阳之子ol4',{player:'phaseDiscardAfter'});
					};
				},
            },
            "nyhzr太阳之子ol2":{
				nobracket:true,
				trigger:{
					player:'phaseDrawEnd',
				},
				forced:true,
				popup:false,
				content:function (){
					'step 0'
					var list=['判定阶段','摸牌阶段','出牌阶段','弃牌阶段'];
					if(player.storage.nyhzr太阳之子olphaseJudge==0) list.remove('判定阶段');
					if(player.storage.nyhzr太阳之子olphaseDraw==0) list.remove('摸牌阶段');
					if(player.storage.nyhzr太阳之子olphaseUse==0) list.remove('出牌阶段');
					if(player.storage.nyhzr太阳之子olphaseDiscard==0) list.remove('弃牌阶段');
					if(list.length){
						player.chooseControl(list).set('ai',function(){
							return '出牌阶段';
						});
					}else{
						player.storage.nyhzr太阳之子olphaseJudge=1;
						player.storage.nyhzr太阳之子olphaseDraw=1;
						player.storage.nyhzr太阳之子olphaseUse=1;
						player.storage.nyhzr太阳之子olphaseDiscard=1;
						event.finish();
					}
					'step 1'
					if(result.control=='判定阶段'){
						player.phaseJudge();
						player.storage.nyhzr太阳之子olphaseJudge=0;
						player.addTempSkill('nyhzr太阳之子ol1',{player:'phaseJudgeAfter'});
					};
					if(result.control=='摸牌阶段'){
						player.phaseDraw();
						player.storage.nyhzr太阳之子olphaseDraw=0;
						player.addTempSkill('nyhzr太阳之子ol2',{player:'phaseDrawAfter'});
					};
					if(result.control=='出牌阶段'){
						player.phaseUse();
						player.storage.nyhzr太阳之子olphaseUse=0;
						player.addTempSkill('nyhzr太阳之子ol3',{player:'phaseUseAfter'});
					};
					if(result.control=='弃牌阶段'){
						player.phaseDiscard();
						player.storage.nyhzr太阳之子olphaseDiscard=0;
						player.addTempSkill('nyhzr太阳之子ol4',{player:'phaseDiscardAfter'});
					};
				},
            },
            "nyhzr太阳之子ol3":{
				nobracket:true,
				trigger:{
					player:'phaseUseEnd',
				},
				forced:true,
				popup:false,
				content:function (){
					'step 0'
					var list=['判定阶段','摸牌阶段','出牌阶段','弃牌阶段'];
					if(player.storage.nyhzr太阳之子olphaseJudge==0) list.remove('判定阶段');
					if(player.storage.nyhzr太阳之子olphaseDraw==0) list.remove('摸牌阶段');
					if(player.storage.nyhzr太阳之子olphaseUse==0) list.remove('出牌阶段');
					if(player.storage.nyhzr太阳之子olphaseDiscard==0) list.remove('弃牌阶段');
					if(list.length){
						player.chooseControl(list).set('ai',function(){
							return '判定阶段';
						});
					}else{
						player.storage.nyhzr太阳之子olphaseJudge=1;
						player.storage.nyhzr太阳之子olphaseDraw=1;
						player.storage.nyhzr太阳之子olphaseUse=1;
						player.storage.nyhzr太阳之子olphaseDiscard=1;
						event.finish();
					}
					'step 1'
					if(result.control=='判定阶段'){
						player.phaseJudge();
						player.storage.nyhzr太阳之子olphaseJudge=0;
						player.addTempSkill('nyhzr太阳之子ol1',{player:'phaseJudgeAfter'});
					};
					if(result.control=='摸牌阶段'){
						player.phaseDraw();
						player.storage.nyhzr太阳之子olphaseDraw=0;
						player.addTempSkill('nyhzr太阳之子ol2',{player:'phaseDrawAfter'});
					};
					if(result.control=='出牌阶段'){
						player.phaseUse();
						player.storage.nyhzr太阳之子olphaseUse=0;
						player.addTempSkill('nyhzr太阳之子ol3',{player:'phaseUseAfter'});
					};
					if(result.control=='弃牌阶段'){
						player.phaseDiscard();
						player.storage.nyhzr太阳之子olphaseDiscard=0;
						player.addTempSkill('nyhzr太阳之子ol4',{player:'phaseDiscardAfter'});
					};
				},
            },
            "nyhzr太阳之子ol4":{
				nobracket:true,
				trigger:{
					player:'phaseDiscardEnd',
				},
				forced:true,
				popup:false,
				content:function (){
					'step 0'
					var list=['判定阶段','摸牌阶段','出牌阶段','弃牌阶段'];
					if(player.storage.nyhzr太阳之子olphaseJudge==0) list.remove('判定阶段');
					if(player.storage.nyhzr太阳之子olphaseDraw==0) list.remove('摸牌阶段');
					if(player.storage.nyhzr太阳之子olphaseUse==0) list.remove('出牌阶段');
					if(player.storage.nyhzr太阳之子olphaseDiscard==0) list.remove('弃牌阶段');
					if(list.length){
						player.chooseControl(list).set('ai',function(){
							return '摸牌阶段';
						});
					}else{
						player.storage.nyhzr太阳之子olphaseJudge=1;
						player.storage.nyhzr太阳之子olphaseDraw=1;
						player.storage.nyhzr太阳之子olphaseUse=1;
						player.storage.nyhzr太阳之子olphaseDiscard=1;
						event.finish();
					}
					'step 1'
					if(result.control=='判定阶段'){
						player.phaseJudge();
						player.storage.nyhzr太阳之子olphaseJudge=0;
						player.addTempSkill('nyhzr太阳之子ol1',{player:'phaseJudgeAfter'});
					};
					if(result.control=='摸牌阶段'){
						player.phaseDraw();
						player.storage.nyhzr太阳之子olphaseDraw=0;
						player.addTempSkill('nyhzr太阳之子ol2',{player:'phaseDrawAfter'});
					};
					if(result.control=='出牌阶段'){
						player.phaseUse();
						player.storage.nyhzr太阳之子olphaseUse=0;
						player.addTempSkill('nyhzr太阳之子ol3',{player:'phaseUseAfter'});
					};
					if(result.control=='弃牌阶段'){
						player.phaseDiscard();
						player.storage.nyhzr太阳之子olphaseDiscard=0;
						player.addTempSkill('nyhzr太阳之子ol4',{player:'phaseDiscardAfter'});
					};
				},
            },
            "nyhzr怒战八方ol":{
				nobracket:true,
				trigger:{
					global:'useCard',
				},
				filter:function(event,player){
					if(get.type(event.card)!='basic'&&get.type(event.card)!='trick') return false;
					if(get.suit(event.card)&&player.num('h',{suit:get.suit(event.card)})){
						return event.player&&event.player!=player&&_status.currentPhase!=player;
					};
					return false;
				},
				direct:true,
				content:function(){
					'step 0'
					player.chooseCard('是否弃置花色为'+get.translation(get.suit(trigger.card)+'2')+'的手牌并使'+get.translation(trigger.player)+'打出的牌失效？',{suit:get.suit(trigger.card)}).set('ai',function(card){
						return get.attitude(player,trigger.player)<0;
					});
					'step 1'
					if(result.bool){
						player.discard(result.cards);
						trigger.untrigger();
						trigger.finish();
					}else{
						event.finish();
					}
					'step 2'
					if(get.color(trigger.card)=='black'){
						player.draw();
						if(player.hasSkill('nyhzr所向披靡ol')) player.useSkill('nyhzr所向披靡ol');
					}else{
						player.useCard({name:'sha'},trigger.player)
					};
				},
				ai:{
					expose:0.1,
				},
			},
            "nyhzr所向披靡ol":{
				nobracket:true,
				content:function (){
					"step 0"
					var list=["令一名角色摸牌","弃置一名其他角色装备区内的装备牌"];
					player.chooseControl(list);
					'step 1'
					if(result.control=='令一名角色摸牌') player.useSkill('nyhzr所向披靡ol1');
					if(result.control=='弃置一名其他角色装备区内的装备牌') player.useSkill('nyhzr所向披靡ol2');
				},
			},
            "nyhzr所向披靡ol1":{
				content:function (){
					"step 0"
					player.chooseTarget('请选择【所向披靡】的目标',function(card,player,target){return target}).ai=function(target){return ai.get.attitude(player,target)};
					"step 1"
					if(result.bool){
						result.targets[0].draw();
					}else{
						event.finish();
					};
				},
            },
            "nyhzr所向披靡ol2":{
				content:function (){
					"step 0"
					player.chooseTarget('请选择【所向披靡】的目标',function(card,player,target){return target.num('e')>0&&target!=player}).ai=function(target){return -ai.get.attitude(player,target)};
					"step 1"
					if(result.bool){
						player.discardPlayerCard(1,result.targets[0],'e'); 
					}else{
						event.finish();
					};
				},
            },	
            "nyhzr追魂剑ol":{
				nobracket:true,
				trigger:{
					player:"shaHit",
				},
				forced:true,
				content:function (){
                    if(trigger.target.storage.nyhzr追魂剑ol==undefined) trigger.target.storage.nyhzr追魂剑ol=0;
                    trigger.target.markSkill('nyhzr追魂剑ol');
					trigger.target.storage.nyhzr追魂剑ol+=1;
					trigger.target.syncStorage('nyhzr追魂剑ol');
                },
                intro:{
                    content:function (storage){
                        return '当前有'+storage+'个追魂印记'
                    },
                },
			},
            "_nyhzr追魂剑ol1":{
				trigger:{
					player:"recoverBefore",
				},
				priority:Infinity,
				forced:true,
				filter:function (event,player){
					return player.storage.nyhzr追魂剑ol>=1;
				},
				content:function (){
					trigger.untrigger();
					trigger.finish();	
				},
			},
            "_nyhzr追魂剑ol2":{
				trigger:{
					player:"damageAfter",
				},
				priority:Infinity,
				forced:true,
				filter:function (event,player){
					return player.storage.nyhzr追魂剑ol>=2;
				},
				content:function (){
					for(var i=0;i<game.players.length;i++){
						if(game.players[i].hasSkill('nyhzr追魂剑ol')) game.players[i].draw();
					};
				},
			},
            "_nyhzr追魂剑ol3":{
				trigger:{
					player:"damageAfter",
				},
				priority:Infinity,
				forced:true,
				filter:function (event,player){
					return player.storage.nyhzr追魂剑ol>=3;
				},
				content:function (){
					player.discard(player.get("he"));
				},
			},
            "_nyhzr追魂剑ol4":{
				trigger:{
					player:"damageAfter",
				},
				priority:Infinity,
				forced:true,
				filter:function (event,player){
					return player.storage.nyhzr追魂剑ol>=4;
				},
				content:function (){
					player.die();
				},
			},
            "nyhzr七十二变ol":{
				nobracket:true,
                init:function (player){
                    if(player.storage.nyhzr七十二变ol1!=1) player.storage.nyhzr七十二变ol=2;
					player.storage.nyhzr七十二变ol1=1;
                },
                marktext:"变",
                intro:{},
                mark:true,
				trigger:{
					player:'phaseBegin',
				},
				forced:true,
				content:function(){
					'step 0'
					if(player.storage.nyhzr七十二变ol>0){
						player.chooseControl('摸牌','获得技能').set('ai',function(){return '获得技能'});
					}else{
						event.finish();
					};
					'step 1'
					if(result.control=='摸牌'){
						player.draw();
						player.storage.nyhzr七十二变ol--;
						player.syncStorage('nyhzr七十二变ol');
					};
					if(result.control=='获得技能'){
						var skill=[];
						for(var i=0;i<game.players.length;i++){
							if(game.players[i]!=player){
								for(var j=0;j<game.players[i].get('s',false,false).length;j++){
									if(!player.hasSkill(game.players[i].get('s',false,false)[j])) skill.push(game.players[i].get('s',false,false)[j]);
								};
							};
						};
						player.addSkill(skill.randomGet());
						player.storage.nyhzr七十二变ol--;
						player.syncStorage('nyhzr七十二变ol');
					};
					'step 2'
					if(player.storage.nyhzr七十二变ol>0) event.goto(0);
				},
			},
            "nyhzr火眼金睛ol":{
                nobracket:true,
                trigger:{
                    player:"phaseUseBefore",
                },
				forced:true,
                content:function (){
					'step 0'
					player.chooseTarget(function(card,player,target){return player!=target&&target.num('h')},'请选择一名角色并观看其手牌').ai=function(target){return target.num('h')};
					'step 1'
					if(result.bool){
						event.target=result.targets[0];
						player.line(event.target);
					}else{
						event.finish();
					};
					'step 2'
					player.chooseCardButton(get.translation(event.target)+'的手牌',event.target.get('h'));
					'step 3'
					for(var i=0;i<event.target.get('h').length;i++){
						if(event.target.get('h')[i].name=='sha'){
							player.storage.nyhzr七十二变ol++;
							player.syncStorage('nyhzr七十二变ol');
						};
					};
					if(event.target.get('h','sha').length==0) player.draw();
				},
			},
            "_nyhzr七十二变ol":{
				trigger:{
					player:'phaseBefore',
				},
				forced:true,
				filter:function (event,player){
					return player.hasSkill('nyhzr七十二变ol');
				},
				content:function(){
					player.clearSkills();
					player.addSkill('nyhzr七十二变ol');
					player.addSkill('nyhzr火眼金睛ol');
				},
			},
            "nyhzr战火盾甲ol":{
				nobracket:true,
				trigger:{
					player:"damageAfter",
				},
				filter:function (event,player){
					return event.source;
				},
				content:function (){
					'step 0'
					if(trigger.source.num('h')>0){
					player.chooseControl('red','black').set('ai',function(){return 'red'});
					}else{
						event.finish();
					};
					'step 1'
					var sourceShowCard=trigger.source.get('h').randomGet();
					player.showCards(sourceShowCard);
					if(get.color(sourceShowCard)==result.control){
						trigger.source.discard(sourceShowCard);
						event.goto(0);
					};
				},
				ai:{
                    expose:0.3,
				},
            },
            "nyhzr束缚搏击ol":{
				nobracket:true,
				enable:'chooseToUse',
				filterCard:function(card){
					return get.type(card)=='trick';
				},
				position:'h',
				viewAs:{name:'juedou'},
				prompt:'将一张非延时性锦囊牌当【决斗】使用',
			},
            "nyhzr弹药填装ol":{
				nobracket:true,
                init:function (player){
                    player.storage.nyhzr弹药填装ol=0;
                },
                marktext:"弹",
                intro:{
                    content:function (storage){
						return '当前拥有'+Math.floor(storage/5)+'个'
                    },
                },
                mark:true,
				trigger:{
					player:"phaseAfter",
				},
				forced:true,
				content:function (){
					"step 0"
					var targets=[];
					for(var i=0;i<game.players.length;i++){
						if(game.players[i]!=player) targets.push(game.players[i]);
					};
					nyhzr弹药填装oltarget=targets.randomGet();
					player.draw(2);
					if(nyhzr弹药填装oltarget.num('h')==0) nyhzr弹药填装oltarget.draw();
					nyhzr弹药填装oltarget.line(player);
					nyhzr弹药填装oltarget.chooseToCompare(player);
					"step 1"
					if(result.bool){
						if(ai.get.attitude(nyhzr弹药填装oltarget,player)>0){
							nyhzr弹药填装oltarget.line(player);
							player.storage.nyhzr弹药填装ol+=5;
							player.syncStorage('nyhzr弹药填装ol');
						}else{
							player.line(nyhzr弹药填装oltarget,'fire');
							nyhzr弹药填装oltarget.damage('fire');
						};
					}else{
						player.storage.nyhzr弹药填装ol+=result.num2-result.num1;
						player.syncStorage('nyhzr弹药填装ol');
					};
				},
				ai:{
                    expose:0.05,
				},
			},
            "nyhzr高距炮弹ol":{
				nobracket:true,
				enable:"phaseUse",
				filterTarget:function (card,player,target){
					return player!=target;
				},
				filter:function (event,player){
					return player.storage.nyhzr弹药填装ol>=5;
				},
				content:function (){
					player.storage.nyhzr弹药填装ol-=5;
					player.syncStorage('nyhzr弹药填装ol');
					player.useCard({name:'sha',nature:'fire'},target,false);
				},
				ai:{
					order:8.5,
                    expose:0.8,
					result:{
						target:function (player,target){
							return get.damageEffect(target,player);
						},
					},
				},
            },
            "nyhzr九命妖尾ol":{
				nobracket:true,
				trigger:{
					player:"phaseBefore",
				},
				forced:true,
				filter:function (event,player){
					return player.hp<player.maxHp;
				},
				content:function(){		
					var card=get.cards(1);
					player.showCards(card,'九命妖尾');
					if(get.number(card[0])>=9){
						player.recover();
					}else{
						player.useSkill('nyhzr勾魂大法ol');
					};
				},
			},
            "nyhzr勾魂大法ol":{
				nobracket:true,
				enable:"phaseUse",
				usable:1,
				content:function (){
					for(var i=0;i<game.players.length;i++){
						if(game.players[i]!=player&&game.players[i].sex=='male'&&game.players[i].num('h')>0){
							player.gainPlayerCard('h',game.players[i],true);
							player.useSkill('nyhzr勾魂大法ol1');
						};
					};
				},
				ai:{
					order:1,
					result:{
						player:function (player){
							return 1;
						},
					},
				},
			},
            "nyhzr勾魂大法ol1":{
				content:function(){
					"step 0"
					var list=["弃牌","将一张牌复制并交给所有其他角色"];
					player.chooseControl(list)
					"step 1"
					if(result.control=='弃牌'){
						player.chooseToDiscard(1,'h',true);
						event.finish();
					};
					if(result.control=='将一张牌复制并交给所有其他角色'){
						if(player.num('h')>0) player.chooseCard('请选择需要复制并交给所有其他角色的牌',function(card){return true}).ai=function(card){return 4-ai.get.value(card)};
					};
					'step 2'
					if(result.bool){
						for(var i=0;i<game.players.length;i++){
							if(game.players[i]!=player) game.players[i].gain(game.createCard(result.cards[0]),'gain2');
						};
					};
				},	
			},
            "nyhzr宿敌之剑ol":{
				nobracket:true,
				enable:"phaseUse",
				usable:1,
				filter:function (event,player){
					return player.num('h','sha')>0;
				},
				filterCard:function (card){
					return card.name=='sha';
				},
				filterTarget:function (card,player,target){
					return player!=target;
				},
				content:function (){
					"step 0"
					var list=["弃牌或流失体力"];
					if(target.num('h','sha')>0) list.push('弃置一张杀');
					target.chooseControl(list).ai=function(){
						if(target.num('h','sha')>0) return '弃置一张杀';
						return '弃牌或流失体力';
					};
					"step 1"
					if(result.control=='弃牌或流失体力'){
						var list=["流失一点体力"];
						if(target.num('h')>=2) list.push('弃置两张手牌');
						target.chooseControl(list).ai=function(){
							if(target.num('h')>=2) return '弃置两张手牌';
							return '流失一点体力';
						};
					};
					if(result.control=='弃置一张杀'){
						target.chooseToDiscard(function(card){return card.name=='sha'},true);
						player.useCard({name:'juedou'},target);
						if(player.hp<3) player.draw();
						event.finish();
					};
					'step 2'
					if(result.control=='弃置两张手牌'){
						target.chooseToDiscard(2,'h',true);
					};
					if(result.control=='流失一点体力'){
						target.loseHp();
					};
				},
				ai:{
					order:9,
                    expose:0.6,
					result:{
						target:function (player,target){
							return get.damageEffect(target,player);
						},
					},
				},
			},
            "nyhzr追袭ol":{
				nobracket:true,
                mod:{
                    globalFrom:function (from,to,distance){
                        return distance-(from.maxHp-from.hp);
                    },
                },
                trigger:{
                    player:"useCardBefore",
                },
                forced:true,
				popup:false,
                content:function (){
                    player.removeAdditionalSkill('nyhzr追袭ol');
                    var list=[];
                    if(player.getAttackRange()<2) list.push('feiying');
                    if(player.getAttackRange()==2) list.push('guanshi_skill');
                    if(player.getAttackRange()>2) list.push('qinggang_skill');
                    if(list.length) player.addAdditionalSkill('nyhzr追袭ol',list);
				},
			},
            "nyhzr射月ol":{
				nobracket:true,
                mod:{
                    globalFrom:function (from,to,distance){
                        if(from.storage.nyhzr射月ol>0) return distance+from.storage.nyhzr射月ol;
						return distance;
                    },
                },
				enable:"phaseUse",
				filterTarget:function (card,player,target){
					return player!=target&&get.distance(player,target,'attack')<=1;
				},
				content:function (){
					player.useCard({name:'sha'},target,false);
					if(player.storage.nyhzr射月ol==undefined) player.storage.nyhzr射月ol=0;
					player.storage.nyhzr射月ol+=1;
				},
				ai:{
					order:2,
                    expose:0.5,
					result:{
						target:function (player,target){
							return get.damageEffect(target,player);
						},
					},
				},
			},
            "_nyhzr射月ol":{
                trigger:{
                    player:"phaseAfter",
                },
                forced:true,
				filter:function (event,player){
					return player.hasSkill('nyhzr追袭ol');
				},
                content:function (){
					player.storage.nyhzr射月ol=0;
				},
			},
            "nyhzr连年有余ol":{
				nobracket:true,
    			trigger:{
					player:'discardAfter',
				},
    			direct:true,
    			content:function(){
    				'step 0'
					if(trigger.cards.length>1) player.draw(trigger.cards.length);
					if(player.storage.nyhzr定时爆竹ol!=true&&!_status.connectMode){
    					var list=['equip1','equip2','equip3','equip4','equip5'];
    					for(var i=0;i<list.length;i++){
    						if(player.getEquip(list[i])) list.splice(i--,1);
    					};
    					list.push('cancel2');
    					player.chooseControl(list).prompt='请选择【'+get.translation(trigger.cards[0].name)+'】改变后的装备类型';
					}else{
						player.storage.nyhzr定时爆竹ol=false;
						event.finish();
					};
    				'step 1'
    				if(result.control&&result.control!='cancel2'){
    					var name='nyhzr连年有余ol'+'_'+result.control+'_'+trigger.cards[0].name;
    					lib.card[name]=get.copy(get.info(trigger.cards[0]));
    					lib.card[name].subtype=result.control;
    					lib.card[name].epic=true;
    					lib.card[name].cardimage='wugu';
    					lib.card[name].source=[trigger.cards[0].name];
    					lib.translate[name]=lib.translate[trigger.cards[0].name];
    					lib.translate[name+'_info']=lib.translate[trigger.cards[0].name+'_info'];
    					trigger.cards[0].init([trigger.cards[0].suit,trigger.cards[0].number,name,trigger.cards[0].nature]);
						player.equip(trigger.cards[0])
    				};
    			},
			},
            "_nyhzr连年有余ol":{
    			trigger:{
        			player:"phaseBefore",
    			},
    			forced:true,
				filter:function (event,player){
					return player.hasSkill('nyhzr连年有余ol');
				},
    			content:function (){
        			if(player.getEquip('equip1')) player.gain(player.getEquip('equip1'),'gain2');
        			if(player.getEquip('equip2')) player.gain(player.getEquip('equip2'),'gain2');
        			if(player.getEquip('equip3')) player.gain(player.getEquip('equip3'),'gain2');
        			if(player.getEquip('equip4')) player.gain(player.getEquip('equip4'),'gain2');
        			if(player.getEquip('equip5')) player.gain(player.getEquip('equip5'),'gain2');
    			},
			},
            "nyhzr定时爆竹ol":{
				nobracket:true,
    			trigger:{
					player:'phaseAfter',
				},
				filter:function (event,player){
					if(_status.connectMode) return player.num('h')>0;
					return player.num('e')>0;
				},
				check:function (event,player){
//					return player.num('h','shan')>0;
					return false;
				},
				content:function (){
					if(_status.connectMode){
						player.chooseToDiscard(1,'h',true);
					}else{
						player.chooseToDiscard(1,'e',true);
					};
					player.storage.nyhzr定时爆竹ol=true;
					setTimeout(function(){
						player.useCard({name:'sha',nature:'fire'},game.players,false);
					},10000);
				},
			},			
            "nyhzr隐匿·胧ol":{
				nobracket:true,
                init:function (player){
                    player.storage.nyhzr隐匿·胧ol=0;
                },
                marktext:"胧",
                intro:{
                    content:function (storage){
						return '已触发'+get.cnNumber(storage)+'次隐藏指向线效果'
                    },
                },
                mark:true,
			},
            "_nyhzr隐匿·胧ol":{
				trigger:{
					global:["gameStart","useCardAfter","useCardBefore","phaseBefore","loseEnd","phaseBegin","phaseDradBegin","phaseUseBegin","phaseUseEnd","phaseEnd","phaseDiscardAfter","phaseDiscardBegin","useSkillBefore","judgeBefore","judgeAfter"],
				},
				forced:true,
				filter:function (event,player){
					return player.hasSkill('nyhzr隐匿·胧ol')&&player.storage.nyhzr隐匿·胧ol1!=0;
				},
				content:function (){
					player.storage.nyhzr隐匿·胧ol1=0;
					player.line=function(all){
						player.storage.nyhzr隐匿·胧ol+=1;
						if(player.storage.nyhzr隐匿·胧ol>=5){
							player.addTempSkill('qianxing',{player:'phaseBefore'});
							player.storage.nyhzr隐匿·胧ol=0;
							player.syncStorage('nyhzr隐匿·胧ol');
						};
					};
				},
			},
            "nyhzr幕府利刃ol":{
				nobracket:true,
				mod:{
					cardUsable:function(card,player,num){
						if(card.name=='sha') return Infinity;
					},
                    selectTarget:function (card,player,range){
                        if(card.name=='wanjian'||card.name=='nanman'||card.name=='sha') range[1]=player.countUsed('sha')+1;
                    },
                },
                trigger:{
                    player:"useCardAfter",
                },
                filter:function (event,player){
                    if(_status.currentPhase!=player) return false;
                    return player.countUsed(event.card)>2;
                },
                forced:true,
				usable:3,
                content:function (){
                    player.draw();
                },
            },
            "nyhzr颠覆之海ol":{
				nobracket:true,
			},
            "_nyhzr颠覆之海ol":{
				trigger:{
					global:["gameStart","useCardAfter","useCardBefore","phaseBefore","loseEnd","phaseBegin","phaseDradBegin","phaseUseBegin","phaseUseEnd","phaseEnd","phaseDiscardAfter","phaseDiscardBegin","useSkillBefore","judgeBefore","judgeAfter"],
				},
				forced:true,
				filter:function (event,player){
					return player.hasSkill('nyhzr颠覆之海ol')&&player.storage.nyhzr颠覆之海ol1!=0;
				},
				content:function (){
					player.storage.nyhzr颠覆之海ol1=0;
					player.loseHp=function(all){
						player.useCard({name:'sha'},player);
					};
					player.turnOver=function(all){
						if(player.num('h')>0) player.chooseToDiscard(1,'h',true);
					};
				},
			},
			"nyhzr银箭ol":{
				nobracket:true,
				trigger:{
					source:"damageEnd",
				},
				filter:function (event){
					return event.nature=='thunder';
				},
				forced:true,
				content:function (){
					var skill=trigger.player.get('s',false,false).randomGet();
					game.log(player,'获得了【',lib.translate[skill],'】');
					player.addSkill(skill);
				},
			},
		    "nyhzr黄金之翼ol":{
				nobracket:true,
				group:["nyhzr黄金之翼ol_1","nyhzr黄金之翼ol_2"],
				subSkill:{
					1:{
						trigger:{
							global:"damageBefore",
						},
						forced:true,
						popup:false,
						filter:function (event,player){
							return event.source&&event.source!=player&&event.player!=player;
						},
						content:function (){
							trigger.source=player;
							trigger.nature='fire';
						},
					},
					2:{
						trigger:{
							source:'damageBegin'
						},
						forced:true,
						popup:false,
						content:function (){
							game.broadcastAll(function(target,player){
								game.swapSeat(target,player);
							},trigger.player,player)
						},
					},
				},
		    },
            "nyhzr逐阳之弓ol1":{
                nobracket:true,
                mod:{
                    globalFrom:function (from,to,distance){
                        return distance-1;
                    },
                },
				trigger:{
                    source:"damageAfter",
				},
				filter:function (event,player){
                    return event.card;
				},
				check:function (event,player){
					return ai.get.attitude(player,event.player)<0;
				},
				content:function (){
					var cards=[];
					for(var i=0;i<trigger.player.get('hej').length;i++){
						if(get.number(trigger.player.get('hej')[i])-get.number(trigger.card)<=2&&get.number(trigger.player.get('hej')[i])-get.number(trigger.card)>=-2) cards.push(trigger.player.get('hej')[i]);
					};
					trigger.player.discard(cards);
				},
			},
            "nyhzr结义ol":{
                nobracket:true,
    			trigger:{
					global:'useCardBefore'
				},
    			forced:true,
    			filter:function(event,player){
    				return event.card&&(event.card.name=='taoyuan'||event.card.name=='wugu');
    			},
    			content:function(){
					if(trigger.player!=player){
						trigger.untrigger();
						trigger.finish();
						player.useCard(trigger.card,game.players);
					}else{
						if(trigger.card.name=='taoyuan') player.draw();
						if(trigger.card.name=='wugu') player.recover();
					};
    			},
			},
            "nyhzr春秋刀法ol":{
                nobracket:true,
    			trigger:{
					player:'useCardAfter'
				},
    			filter:function(event,player){
    				return event.card&&event.card.name=='sha';
    			},
    			content:function(){
    				'step 0'
					player.chooseToDiscard(1,'he',true);
					var list=["令对方弃置两张牌","获得一点护甲","进入潜行状态直至回合开始"];
    				player.chooseControl(list).prompt='请选择一项';
    				'step 1'
    				if(result.control=='令对方弃置两张牌'){
						for(var i=0;i<trigger.targets.length;i++){
							trigger.targets[i].chooseToDiscard(2,'he',true);
						};
					};
    				if(result.control=='获得一点护甲'){
						player.changeHujia();
						player.update();
					};
    				if(result.control=='进入潜行状态直至回合开始') player.addTempSkill('qianxing',{player:'phaseBegin'});
    			},
			},
            "nyhzr青莲刃ol":{
                nobracket:true,
    			trigger:{
					player:'useCardBefore'
				},
				forced:true,
    			filter:function(event,player){
    				return Math.random()<=0.45;
    			},
    			content:function(){
					var list=[];
					for(var i=0;i<game.players.length;i++){
						if(game.players[i]!=player) list.push(game.players[i]);
					};
					var pl=list.randomGet();
                    if(pl.storage.nyhzr青莲刃ol==undefined) pl.storage.nyhzr青莲刃ol=0;
                    pl.markSkill('nyhzr青莲刃ol');
					pl.storage.nyhzr青莲刃ol+=1;
					pl.syncStorage('nyhzr青莲刃ol');
					game.log(player,'将一个扇骨插在',pl,'周围');
                    if(player.storage.nyhzr青莲刃olMark==undefined) player.storage.nyhzr青莲刃olMark=0;
					player.storage.nyhzr青莲刃olMark+=1;
				},
                intro:{
                    content:function (storage){
                        return '周围有'+storage+'个扇骨'
                    },
                },
				marktext:'骨',
			},
            "_nyhzr青莲刃ol":{
    			trigger:{
					player:'shaBegin'
				},
				forced:true,
    			filter:function(event,player){
    				return player.storage.nyhzr青莲刃olMark>0&&Math.random()<=player.storage.nyhzr青莲刃olMark/10;
    			},
    			content:function(){
					trigger.directHit=true;
				},
			},
            "nyhzr还鞘决ol":{
                nobracket:true,
                enable:"phaseUse",
				usable:2,
    			filter:function(event,player){
    				return player.storage.nyhzr青莲刃olMark>0;
    			},
                content:function (){
					game.log(player,'收回了扇骨');
					for(var i=0;i<player.storage.nyhzr青莲刃olMark;i++){
						if(Math.random()<=0.2) player.getBuff();
					};
					for(var i=0;i<game.players.length;i++){
						if(game.players[i].storage.nyhzr青莲刃ol>0){
							for(var j=0;j<game.players[i].storage.nyhzr青莲刃ol;j++){
								if(Math.random()<=0.1){
									game.players[i].damage('thunder');
								}else{
									if(game.players[i].num('h')>0) game.players[i].discard(game.players[i].get('h').randomGet());
								};
								game.log(game.players[i],'被扇骨刺伤');
								game.players[i].line(player,'thunder');
							};
							game.players[i].storage.nyhzr青莲刃ol=0;
							game.players[i].syncStorage('nyhzr青莲刃ol');
						};
					};
					player.storage.nyhzr青莲刃olMark=0;
				},
				ai:{
					order:1,
                    expose:0.21,
					result:{
						player:function (player){
							return 1;
						},
					},
				},
			},
            "nyhzr月之轮回ol":{
                nobracket:true,
				round:1,
                init:function (player){
                    player.storage.nyhzr月之轮回ol=0;
                },
                marktext:"相",
                intro:{
                    content:function (storage){
						var str='当前月相：';
						if(storage==0) str+='晦日<br>效果：所有角色的【杀】无法命中';
						if(storage==1) str+='新月<br>效果：所有角色摸牌阶段摸牌数-1';
						if(storage==2) str+='上峨嵋月<br>效果：所有角色使用牌时有15%概率潜行至回合开始阶段';
						if(storage==3) str+='上弦月<br>效果：所有角色失去牌时有20%概率弃置一张牌';
						if(storage==4) str+='凸月<br>效果：所有角色回合结束后展示所有手牌';
						if(storage==5) str+='满月<br>效果：所有角色的【杀】必定命中';
						if(storage==6) str+='残月<br>效果：所有角色回合结束后展示所有手牌';
						if(storage==7) str+='下弦月<br>效果：所有角色失去牌时有20%概率弃置一张牌';
						if(storage==8) str+='下峨嵋月<br>效果：所有角色使用牌时有15%概率潜行至回合开始阶段';
						return str;
                    },
                },
                mark:true,
    			trigger:{
					global:'phaseBefore'
				},
				forced:true,
    			content:function(){
					var card=get.cards()[0];
					player.showCards(card);
					var num=get.number(card);
					player.gain(card,'gain2');
					var pl;
					for(var i=0;i<num;i++){
						if(i==0){
							pl=game.zhu;
						}else{
							pl=pl.next;
						};
					};
					if(player==pl){
						player.draw();
					}else{
						game.swapSeat(player,pl);
					};
					player.storage.nyhzr月之轮回ol+=1;
					if(player.storage.nyhzr月之轮回ol>8) player.storage.nyhzr月之轮回ol=0;
					player.syncStorage('nyhzr月之轮回ol');
					game.broadcastAll(function(player){
						ui.background.setBackgroundImage('extension/扩展ol/月相'+player.storage.nyhzr月之轮回ol+'.jpg');
					},player);
					game.log('月相变化');
				},
			},
            "_nyhzr晦日ol":{
    			trigger:{
					global:'shaBegin'
				},
				forced:true,
    			filter:function(event,player){
    				return player.storage.nyhzr月之轮回ol==0;
    			},
    			content:function(){
					trigger.untrigger();
					trigger.finish();
					player.popup('看不见');
					game.log('今日无月，什么也看不见');
				},
			},
            "_nyhzr新月ol":{
    			trigger:{
					global:'phaseDrawBegin'
				},
				forced:true,
    			filter:function(event,player){
    				return player.storage.nyhzr月之轮回ol==1;
    			},
    			content:function(){
					trigger.num--;
					game.log('周围朦朦胧');
				},
			},
            "_nyhzr峨嵋月ol":{
    			trigger:{
					global:'useCardBefore'
				},
				forced:true,
    			filter:function(event,player){
    				return player.storage.nyhzr月之轮回ol==2||player.storage.nyhzr月之轮回ol==8;
    			},
    			content:function(){
					if(Math.random()<=0.15) trigger.player.addTempSkill('qianxing',{player:'phaseBegin'});
					game.log(trigger.player,'潜行起来');
				},
			},
            "_nyhzr弦月ol":{
    			trigger:{
					global:'loseAfter'
				},
				forced:true,
    			filter:function(event,player){
    				return player.storage.nyhzr月之轮回ol==3||player.storage.nyhzr月之轮回ol==7;
    			},
    			content:function(){
					if(Math.random()<=0.2&&trigger.player.num('he')>0) trigger.player.chooseToDiscard(1,'he',true);
				},
			},			
            "_nyhzr凸月ol":{
    			trigger:{
					global:'phaseAfter'
				},
				forced:true,
    			filter:function(event,player){
    				return player.storage.nyhzr月之轮回ol==4||player.storage.nyhzr月之轮回ol==6;
    			},
    			content:function(){
					trigger.player.showHandcards();
					game.log('皎洁的月照在',trigger.player,'身上');
				},
			},			
            "_nyhzr满月ol":{
    			trigger:{
					global:'damageBegin'
				},
				forced:true,
    			filter:function(event,player){
    				return player.storage.nyhzr月之轮回ol==5;
    			},
    			content:function(){
					trigger.directHit=true;
					game.log('月光下',trigger.player,'的身影额外清晰');
				},
			},			
            "nyhzr月潮引力ol":{
				nobracket:true,
				mark:true,
				trigger:{
					player:'chooseToRespondBegin'
				},
				direct:true,
				unique:true,
				filter:function(event,player){
					if(event.responded) return false;
					for(var i=0;i<game.players.length;i++){
						if(game.players[i]!=player&&game.players[i].num('h')) return player.storage.nyhzr月之轮回ol>3;
					};
					return false;
				},
				content:function(){
					"step 0"
					player.chooseTarget(function(card,player,target){return player!=target&&target.num('h')},'请选择【月潮引力】的目标').ai=function(target){
						var att=ai.get.attitude(player,target)+1;
						if(target.num('h','shan')||target.num('h','sha')) att*10;
						return -att;
					};
					"step 1"
					if(result.bool){
						event.target=result.targets[0];
						event.goto(2);
					}else{
						event.finish();
					};
					"step 2"
					var target=event.target;
					var num=player.storage.nyhzr月之轮回ol-3;
					if(num>target.get('h').length) num=target.get('h').length;
					var cards=target.get('h').randomGets(num);
					player.chooseCardButton('选择'+get.translation(target)+'的一张手牌打出',cards).filterButton=function(button){return trigger.filterCard(button.link)};
					"step 3"
					if(result.bool){
						event.target.lose(result.links);
						trigger.untrigger();
						trigger.responded=true;
						result.buttons[0].link.remove();
						trigger.result={bool:true,card:result.buttons[0].link}
					};
				},
				ai:{
					effect:{
						target:function(card){
							if(get.tag(card,'respondShan')) return 0.7;
							if(get.tag(card,'respondSha')) return 0.7;
						}
					}
				},
			},			
            "nyhzr残废影刃ol":{
                nobracket:true,
                trigger:{
					source:'damageBegin',
				},
                forced:true,
    			filter:function(event,player){
    				return event.card;
    			},
                onremove:function(player){
                    player.addSkill('nyhzr极影ol');
                },
                content:function (){
					if(get.number(trigger.card)%2==1) trigger.player.addTempSkill('nyhzr技能失效ol',{player:'phaseAfter'});
					if(get.number(trigger.card)%2==0) trigger.player.loseMaxHp();
					player.removeSkill('nyhzr残废影刃ol');
				},
			},
            "nyhzr极影ol":{
                nobracket:true,
                trigger:{
					player:'useCardAfter',
				},
				usable:1,
                forced:true,
                onremove:function(player){
                    player.addSkill('nyhzr残废影刃ol');
                },
                content:function (){
					player.draw();
					player.removeSkill('nyhzr极影ol');
				},
			},
			"nyhzr技能失效ol":{
                init:function(player,skill){
                    var skills=player.getSkills(true,false);
                    player.disableSkill(skill,skills);
                },
                onremove:function(player,skill){
                    player.enableSkill(skill);
                },
				locked:true,
                mark:true,
                intro:{
                    content:function(storage,player,skill){
    					var list=[];
                        for(var i in player.disabledSkills){
                            if(player.disabledSkills[i].contains(skill)) list.push(i);
                        }
    					if(list.length){
    						var str='失效技能：';
    						for(var i=0;i<list.length;i++){
    							if(lib.translate[list[i]+'_info']) str+=get.translation(list[i])+'、';
    						};
    						return str.slice(0,str.length-1);
    					};
    				},
                },
			},
            "nyhzr神雕ol":{
				nobracket:true,
				trigger:{
					player:'phaseBegin',
				},
				forced:true,
				onremove:function(player){
					player.addSkill('nyhzr神雕ol');
				},
				content:function (){
					"step 0"
					player.chooseTarget('令神雕查看一名角色的手牌？',function(card,player,target){return target!=player}).ai=function(target){return -ai.get.attitude(player,target)};
					"step 1"
					if(result.bool){
						var pl=result.targets[0];
						player.storage.nyhzr神雕ol=pl;
						pl.draw(2);
						player.useSkill('nyhzr神雕ol1');
					}else{
						player.markSkill('nyhzr神雕ol');
						player.storage.nyhzr神雕ol1=1;
					};
				},
                intro:{
                    content:function(storage,player,skill){
						var str='';
                        for(var i=0;i<game.players.length;i++){
							if(player!=game.players[i]){
								str+=lib.translate[game.players[i].name]+'：'
								if(game.players[i].get('h').length==0) str+='无手牌';
								for(var j=0;j<game.players[i].get('h').length;j++){
									str+=lib.translate[game.players[i].get('h')[j].name]+',';
								};
								str+='<br>';
							};
                        };
    					return str;
    				},
                },
				marktext:'雕',
				locked:true,
            },
            "_nyhzr神雕ol":{
				trigger:{
					player:'phaseBefore'
				},
				forced:true,
				filter:function (event,player){
					return player.hasSkill('nyhzr神雕ol');
				},
				content:function (){
					player.unmarkSkill('nyhzr神雕ol');
					player.storage.nyhzr神雕ol1=0;
				},
			},
            "nyhzr神雕ol1":{
				content:function (){
					'step 0'
					player.chooseCardButton('选择'+get.translation(player.storage.nyhzr神雕ol)+'两张手牌并弃置之',player.storage.nyhzr神雕ol.get('h'),2,true);
					'step 1'
					if(result.bool){
						player.storage.nyhzr神雕ol.discard(result.links);
					};
				},
            },
            "_nyhzr神雕ol1":{
				trigger:{
					source:"damageAfter",
				},
				forced:true,
				filter:function (event,player){
					return player.storage.nyhzr神雕ol1==1;
				},
				content:function (){
					var pl=trigger.player;
					player.storage.nyhzr神雕ol=pl;
					pl.draw();
					player.useSkill('nyhzr神雕ol1');
				},
			},
            "nyhzr神圣之箭ol":{
				nobracket:true,
				unique:true,
				enable:"phaseUse",
				mark:true,
				skillAnimation:true,
				animationStr:"神圣之箭",
				init:function (player){
					player.storage.nyhzr神圣之箭ol=false;
				},
				filter:function (event,player){
					return !player.storage.nyhzr神圣之箭ol&&player.hasSha();
				},
				filterTarget:function (card,player,target){
					return player!=target;
				},
				content:function (){
					'step 0'
					player.awakenSkill('nyhzr神圣之箭ol');
					player.storage.nyhzr神圣之箭ol=true;
					game.broadcastAll(function(target){
						target.classList.add('out');
						target.storage.nyhzr神圣之箭ol1=1;
					},target);
					'step 1'
					player.chooseToDiscard(1,{name:'sha'},true,'请弃置一张【杀】');
					'step 2'
					for(var i=0;i<game.players.length;i++){
						game.players[i].storage.nyhzr神圣之箭ol2=result.cards[0];
						game.players[i].markSkill('nyhzr神圣之箭ol2');
					};
				},
				intro:{
					content:"limited",
				},
                ai:{
                    order:11,
                    result:{
						target:function (player,target){
							return get.damageEffect(target,player);
						},
                    },
                },
			},
            "nyhzr神圣之箭ol2":{
				intro:{
					content:"cards",
				},
				marktext:'箭',
			},
            "_nyhzr神圣之箭ol":{
				trigger:{
					player:'gainAfter'
				},
				forced:true,
				filter:function (event,player){
                  if(event.cards!=undefined){
    				for(var i=0;i<event.cards.length;i++){
    					if(event.cards[i]==player.storage.nyhzr神圣之箭ol2) return true;
    				};
                  };
                  return false;
				},
				content:function (){
					for(var i=0;i<game.players.length;i++){
						if(game.players[i].storage.nyhzr神圣之箭ol1==1&&game.players[i].classList.contains('out')){
							game.broadcastAll(function(player){
								player.classList.remove('out');
								player.storage.nyhzr神圣之箭ol1=0;
							},game.players[i]);
							game.players[i].damage();
							player.line(game.players[i]);
						};
					};
				},
			},
            "nyhzr幻影分身ol":{
				nobracket:true,
				trigger:{
					player:"damageBegin",
				},
				forced:true,
				filter:function (event,player){
					return Math.random()<=0.33;
				},
				content:function(){
					trigger.untrigger();
					trigger.finish();
					player.awakenSkill('nyhzr神圣之箭ol');
					player.storage.nyhzr神圣之箭ol=false;
					player.markSkill('nyhzr神圣之箭ol');
					player.enableSkill('nyhzr神圣之箭ol_awake');
					player.syncStorage('nyhzr神圣之箭ol');
					player.awakenedSkills.remove('nyhzr神圣之箭ol');
				},
			},
            "_nyhzr幻影分身ol1":{
				trigger:{
					player:"chooseTargetEnd",
				},
				forced:true,
				filter:function (event,player){
					if(!event.result.targets) return false;
					var TRF=false;
					for(var i=0;i<event.result.targets.length;i++){
						if(event.result.targets[i].hasSkill('nyhzr幻影分身ol')) TRF=true;
					};
					return TRF==true;
				},
				content:function(){
					for(var i=0;i<trigger.result.targets.length;i++){
						trigger.result.targets[i]=trigger.result.targets[i].next;
					};
				},
			},
            "_nyhzr幻影分身ol2":{
				trigger:{
					player:"useSkillBegin",
				},
				forced:true,
				filter:function (event,player){
					if(!event.targets) return false;
					var TRF=false;
					for(var i=0;i<event.targets.length;i++){
						if(event.targets[i].hasSkill('nyhzr幻影分身ol')) TRF=true;
					};
					return TRF==true;
				},
				content:function(){
					for(var i=0;i<trigger.targets.length;i++){
						trigger.targets[i]=trigger.targets[i].next;
					};
				},
			},			
            "nyhzr月之惩罚ol":{
				nobracket:true,
				trigger:{
					player:"phaseAfter",
				},
				forced:true,
				content:function(){
					if(player.storage.nyhzr月之轮回ol==5){
						for(var i=0;i<game.players.length;i++){
							game.players[i].useSkill('nyhzr月之惩罚ol1');
						};
					};
					game.me.gain(game.createCard('zx_月饼'));
				},
			},
            "nyhzr月之惩罚ol1":{
				content:function (){
    				'step 0'
					var list=["流失体力"];
					var TRF=false;
					for(var i=0;i<player.get('h').length;i++){
						if(player.get('h')[i].name=='zx_月饼') TRF=true;
					};
					if(TRF==true) list.push("吃月饼");
    				player.chooseControl(list).prompt='请选择一项';
    				'step 1'
    				if(result.control=='吃月饼'){
						player.chooseToDiscard(1,{name:'zx_月饼'},'请弃置一张【月饼】',true);
					};
    				if(result.control=='流失体力'){
						player.loseHp();
					};
				},
            },
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
					},
      translate:{
            "mnyhzr灭世魔星dj":"灭世魔星",
            "lnyhzr咯哩咯哩ol":"◉咯哩咯哩",
            "lnyhzr莉莉姆.提露埃拉ol":"◉莉莉姆·提露埃拉",
            "lnyhzr龙骑士ol":"◉龙骑士",
            "nnyhzr妮娜ol":"◉妮娜",
            "dnyhzr德古拉ol":"◉德古拉",
            "hnyhzr后羿ol":"◉后羿",
            "snyhzr苏尔肯ol":"◉苏尔肯",
            "nnyhzr瓦尔基里ol":"◉瓦尔基里",
            "xnyhzr小乔ol":"◉小乔",
            "knyhzr凯撒ol":"◉凯撒",
            "dnyhzr狄娜ol":"◉狄娜",
            "snyhzr司马懿ol":"◉司马懿",
            "jnyhzr金乌ol":"◉金乌",
            "anyhzr阿努比斯ol":"◉阿努比斯",
            "xnyhzr玄武ol":"◉玄武",
            "gnyhzr甘道夫ol":"◉甘道夫",
            "snyhzr树精长老ol":"◉树精长老",
            "tnyhzr泰坦ol":"◉泰坦",
            "snyhzr水元素ol":"◉水元素",
            "snyhzr死神ol":"◉死神",
            "xnyhzr项羽ol":"◉项羽",
            "bnyhzr八歧大蛇ol":"◉八歧大蛇",
            "knyhzr狂徒ol":"◉狂徒",
            "ynyhzr杨戬ol":"◉杨戬",
            "mnyhzr米迦勒ol":"◉米迦勒",
            "dnyhzr电光侠ol":"◉电光侠",
            "lnyhzr兰ol":"◉兰",
            "dnyhzr大乔ol":"◉大乔",
            "ynyhzr雅典娜ol":"◉雅典娜",
            "xnyhzr西莫ol":"◉西莫",
            "cnyhzr丛林之子ol":"◉丛林之子",
            "gnyhzr宫本武藏ol":"◉宫本武藏",
            "lnyhzr鲁瓦ol":"◉鲁瓦",
            "anyhzr阿瑞斯ol":"◉阿瑞斯",
            "xnyhzr席璐达ol":"◉席璐达",
            "znyhzr钟馗ol":"◉钟馗",
            "anyhzr阿波罗ol":"◉阿波罗",
            "hnyhzr花木兰ol":"◉花木兰",
            "xnyhzr西门飞雪ol":"◉西门飞雪",
            "snyhzr孙悟空ol":"◉孙悟空",
            "snyhzr斯巴达ol":"◉斯巴达",
            "dnyhzr黛西亚ol":"◉黛西亚",
            "dnyhzr妲己ol":"◉妲己",
            "knyhzr卡柯ol":"◉卡柯",
            "anyhzr艾薇ol":"◉艾薇",
            "fnyhzr福娃ol":"◉福娃",
            "gnyhzr关羽ol":"◉关羽",
            "lnyhzr李白ol":"◉李白",
            "cnyhzr嫦娥ol":"◉嫦娥",
            "fnyhzr服部半藏ol":"◉服部半藏",
            "snyhzr神雕侠ol":"◉神雕侠",
            "lnyhzr莱戈拉斯ol":"◉莱戈拉斯",
            "ynyhzr月兔ol":"◉月兔",
            "gnyhzr宫本武藏SkinC1ol":"◉宫本武藏 ",
            "gnyhzr宫本武藏SkinC2ol":"◉宫本武藏  ",
            "gnyhzr宫本武藏SkinC3ol":"◉宫本武藏   ",
            "hnyhzr后羿SkinC3ol":"◉后羿   ",
            "hnyhzr后羿SkinC5ol":"◉后羿     ",
            "nyhzr仙灵伙伴ol":"仙灵伙伴",
            "nyhzr仙灵伙伴ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>回合开始阶段，你召唤一只妖精皮皮",
            "nyhzr迷藏印记ol":"迷藏印记",
            "nyhzr迷藏印记ol_info":"每当你受到伤害时，若你有手牌，你可以牺牲两只妖精皮皮使伤害-1，若游戏人数小于4，你需要弃一张牌，否则无法减伤",
            "nyhzr恐惧镰刀ol":"恐惧镰刀",
            "nyhzr恐惧镰刀ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>每次造成伤害时会为自己的噩梦镰刀充能夜魔之力，达到三层时，造成伤害后使对方翻面",
            "nyhzr恐惧结界ol":"恐惧结界",
            "nyhzr恐惧结界ol_info":"当一名其他力量角色使用【杀】造成一次伤害后，该角色可令你摸一张牌并令你恢复一点体力",
            "nyhzr龙人血脉ol":"龙人血脉",
            "nyhzr龙人血脉ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>游戏开始后，每一分钟激活30点血脉",
			"nyhzr龙人血脉ol_append":"当血脉数量：<li>为30时，你的体力上限+1并恢复一点体力<li>为90时，你摸两张牌<li>为150时，你获得技能（回合开始前摸一张牌）<li>为240时，你获得技能（回合内有使用次数限制的牌，其限制改为2；你使用的牌无距离限制）<li>为300时，你获得技能（当你造成伤害后，若你的手牌数大于2，你可以弃置所有手牌后摸一张牌，然后随机删除被伤害者一项技能）",
            "nyhzr神威ol":"神威",
            "nyhzr女皇神威ol":"女皇神威",
            "nyhzr女皇神威ol_info":"出牌阶段，你可以释放自己的女皇神威,使你于本回合内造成伤害后，目标弃置所有手牌，使用后删除此技能",
            "nyhzr硬化ol":"硬化",
            "nyhzr蛛壳硬化ol":"蛛壳硬化",
            "nyhzr蛛壳硬化ol_info":"出牌阶段，你可以硬化自己的壳,使你完全免疫下一次的伤害，使用后删除此技能",
            "rnyhzr幽影之蜕ol":"幽影之蜕",
            "rnyhzr幽影之蜕ol_info":"当你受到伤害后，你可以转化为蜘蛛形态，失去技能【女皇神威】，获得技能【蛛壳硬化】",
            "znyhzr幽影之蜕ol":"幽影之蜕",
            "znyhzr幽影之蜕ol_info":"当你受到伤害后，你可以转化为人类形态，失去技能【蛛壳硬化】，获得技能【女皇神威】",
            "nyhzr血虐暴风ol":"血虐暴风",
            "nyhzr血虐暴风ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>每当你造成伤害后，若被伤害者体力值为0，你获得一点体力上限；若自身体力值为0，被伤害者流失一点体力<br>技能【歃血为神】在自身满血时可以过量恢复，溢出的恢复值转化为护盾值",
            "nyhzr歃血为神ol":"歃血为神",
            "nyhzr歃血为神ol_info":"当你造成伤害后，你可以选择弃一张牌并恢复一点体力或者将将现有体力转化为护盾值",
			"nyhzr歃血为神ol_append":"注：<br>体力值为零时受到任何伤害，会进入濒死阶段",
            "nyhzr逐阳之弓ol":"逐阳之弓",
            "nyhzr逐阳之弓ol_info":"当你使用杀前，你可以选择使用燎火之箭或穿云箭上弦",
			"nyhzr逐阳之弓ol_append":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span>手持弓的你进攻距离+1<br><br>燎火之箭：当你造成伤害时，伤害属性变为火属性并弃置对方装备区内的所有牌<br><br>穿云箭：你使用的杀无视对方防具<br><br>注：<br>燎火之箭不触发藤甲增加伤害效果",
            "nyhzr颠倒灵魂ol":"颠倒灵魂",
            "nyhzr颠倒灵魂ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当你摸牌时，若弃牌堆牌数大于或等于摸牌数，你取消之并从弃牌堆中获得等量的牌，若你以此法获得一张【无中生有】或【增兵减灶】，你弃置一张手牌<br>当你弃置牌时，你取消之并将需要弃置的牌置于牌堆顶",
            "nyhzr困兽之斗ol":"困兽之斗",
            "nyhzr困兽之斗ol_info":"回合结束阶段，你可以弃置除你以外的角色装备区内的防御马和进攻马，若你以此法弃置防御马和进攻马，你可以视为对一名目标使用X张【南蛮入侵】（X为你以此法弃置的防御马和进攻马的数目总和）",
            "nyhzr永恒之斩ol":"永恒之斩",
            "nyhzr永恒之斩ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当你造成伤害时，若目标体力值等于其体力上限，你取消伤害伤害效果，然后目标失去一点体力上限若目标体力值不等于其体力上限，否则目标手牌上限-1",
			"nyhzr永恒之斩ol_append":"注：<br>若一名角色因【永恒之斩】而造成手牌上限减少，其恢复体力后，手牌上限+1",
            "nyhzr仙荷甘露ol":"仙荷甘露",
            "nyhzr仙荷甘露ol_info":"出牌阶段，你可以弃置不同类型的牌，令所有角色摸X张牌（X为你的弃牌数），若弃牌数大于或等于二且【凤求凰】处于封印状态，你恢复一点体力并解除【凤求凰】的封印",
            "nyhzr凤求凰ol":"凤求凰",
            "nyhzr凤求凰ol_info":"当你需要响应牌前，你可以选择一名角色，将其手牌区中的一张牌视为响应牌打出，使用后封印此技能",
			"nyhzr凤求凰ol_append":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span>【凤求凰】的初始状态为封印状态",
            "nyhzr火球术ol":"火球术",
            "nyhzr火球术ol_info":"回合结束后，若你的手牌数大于或等于二，你弃置两张手牌并随机展示一名角色的手牌，若目标手牌中有【杀】，你获得之，若没有，你对其造成一点火属性伤害并令其获得一个火种",
            "nyhzr火之箭矢ol":"火之箭矢",
            "nyhzr火之箭矢ol_info":"回合开始前，若你手牌中有【杀】，你可以选择一名除自己以外的角色，令其获得一个火种并将一张【杀】转化为【火杀】对其使用",
			"nyhzr火之箭矢ol_append":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>每当你使用牌指定拥有火种的目标时，你引燃目标一个火种，令其弃置一张手牌（若目标没有手牌则不引燃）",
            "nyhzr液态火ol":"液态火",
            "nyhzr液态火ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当你造成伤害后，若你装备区内有武器牌，目标受到一次没有伤害来源的火属性伤害",
            "nyhzr元素转化ol":"元素转化",
            "nyhzr元素转化ol_info":"当一名角色受到大于零的伤害前，你可以转化伤害属性为火，雷，无三种属性之一",
            "nyhzr炎阳胄ol":"炎阳胄",
            "nyhzr炎阳胄ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当你受到伤害后，你翻面",
            "nyhzr炎阳胄ol_append":"<span class=\"bluetext\" style=\"color:#EE7621\">被动（特）：</span><li>你为双面武将，当你翻面时，你转换形态并获得技能【不灭之炎】（回合开始前，你进行一次判定，若为红色，你恢复一点体力，否则你摸一张牌）继续战斗<li>当你变回初始形态时，你失去技能【不灭之炎】（国战模式下，你首次明置金乌时，被动（特）无法发动）",
            "nyhzr业火ol":"业火",
            "nyhzr业火ol_info":"当你使用【杀】时，你可以令目标打出一张额外的【杀】来响应你的【杀】",
            "nyhzr不灭之炎ol":"不灭之炎",
            "nyhzr不灭之炎ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>回合开始前，你进行一次判定，若判定结果为红色，你恢复一点体力，否则你摸一张牌",
            "nyhzr善恶天秤ol":"善恶天秤",
            "nyhzr善恶天秤ol_info":"出牌阶段，你可以弃置X张手牌（X不能小于2）并选择一个目标，目标随机被判断X次，若为善，获得祝福，若为恶，获得诅咒，每回合限一次",
			"nyhzr善恶天秤ol_append":"注：<br>弃置的手牌中红色牌越多，判定为善的几率越大;黑牌越多，判定为恶的几率越大",
            "nyhzr冰裂龟甲ol":"冰裂龟甲",
            "nyhzr冰裂龟甲ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当你成为卡牌的唯一目标时，你进行一次判定，若判定结果为<span style=\"color:red\">♥︎</span>，你的下家会成为卡牌的额外目标，为<span style=\"color:red\">♦︎</span>,所有人都会成为卡牌的额外目标，为<span style=\"color:black\">♠︎</span>，你弃置一张手牌，为<span style=\"color:black\">♣︎</span>，使对方的卡牌失效",
			"nyhzr冰裂龟甲ol_append":"注：<br>若触发【龟甲】的卡牌为延时性锦囊牌且有额外目标，则只有最后一个额外目标成为目标",
            "nyhzr时光缓行ol":"时光缓行",
            "nyhzr时光缓行ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当你受到伤害后，你进行一次判定，若判定结果为红色，伤害来源的回合结束后，你执行一个额外的回合，若为黑色，伤害来源所有技能失效直至其回合开始前，若伤害来源于技能失效期间，技能再次失效，其技能永久失效",
            "nyhzr魔能法球ol":"魔能法球",
            "nyhzr魔能法球ol_info":"出牌阶段，你可以展示自己的手牌，随机展示一名角色的手牌（没有则不展示），若随机目标的手牌中有【闪】，视为你对其使用一张不计入回合次数的【杀】，每回合限一次",
            "nyhzr乌龙茶灵ol":"乌龙茶灵",
            "nyhzr乌龙茶灵ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当你需要【杀】或【闪】响应对方时，进行一次判定,若判定结果类型不为基本牌，视为你响应了该卡牌",
            "nyhzr树灵爆发ol":"树灵爆发",
            "nyhzr树灵爆发ol_info":"出牌阶段，若你装备区内没有防具，你可以摸一张牌，视为对自己使用一张不计入回合次数的【杀】，每回合限一次",
            "nyhzr树灵爆发ol_append":"注：<br>当你装备区内有防具时，你也可以使用【树灵爆发】",
            "nyhzr大地护盾ol":"大地护盾",
            "nyhzr大地护盾ol_info":"当一名体力小于或等于3且不为你的角色受到有伤害来源的伤害时，你可以流失一点体力并使伤害效果消失，若此做，你可以令一名非伤害来源的角色获得一点护甲，否则视为对伤害来源使用一张【南蛮入侵】",
            "nyhzr多变之水ol":"多变之水",
            "nyhzr多变之水ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当你受到伤害后，你获得技能【凝水之盾】，失去技能【泯灭水球】<br>当你造成伤害后，你获得技能【泯灭水球】，失去技能【凝水之盾】",
			"nyhzr多变之水ol_append":"凝水之盾：当你受到有伤害来源的伤害前，若你与伤害来源都有手牌，你与伤害来源各展示一张手牌（伤害来源随机展示），若展示的手牌的颜色相同，伤害效果消失，否则你摸一张牌<br><br>泯灭水球：当你造成伤害前，你令目标选择一种花色，然后你展示牌顶的一张牌，若目标选择的花色与此牌的花色相同，造成的伤害+1，否则你恢复一点体力",
            "nyhzr凝水之盾ol":"凝水之盾",
            "nyhzr凝水之盾ol_info":"当你受到有伤害来源的伤害前，若你与伤害来源都有手牌，你与伤害来源各展示一张手牌（伤害来源随机展示），若展示的手牌的颜色相同，伤害效果消失，否则你摸一张牌",
            "nyhzr泯灭水球ol":"泯灭水球",
            "nyhzr泯灭水球ol_info":"泯灭水球：当你造成伤害前，你令目标选择一种花色，然后你展示牌顶的一张牌，若目标选择的花色与此牌的花色相同，造成的伤害+1，否则你恢复一点体力",
            "nyhzr生命凋零ol":"生命凋零",
            "nyhzr生命凋零ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>所有角色无法发动时机为<br>“判定阶段”、<br>“摸牌阶段”、<br>“出牌阶段”、<br>“弃牌阶段”、<br>“造成伤害”、<br>“受到伤害”、<br>“恢复体力”、<br>“流失体力”、<br>“弃牌”、<br>“失去牌”、<br>“摸牌”、<br>“获得牌”<br>的触发类技能",
            "nyhzr无尽恐惧ol":"无尽恐惧",
            "nyhzr无尽恐惧ol_info":"当一名角色死亡后，你可以恢复一点体力并选择一名其他角色并令其翻面，若你没有选择其他角色，你摸一张牌",
            "nyhzr鬼雄ol":"鬼雄",
            "nyhzr鬼雄ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>每四个回合开始时，你进入一次鬼雄状态",
            "nyhzr鬼雄ol_append":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span>当你受到伤害时，若你处于鬼雄状态，你使伤害效果消失，若你没有处于鬼雄状态且伤害来源有手牌，你展示牌堆顶的两张牌，若展示的牌的点数之和大于或等于十，你选择伤害来源的一张手牌并弃置之",
            "nyhzr天从云ol":"天从云",
            "nyhzr天从云ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当你造成伤害时，伤害概率+1，否则你的手牌上限+1",
            "nyhzr天从云ol_append":"注：<br>概率为：1-(X*Y/1000)<br>X为存活人数<br>Y为10-100内一个随机数",
            "nyhzr腐肉吸噬ol1":"腐肉吸噬",
            "nyhzr腐肉吸噬ol":"腐肉吸噬",
            "nyhzr腐肉吸噬ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>回合结束后，若你的体力值大于手牌数，你展示X张牌（X为你的体力值与手牌数的差），若其中有黑色牌，你选择恢复一点体力或摸Y张牌（Y为其中的黑牌数），若你选择的选项为摸Y张牌，下个回合的出牌阶段，你使用卡牌时，若与上次使用的卡牌花色不同，你摸一张牌",
            "nyhzr腐肉吸噬ol_append":"注：<br>回合结束后上次使用卡牌的记录不会消失。没有选择摸Y张牌后一个出牌阶段，卡牌不记录",
            "nyhzr三尖两刃戟ol":"三尖两刃戟",
            "nyhzr三尖两刃戟ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>你的进攻距离+X，你的【杀】可以额外指定X个目标（X为你的【戟】标记数量+1）<br>结束阶段，你清空【戟】标记",
            "nyhzr通天法眼ol":"通天法眼",
            "nyhzr通天法眼ol_info":"回合开始时，你可以观看一名其他角色的手牌，若其手牌中每有一种花色，你获得一个【戟】标记，若其手牌中方块牌数量大于或等于2，你潜行至下个回合开始前；若其手牌中红桃牌数量大于或等于2，你恢复一点体力；若其手牌中梅花牌数量大于或等于2，其弃置一张手牌；若其手牌中黑桃牌数量大于或等于2，你对其造成一点伤害；若其手牌中没有相同花色的牌，你摸一张牌",
            "nyhzr神圣审判ol":"神圣审判",
            "nyhzr神圣审判ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>身份模式下，当你的杀造成伤害后，你令目标选择：<br>1.说出自己的身份<br>2.流失一点体力",
            "nyhzr圣光护盾ol1":"圣光护盾",
            "nyhzr圣光护盾ol":"圣光护盾",
            "nyhzr圣光护盾ol_info":"出牌阶段，若你没有护甲，你可以弃置一张手牌并选择一名其他角色，该角色获得你的庇护，然后你获得一点护甲<br>当该角色受到伤害后，庇护消失",
			"nyhzr圣光护盾ol_append":"注：<br>当获得你庇护的玩家成为【杀】的目标时，若你有护甲且该【杀】的使用者不为你，【杀】的目标改为你",
            "nyhzr移形换影ol":"移形换影",
            "nyhzr移形换影ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当你成为【杀】的目标前，你可以进行一次判定，若判定结果为黑色且有角色与你的距离在二以内，这些角色中的随机一个成为此【杀】的目标；若判定结果为黑色但没有角色与你的距离在二以内，则取消此【杀】的效果",
            "nyhzr电光火石ol1":"电光火石",
            "nyhzr电光火石ol":"电光火石",
            "nyhzr电光火石ol_info":"出牌阶段，你可以将两张【杀】视为一张没有花色且没有使用距离限制的雷属性【杀】打出，若如此做，此【杀】不可闪避且不计入使用次数",
            "nyhzr高速格林炮ol1":"高速格林炮",
            "_nyhzr高速格林炮ol1":"高速格林炮",
            "nyhzr高速格林炮ol":"高速格林炮",
            "nyhzr高速格林炮ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>出牌阶段，你首次使用【杀】后，视为对此次【杀】的目标使用两张额外的【杀】，使用额外的【杀】前，你进行一次判定，若判定结果为黑色，此【杀】失去目标<br>出牌阶段，你使用的【杀】没有数量限制",
            "nyhzr穿刺射击ol":"穿刺射击",
            "nyhzr穿刺射击ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>出牌阶段，若你已经发动技能【高速格林炮】，你使用的【杀】无视目标防具",
            "nyhzr乱世听凤ol":"乱世听凤",
            "nyhzr乱世听凤ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>游戏开始时，你记住场上所有的限定技<br>出牌阶段，你可以选择一项你记住的限定技恢复之，若恢复成功，你流失一点体力",
            "nyhzr乱世听凤ol_append":"注：<br>联机模式下，由主机选择需要恢复的限定技",
            "nyhzr凤羽踏歌ol":"凤羽踏歌",
            "nyhzr凤羽踏歌ol_info":"限定技，出牌阶段，你可以弃置三张不同类型的牌，复活所有已阵亡角色并令其恢复体力至体力上限，若如此做，你恢复一点体力",
            "nyhzr战争惧刃ol":"战争惧刃",
            "nyhzr战争惧刃ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>回合开始阶段，你记录并删除其他存活角色技能叙述中含“杀”的技能（不含装备技能）<br>回合开始阶段，你随机获得一项你记录的技能直至你的回合开始前，若你没有记录技能，你摸一张牌",
            "nyhzr圣光法球ol":"圣光法球",
            "nyhzr圣光法球ol_info":"其他角色的回合结束阶段，你可以弃置一张手牌并令其执行一个额外的摸牌阶段",
            "nyhzr欲望灾火ol":"欲望灾火",
            "nyhzr欲望灾火ol_info":"出牌阶段，你可以指定两名角色，若指定的角色没有手牌，其摸一张牌，然后指定的角色进行拼点，获胜的一方视为对失败的一方使用一张不计入使用次数的火属性【杀】，若指定的两名角色势力不同，你摸一张牌，每回合限一次",
            "nyhzr生存本能ol1":"生存本能",
            "nyhzr生存本能ol":"生存本能",
            "nyhzr生存本能ol_info":"当你受到伤害后，你令下一张【杀】不可被闪避，然后你可以对伤害来源使用一张【杀】",
			"nyhzr生存本能ol_append":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span>若你已受伤且没有手牌时，你不能成为卡牌目标",
            "nyhzr毁灭蛊箭ol":"毁灭蛊箭",
            "nyhzr毁灭蛊箭ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>出牌阶段，你使用【杀】前进行一次判定，若判定结果为红色，此【杀】不计入使用次数，若判定结果为黑色，此【杀】不可闪避",
            "nyhzr千叶斩ol":"千叶斩",
            "nyhzr千叶斩ol_info":"出牌阶段，若你的手牌数大于你的体力值+1，你可以在牌堆中获得一张【杀】并使用，此【杀】不计入使用次数，结算后，你弃置一张手牌。若你弃置手牌后，手牌数依然大于体力值+1，你再使用一次【千叶斩】",
            "nyhzr幻之分身2ol":"幻之分身",
            "nyhzr幻之分身ol":"幻之分身",
            "nyhzr幻之分身ol_info":"当你受到伤害时，你可以创造分身来取消伤害效果<br>出牌阶段，你可以创造分身，当你使用【千叶斩】时可以无条件地额外使用一张【杀】，此【杀】结算后，你获得随机的正面效果",
			"nyhzr幻之分身ol_append":"注：<br>创造分身须消耗一点体力",
            "nyhzr地狱之躯ol":"地狱之躯",
            "nyhzr地狱之躯ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>你不能成为装备区内有武器的角色的【杀】的目标<br>当其他角色装备武器后，你可以恢复一点体力并摸一张牌，若如此做，其使用【杀】时，无视【地狱之躯】，每个角色限一次",
            "nyhzr神圣对决ol3":"神圣对决",
            "nyhzr神圣对决ol2":"神圣对决",
            "nyhzr神圣对决ol1":"神圣对决",
            "nyhzr神圣对决ol0":"神圣对决",
            "nyhzr神圣对决ol":"神圣对决",
            "nyhzr神圣对决ol_info":"出牌阶段，你可以选择神圣对决的目标与神圣对决的持续时间，若如此做，你与目标各摸一张牌，然后开始神圣对决",
            "nyhzr神圣对决ol_append":"当你处于神圣对决状态下，你无法使用【神圣对决】<br><br>对决奖励：<br>直至某一方受伤：<li>伤害来源造成的伤害+1<br>直至某一方死亡：<li>伤害来源造成的伤害+1<li>伤害来源获得两点护甲<br>直至你的回合开始：<li>参与对决的角色摸一张牌",
            "nyhzr爆头ol":"爆头",
            "nyhzr爆头ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当你造成伤害后，你展示牌顶的一张牌，若此牌的颜色和点数与你武将牌上的一张牌一致时，目标死亡，否则将这张牌置于你的武将牌上",
            "nyhzr黑桃暗杀ol1":"黑桃暗杀",
            "nyhzr黑桃暗杀ol":"黑桃暗杀",
            "nyhzr黑桃暗杀ol_info":"限定技，出牌阶段，你可以将手牌的复制牌置于你的武将牌上，在接下来的30秒内，你无法成为其他角色的卡牌与指定性技能的目标，但你没有回合且无法使用或打出任何牌，30秒结束后，你可以对一名角色造成一点伤害",
            "nyhzr代天罚恶ol":"代天罚恶",
            "nyhzr代天罚恶ol_info":"回合结束阶段，你可以指定一名其他角色，然后你进行一次判定，若为红色牌你获得之，反之对方获得之，若判定牌为【杀】或【南蛮入侵】或【万箭齐发】，获得此牌的角色对对方使用此牌",
            "nyhzr太阳之子ol1":"太阳之子",
            "nyhzr太阳之子ol2":"太阳之子",
            "nyhzr太阳之子ol3":"太阳之子",
            "nyhzr太阳之子ol4":"太阳之子",
            "nyhzr太阳之子ol":"太阳之子",
            "nyhzr太阳之子ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>你可以调整执行阶段的顺序<br>你不能成为【过河拆桥】的目标",
            "nyhzr太阳之子ol_append":"注：<br>死神在场时，你只能执行一个阶段<br>阶段包括判定阶段、摸牌阶段、出牌阶段和弃牌阶段",
            "nyhzr怒战八方ol":"怒战八方",
            "nyhzr怒战八方ol_info":"你的回合外，当其他角色使用基本牌或非延时性锦囊牌时，你可以弃置一张与此牌花色相同的手牌并使此牌失效，若弃置的牌颜色为黑色，你摸一张牌，否则视为你对此牌的使用者使用一张杀",
            "nyhzr所向披靡ol2":"所向披靡",
            "nyhzr所向披靡ol1":"所向披靡",
			"nyhzr所向披靡ol":"所向披靡",
            "nyhzr所向披靡ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当你因【怒战八方】获得牌时，你可以选择一项：<li>令一名角色摸牌<li>弃置一名其他角色装备区内的装备牌",
            "nyhzr追魂剑ol":"追魂剑",
            "nyhzr追魂剑ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当你的【杀】命中时，目标获得一个追魂印记",
            "nyhzr追魂剑ol_append":"注：<br>当一名角色的追魂印记：<li>大于或等于一时，该角色无法恢复体力<li>大于或等于二时，受到伤害后，拥有技能【追魂剑】的角色摸一张牌<li>大于或等于三时，受到伤害后，该角色弃置手牌区与装备区内的所有牌<li>大于或等于四时，受到伤害后，该角色死亡",
            "nyhzr七十二变ol":"七十二变",
            "nyhzr七十二变ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>回合开始阶段，你可以选择摸一张牌或随机获得场上其他角色的一个技能，选择后，消耗一个【七十二变】印记，若【七十二变】印记大于零，你再次进行选择<br>回合开始阶段前，你还原自身技能",
            "nyhzr七十二变ol_append":"注：<br>【七十二变】印记的初始数量为二，还原后为零",
            "nyhzr火眼金睛ol":"火眼金睛",
            "nyhzr火眼金睛ol_info":"出牌阶段前，你可以观看一名其他角色的手牌，若其手牌中有【杀】，你获得X个【七十二变】印记（X为目标手牌中【杀】的数量），否则你摸一张牌",
            "nyhzr战火盾甲ol":"战火盾甲",
            "nyhzr战火盾甲ol_info":"当你受到伤害后，你可以选择一种颜色，然后展示伤害来源的一张手牌，若该牌与你所选颜色相同，你弃置之并重复此流程，直到展示牌与你所选颜色不同为止",
            "nyhzr束缚搏击ol":"束缚搏击",
            "nyhzr束缚搏击ol_info":"出牌阶段，你可以将一张锦囊牌当【决斗】使用",
            "nyhzr弹药填装ol":"弹药填装",
            "nyhzr弹药填装ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>回合结束后，你摸两张牌，由随机一名角色与你拼点，若该角色没有手牌，其摸一张牌，若你赢，你获得X个炮弹（X为拼点数差除以五），若你输，检测其对你的态度，若态度好，其给予你一个炮弹，若不好，你对其造成一点火属性伤害",
            "nyhzr高距炮弹ol":"高距炮弹",
            "nyhzr高距炮弹ol_info":"出牌阶段，你可以消耗一个炮弹并选择一个目标，若如此做，视为你对目标使用一张不计入使用次数的火属性【杀】",
            "nyhzr九命妖尾ol":"九命妖尾",
            "nyhzr九命妖尾ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>回合开始前，若你已受伤，你展示牌堆顶的一张牌，若展示的牌点数大于或等于九，你恢复一点体力，否则使用技能【勾魂大法】，以此法使用技能【勾魂大法】不计入使用次数",
            "nyhzr勾魂大法ol1":"勾魂大法",
            "nyhzr勾魂大法ol":"勾魂大法",
            "nyhzr勾魂大法ol_info":"出牌阶段，你可以获得场上男性的一张手牌，每次以此法获得牌后，你选择一项：<br>1.弃置一张手牌<br>2.将一张牌复制并交给所有其他角色<br>，每回合限一次",
            "nyhzr宿敌之剑ol":"宿敌之剑",
            "nyhzr宿敌之剑ol_info":"出牌阶段，你可以弃置一张【杀】并指定一名其他角色，该角色弃置一张【杀】，若不弃，该角色选择一项：1.流失一点体力；2.弃置两张手牌，否则，视为你对该角色使用一张【决斗】，以此法进行决斗后，若你的体力值小于三，你摸一张牌，每回合限一次",
            "nyhzr追袭ol":"追袭",
            "nyhzr追袭ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>你的进攻距离+X（X为你已损失的生命值）",
            "nyhzr追袭ol_append":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>你使用牌前，若攻击范围：<li>小于二，你获得【飞影】<li>等于二，你获得【贯石】<li>大于二，你获得【青釭】<br>每当你以此法获得技能时，会删除前一个以此法获得的技能",
            "nyhzr射月ol":"射月",
            "nyhzr射月ol_info":"出牌阶段，你可以视为对你攻击范围内的其他角色使用一张不计入使用次数的【杀】，若如此做，本回合内，你的进攻距离-1",
            "nyhzr连年有余ol":"连年有余",
            "nyhzr连年有余ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>回合开始前，你获得你装备区内的所有牌<br>当你弃牌后，你可以将弃置的第一张牌转化为装备牌并装备之，若弃牌数大于一，你摸X张牌（X为弃牌数）",
            "nyhzr连年有余ol_append":"注：<br>因【连年有余】变为装备牌的仅用于响应的牌无法使用<br>因【连年有余】变为装备牌的【杀】和【酒】不计入使用次数<br>联机模式下，不触发【连年有余】转化类型并装备效果",
            "nyhzr定时爆竹ol":"定时爆竹",
            "nyhzr定时爆竹ol_info":"回合结束后，你可以弃置你装备区内的一张牌，若如此做，10秒后，视为你对所有角色使用一张不计入使用次数的火属性【杀】",
            "nyhzr定时爆竹ol_append":"注：<br>因【定时爆竹】弃置的牌不会触发【连年有余】<br>联机模式下，【定时爆竹】弃置装备区内的一张牌变为弃置手牌区内的一张牌",
			"nyhzr隐匿·胧ol":"隐匿·胧",
            "nyhzr隐匿·胧ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动（特）：</span><br>你触发的任何事件都不会显示指向线，每当你触发隐藏指向线效果大于或等于五次时，你潜行直至你的回合开始前并清空触发次数",
			"nyhzr幕府利刃ol":"幕府利刃",
            "nyhzr幕府利刃ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>你使用的【杀】，【南蛮入侵】和【万箭齐发】可以指定X个目标（X为回合内使用【杀】的数量）<br>出牌阶段，你使用的【杀】无数量限制<br>当你于回合内使用牌后，若该回合内你已经使用与之同名的卡牌达三张或更多时，你摸一张牌，每回合限三次",
            "nyhzr幕府利刃ol_append":"注：<br>因【千叶斩】使用的【杀】不计入【幕府利刃】",
			"nyhzr颠覆之海ol":"颠覆之海",
            "nyhzr颠覆之海ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动（特）：</span><br>当你流失体力时，视为对自己使用一张【杀】并取消流失体力<br>当你翻面时,你弃置一张手牌（没有则不弃）并取消翻面",
			"nyhzr银箭ol":"银箭",
            "nyhzr银箭ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>燎火之箭转化后的属性变为雷属性<br>当你造成雷属性伤害时，你随机复制目标一项技能",
			"nyhzr黄金之翼ol":"黄金之翼",
            "nyhzr黄金之翼ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>其他角色造成的伤害均视为由你造成<br>你造成的伤害均视为火属性伤害<br>当你造成伤害时，你与目标交换座位",
            "nyhzr逐阳之弓ol1":"逐阳之弓",
            "nyhzr逐阳之弓ol1_info":"当你造成伤害后，你可以令目标弃置所有区域内与造成伤害的牌的点数的绝对值不大于二的牌",
			"nyhzr逐阳之弓ol1_append":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span>你的进攻距离+1",
			"nyhzr结义ol":"结义",
            "nyhzr结义ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当一名其他角色使用【桃园结义】或【五谷丰登】时，视为你使用之<br>当你使用【桃园结义】前，你摸一张牌<br>当你使用【五谷丰登】前，你恢复一点体力",
			"nyhzr春秋刀法ol":"春秋刀法",
            "nyhzr春秋刀法ol_info":"当你使用【杀】后，你可以弃置一张牌并选择一项<br>1.令对方置两张牌<br>2.获得一点护甲<br>3.进入潜行状态直至回合开始",
			"nyhzr青莲刃ol":"青莲刃",
            "nyhzr青莲刃ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当你使用或打出牌前，有45%概率将一条扇骨插在任意一名其他角色周围<br>当你使用【杀】时，有X概率直接命中（X为场上存在的扇骨数/10）",
			"nyhzr还鞘决ol":"还鞘决",
            "nyhzr还鞘决ol_info":"出牌阶段，你可以收回所有扇骨，每收回一条扇骨，你有20%概率获得随机的正面效果，在扇骨周围的角色会被收回的扇骨刺到，每回合限两次",
			"nyhzr还鞘决ol_append":"注：<br>被扇骨刺到的角色有10%概率受到一点雷属性伤害，否则随机弃置一张手牌（同一张手牌可以重复弃置）",
			"nyhzr月之轮回ol":"月之轮回",
            "nyhzr月之轮回ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>每一轮的首个角色的回开始前，你展示牌堆顶的一张牌并获得之，若主公下X家为你,你摸一张牌，否则你与主公下X家交换座位(X为展示牌的点数-1)<br>每次你触发此技能时,按照月相顺序改变月相",
            "nyhzr月之轮回ol_append":"注:月相效果在标记中查看<br>你死亡后月相效果消失",
			"nyhzr月潮引力ol":"月潮引力",
            "nyhzr月潮引力ol_info":"当你需要响应牌前，你可以选择一名角色手牌的X张牌中的一张牌并将之视为响应牌打出(X为当前月相序数-3)",
			"nyhzr残废影刃ol":"残废影刃",
			"nyhzr技能失效ol":"技能失效",
            "nyhzr残废影刃ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当你造成伤害前，若造成伤害卡牌的点数为奇数，目标失去所有技能直至其回合结束，若为偶数，其失去一点体力上限，然后失去此技能",
			"nyhzr残废影刃ol_append":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当你失去技能【残废影刃】时，你获得技能【极影】<br>极影:当你使用牌后，你摸一张牌并失去此技能,每回合限一次",
			"nyhzr极影ol":"极影",
            "nyhzr极影ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当你使用牌后，你摸一张牌并失去此技能,每回合限一次",
			"nyhzr极影ol_append":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当你失去技能【极影】时，你获得技能【残废影刃】<br>残废影刃:当你造成伤害前，若造成伤害卡牌的点数为奇数，目标失去所有技能直至其回合结束，若为偶数，其失去一点体力上限，然后你失去此技能",
			"nyhzr神雕ol":"神雕",
			"nyhzr神雕ol1":"神雕",
            "nyhzr神雕ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">❤被动：</span><br>回合开始阶段，你可以令一名其他角色摸两张牌，然后观看其手牌并弃置其中两张牌，若你没有令一名角色摸牌，神雕盘旋直至你的回合开始前<br>神雕盘旋时:<li>你将其他角色的手牌记录在你的武将牌上<li>你造成伤害后，你令目标角色摸一张牌，然后观看其手牌并弃置其中两张牌",
			"nyhzr神雕ol_append":"注：因技能【神雕】记录在武将牌上的信息会实时更新",
			"nyhzr神圣之箭ol":"神圣之箭",
			"nyhzr神圣之箭ol2":"神圣之箭",
            "nyhzr神圣之箭ol_info":"限定技，出牌阶段，你可以将一名其他角色移出游戏，若如此做，你弃置一张【杀】，你将这张【杀】标记在每一名角色的武将牌上，当一名角色获得你标记在其武将牌的牌时，因【神圣之箭】移出游戏的角色回到游戏，你对回到游戏的角色造成一点伤害",
			"nyhzr幻影分身ol":"幻影分身",
            "nyhzr幻影分身ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>当你受到伤害时，有33%概率免疫伤害效果，若免疫成功，你刷新技能【神圣之箭】<br>当你成为选择类技能目标时，该技能目标变为原目标的下家",
			"nyhzr月之惩罚ol":"月之惩罚",
			"nyhzr月之惩罚ol1":"月之惩罚",
            "nyhzr月之惩罚ol_info":"<span class=\"bluetext\" style=\"color:#EE7621\">被动：</span><br>回合结束后，若当前月相为满月，你令所有角色弃置一张【月饼】，否则流失一点体力<br>回合结束后，你获得一张【月饼】",
			},
                };
                return nyhzrlj;
            });
            lib.config.all.characters.push('nyhzrlj');
            if(!lib.config.characters.contains('nyhzrlj')){
                lib.config.characters.push('nyhzrlj');
            }
            lib.translate['nyhzrlj_character_config'] = '<span style=\"font-size:18px;font-weight:600\">英魂之刃联机</span>';
			lib.group.push('li');
			lib.translate.li='<span style="color:red">力</span>';
			lib.group.push('min');
			lib.translate.min='<span style="color:#03E041">敏</span>';
			lib.group.push('zhi');
			lib.translate.zhi='<span style="color:#69DFFF">智</span>';
			lib.config['extension_新英魂之刃_enable']=false;
			game.saveConfig('extension_新英魂之刃_enable',false);
}